[
  {
    "date": "2020-03-03T13:05:37Z",
    "account_name": "John Marshal",
    "url": "https://www.trustpilot.com/users/5e564e4e6ca7154f41846603",
    "article": "Frankly I initially had some issues scheduling with a business coach who came with the service package I got. But I’m glad we were able to find common time because the sessions were very productive if not eye-opening. If you’re getting premium services, my advise is to book the coaching sessions in advance. Their business coaches might be in short supply.",
    "replies": ""
  },
  {
    "date": "2020-02-28T10:33:33Z",
    "account_name": "Rachel Lopez",
    "url": "https://www.trustpilot.com/users/5e58ec23d6661af713c60272",
    "article": "Th folks from CoachingBusiness are very easy to work with. I’ve acquired their services a few times before and they’ve always delivered the services they promised. I will always recommend CoachingBusiness for anyone needing professional online marketing services.",
    "replies": ""
  },
  {
    "date": "2020-02-21T12:34:14Z",
    "account_name": "Scotty Mickens",
    "url": "https://www.trustpilot.com/users/5e4fbc0a878fee6332c56b1f",
    "article": "At first, I was quite unsure about investing in Coaching Business’ sales funnel package, but after listening to my colleague’s words, I decided to give it a try. God!! It worked even better than the conversion strategy I bought from a renowned company. I feel glad to hire their 5 stars deserving service!!",
    "replies": ""
  },
  {
    "date": "2020-02-17T11:46:21Z",
    "account_name": "Donald Leslie",
    "url": "https://www.trustpilot.com/users/5e4a47b17168c079284d3356",
    "article": "Their sales funnel can really help entrepreneurs like me who are just starting their business in efficiently targeting customers. I also appreciate their customer support team who responds quickly to my questions.",
    "replies": ""
  },
  {
    "date": "2020-02-12T11:06:51Z",
    "account_name": "Roy Trevino",
    "url": "https://www.trustpilot.com/users/5e43cf8c9f3d29c63b28e191",
    "article": "Coaching Business has been a great help to my sales and marketing team. Their creative and unique ideas have given a great boost to our social media marketing campaign. Thanks to them, as we are getting better sales now. Highly satisfied with their awesome services.",
    "replies": ""
  },
  {
    "date": "2020-02-10T09:47:05Z",
    "account_name": "Lillian Edmunds",
    "url": "https://www.trustpilot.com/users/5d5e988ee427cd783407c809",
    "article": "I was not aware of how important digital marketing was for businesses until I tried Coaching Business’s complete package. Aside from it being reasonably priced, this service also delivers concrete results and improvements to one’s business. Also, their customer support team are amazing people who truly want to help their clients with issues and delays! Nothing more I can say but their services are indeed 5 out of 5.",
    "replies": ""
  },
  {
    "date": "2020-02-08T08:00:07Z",
    "account_name": "Samuel Wilson",
    "url": "https://www.trustpilot.com/users/5df80c4997520b461ec342d1",
    "article": "Their SEO-enabled social media promotion services are perfect for businesses like mine that need to boost publicity to earn a significant amount of money. I have tried other digital marketing services providers, and I can say that CoachingBusiness.org is one, if not the best, of the recommended providers online.",
    "replies": ""
  },
  {
    "date": "2020-02-06T07:41:20Z",
    "account_name": "Jackson Stella",
    "url": "https://www.trustpilot.com/users/5e382000616781dcbc8e28d1",
    "article": "Very accommodating customer support team.",
    "replies": ""
  },
  {
    "date": "2020-02-04T07:09:05Z",
    "account_name": "Madalyn Dunlap",
    "url": "https://www.trustpilot.com/users/5e31220f616781c3df8aa643",
    "article": "My husband and I have a 10-year old business that almost got bankrupt because of all the rent and utility bills for the company. So, we decided to make it an online shop, to save it from totally shutting down. A friend recommended to us the Coaching Business’s complete package that includes site creation, sales funnel, a sales video, and social media promotion. To our surprise, it is relatively cheaper than other packages we looked up online. Three months after the full implementation of the online business, we were back on our feet, and we are now earning five times more than before (and now we do not have to worry about rent and utility bills)",
    "replies": ""
  },
  {
    "date": "2020-02-01T07:15:36Z",
    "account_name": "Alfred Landers",
    "url": "https://www.trustpilot.com/users/5e3524faddcefa7a44633655",
    "article": "I invested in their sales funnel creation package to enhance conversion on my new website and I'm satisfied with their work. They delivered what I wanted. Thanks to such amazing services, my business is getting more sales prospects. Excellent!!",
    "replies": ""
  },
  {
    "date": "2020-01-30T11:13:20Z",
    "account_name": "Helen Acuna",
    "url": "https://www.trustpilot.com/users/5e3155c1ddcefa2740610297",
    "article": "We have started getting more sales prospects on our business site, and the whole credit goes to the great efforts of Coaching business. Thanks to their social media promotion services we are getting better juice flow in our money site than ever. Genuinely impressed with their outstanding services!",
    "replies": ""
  },
  {
    "date": "2020-01-28T09:54:25Z",
    "account_name": "Sawyer Harrell",
    "url": "https://www.trustpilot.com/users/5ddf5ad2af1b9d8fce5e024e",
    "article": "Love their customer support team, who are always enthusiastic in helping me out with my concerns. Kudos.",
    "replies": ""
  },
  {
    "date": "2020-01-25T08:01:27Z",
    "account_name": "Mary Kinney",
    "url": "https://www.trustpilot.com/users/5e2933a1ddcefa47005cec4e",
    "article": "Just want to let you know that you helped me a lot in establishing my start-up business. Excellent job! Looking forward to working with you again.",
    "replies": ""
  },
  {
    "date": "2020-01-23T06:17:01Z",
    "account_name": "Doris Lopez",
    "url": "https://www.trustpilot.com/users/5e293061616781653c86a044",
    "article": "I had a fantastic session with the social media manager and video editor assigned to me. They explained each step thoroughly that I feel more confident in strategizing for my business, especially when using online tools in the process. Indeed, excellent service by coaching business.",
    "replies": ""
  },
  {
    "date": "2020-01-18T07:42:53Z",
    "account_name": "Lana Woodward",
    "url": "https://www.trustpilot.com/users/5e218e6f013d413881242102",
    "article": "Fantastic customer support team! They are always available to respond to my concerns and queries. Highly recommendable!",
    "replies": ""
  },
  {
    "date": "2020-01-14T06:33:25Z",
    "account_name": "Tanner Cancel",
    "url": "https://www.trustpilot.com/users/5e1c3d63013d41818f2125e0",
    "article": "Coaching Business has really helped me a lot in promoting my business! Their social media marketing team is great to work with. They single-handedly promoted our entire business online and got us a great engagement. I would just love to use their services again if ever needed. Thank you!",
    "replies": ""
  },
  {
    "date": "2020-01-09T06:51:02Z",
    "account_name": "Michael Rodriguez",
    "url": "https://www.trustpilot.com/users/5e15b877fa8e7b6172d18e87",
    "article": "It was really tough for me to build an engaging as well as a productive website. But, the highly skilled and professional team of Coaching Business helped me greatly. They have made a straightforward website with their proven techniques. I am just amazed with their excellent services. 5 stars!",
    "replies": ""
  },
  {
    "date": "2020-01-04T08:10:02Z",
    "account_name": "Florine Whitfield",
    "url": "https://www.trustpilot.com/users/5e01edf0b14ccf860bf4c477",
    "article": "Besides transparency and substantial growth, my follower's list on social media has been tripled within the past two months. That’s the evidence of Coaching Business’s awesomeness in delivering valuable lessons. Thank you so much, team.",
    "replies": ""
  },
  {
    "date": "2020-01-02T07:48:26Z",
    "account_name": "David Rinehart",
    "url": "https://www.trustpilot.com/users/5e0aeda431bb5aa23e92c566",
    "article": "Creating social media content was quite a daunting task before I met these guys. With their premium content creation package, I have passed the milestones that were beyond my business’s expectations. My team just loved their SEO article writing approach. Keep going!!",
    "replies": ""
  },
  {
    "date": "2019-12-31T07:20:35Z",
    "account_name": "Donald Jordan",
    "url": "https://www.trustpilot.com/users/5dfdab8c9848361357759cf6",
    "article": "A billion thanks to Coaching Business and their highly knowledgeable team, who developed extreme abilities in my marketing professionals. I’m thrilled to see a notable increase in ROI and the volume of traffic for social media campaigns. Keep up your great doings.",
    "replies": ""
  },
  {
    "date": "2019-12-28T07:31:02Z",
    "account_name": "Gloria Holmes",
    "url": "https://www.trustpilot.com/users/5dfddde3361d61759904ff0b",
    "article": "Have been using their premium social media search engine content creation package for a couple of months only, and it has really helped me a lot in promoting my business. Along with it, the copywriter who was assigned to us wrote highly converting, SEO-enabled blog posts and articles regarding our business. It was really a great pleasure using their services. Excellent work.",
    "replies": ""
  },
  {
    "date": "2019-12-26T09:57:58Z",
    "account_name": "Kevin Davis",
    "url": "https://www.trustpilot.com/users/5dfcaa7d984836db5c750eab",
    "article": "I got two one-hour coaching sessions in the social media promotion package through which I got to learn a lot of things. Apart from that, the team that was assigned to us promoted our business and products on all the major social media platforms with ease. As a result, we now have better ROI and engagement than ever before. This was really a great help for us. Highly impressed with the results, would recommend these people to everyone.",
    "replies": ""
  },
  {
    "date": "2019-12-24T10:34:21Z",
    "account_name": "Mary Stewart",
    "url": "https://www.trustpilot.com/users/5e005ce031bb5ac3ab8e666f",
    "article": "They have really been a great help to my sales and marketing team. All their innovative ideas have given a great boost to our social media marketing, and thanks to that we are getting better juice flow into our website. 100% satisfied!",
    "replies": ""
  },
  {
    "date": "2019-12-24T07:19:56Z",
    "account_name": "George Franco",
    "url": "https://www.trustpilot.com/users/5da975017472134546e1378f",
    "article": "I hired Coaching Business to build a website for my business. These people have done an excellent job at it, the site looks rich and has a friendly user-interface. The team delivered the finished site under the given time-frame. I am really impressed with their work and would love to work with them again. Great Services.",
    "replies": ""
  },
  {
    "date": "2019-12-20T08:21:49Z",
    "account_name": "Aaliyah Roth",
    "url": "https://www.trustpilot.com/users/5de88fa3741d5fc1f833fea4",
    "article": "I have been using their services for business promotion for the last 8 months, and never experienced anything negative. Their social media promotion package has helped me to promote my content on different social media platforms and get stellar results. Recommended.",
    "replies": ""
  },
  {
    "date": "2019-12-16T10:24:03Z",
    "account_name": "Anita Durbin",
    "url": "https://www.trustpilot.com/users/5df08c88520b42f3ecff1f6a",
    "article": "With a small footprint, we have started our social media journey and Coaching Business has been a great asset to our company. They have fulfilled our every expectation and helped us to get a substantial growth in our social media following. Very pleased with their amazing service.",
    "replies": ""
  },
  {
    "date": "2019-12-12T10:41:30Z",
    "account_name": "Destiny Tafoya",
    "url": "https://www.trustpilot.com/users/5de63040741d5f540c328c59",
    "article": "We had a great experience working with Coaching Business. Their SEO and social media marketing efforts have been a great help to us. Now, we are getting more leads to our website than before. Great Services.",
    "replies": ""
  },
  {
    "date": "2019-12-10T08:36:33Z",
    "account_name": "Gerard Shelton",
    "url": "https://www.trustpilot.com/users/5de4a6e2ebb74638ef00ebcf",
    "article": "Thrilled with the outcome. We purchased their complete site creation, and sales funnel package to grow our company. With their assistance, our revenue has gone up, and our website has been developed. Looking to work with them again. Great service.",
    "replies": ""
  },
  {
    "date": "2019-12-05T08:21:29Z",
    "account_name": "Lamar Spain",
    "url": "https://www.trustpilot.com/users/5de0c680741d5f8421303c4d",
    "article": "Your team has made my professional life quite comfortable. Though I’m competent at social media marketing approach, it was swallowing more of my work time. With your methodical strategies, my business is experiencing new heights and a significant push in potential leads. Of course, highly recommended.",
    "replies": ""
  },
  {
    "date": "2019-11-25T08:21:13Z",
    "account_name": "Genevieve Mcgee",
    "url": "https://www.trustpilot.com/users/5dd515800410533efa441f69",
    "article": "If you are looking for a website that will truly consider your business needs, and market your products accordingly, Coaching Business is the one and only answer for you. Their social media promotion strategies are just amazing and have helped me in gaining a lot more leads than before. I can see my business growing faster than before. Excellent service.",
    "replies": ""
  },
  {
    "date": "2019-11-21T05:52:40Z",
    "account_name": "Wilbert Fuller",
    "url": "https://www.trustpilot.com/users/5dce9758fcb7ef292c1abdb9",
    "article": "They spearheaded our social media marketing efforts to help us bring better growth and revenue for our business. We are quite pleased with their excellent service. All in all, 5 stars.",
    "replies": ""
  },
  {
    "date": "2019-11-18T11:01:05Z",
    "account_name": "Bella Baxter",
    "url": "https://www.trustpilot.com/users/5da0737bf685678bf188a599",
    "article": "We had taken their social media promotion ultimate package and very happy with their services. The manager assigned to us was very knowledgeable, his coaching sessions were of great help. Also he has done an incredible job in promoting our products on social media. 5 Stars .",
    "replies": ""
  },
  {
    "date": "2019-11-16T08:33:41Z",
    "account_name": "Garcia Charles D.",
    "url": "https://www.trustpilot.com/users/5dcd52f702f86e66079281eb",
    "article": "We hired them to create sales funnel and bring more conversions for our business, and they seem to be delivering us the same. After taking their service we had a huge growth in our revenue. A big thanks to them.",
    "replies": ""
  },
  {
    "date": "2019-11-14T13:39:01Z",
    "account_name": "Joe Hoeger",
    "url": "https://www.trustpilot.com/users/5dc40ebe567fde42cb06def2",
    "article": "Coaching business has really helped me a lot in promoting my business! Their social media marketing team are great to work with, and I would love to use their services again in the near future. Thumbs up",
    "replies": ""
  },
  {
    "date": "2019-11-08T12:31:16Z",
    "account_name": "Peter Cremin",
    "url": "https://www.trustpilot.com/users/5db971faf577ff3af50a9414",
    "article": "The content creation package that I purchased from here is outstanding! Their SEO articles are the best and have driven a lot of traffic on my business website. Increasing engagement has never been so quick and easy for me earlier. Excellent service.",
    "replies": ""
  },
  {
    "date": "2019-11-04T11:49:41Z",
    "account_name": "Nicholas Ross",
    "url": "https://www.trustpilot.com/users/5db98f804e68162b1f52d27c",
    "article": "I must say, investing in the sales funnel creation package here was the right decision. It has really helped our marketing team to generate more leads and conversions for our business. Satisfied customers.",
    "replies": ""
  },
  {
    "date": "2019-11-01T05:22:58Z",
    "account_name": "Deborah Cota",
    "url": "https://www.trustpilot.com/users/5db98a5a204297a95ca5146d",
    "article": "They have been a great help to my sales and marketing team. Their innovative ideas have given quite a boost to our social media marketing, and thanks to that we are getting better juice flow into our website. Very satisfied with their awesome services.",
    "replies": ""
  },
  {
    "date": "2019-10-29T08:18:27Z",
    "account_name": "Bailey Fraser",
    "url": "https://www.trustpilot.com/users/5dad86a60f4c1a0d4db77b39",
    "article": "Coaching business has been very helpful in promoting our business and services on social media. Thanks to them, our reach has been doubled in a month. Great Services.",
    "replies": ""
  },
  {
    "date": "2019-10-25T11:28:45Z",
    "account_name": "John Wehrle",
    "url": "https://www.trustpilot.com/users/5da064092cab1352a9679d4a",
    "article": "Coaching Business offers the best SEO marketing service in the market! The articles and other targeted content that these people have written for my website are just amazing and have driven a lot of traffic. Thanks to their service, now I am able to increase my business sales rate.",
    "replies": ""
  },
  {
    "date": "2019-10-22T11:36:02Z",
    "account_name": "Sophia Smith",
    "url": "https://www.trustpilot.com/users/5af2a94c4de5666d3471d0d9",
    "article": "I must say, these people are the best! They did an amazing job in creating my website and creating a highly effective funnel for me. I am gaining more leads and make much higher profits. Thank you so much.",
    "replies": ""
  },
  {
    "date": "2019-10-19T05:08:31Z",
    "account_name": "Shane Seth",
    "url": "https://www.trustpilot.com/users/5da855994ee2a913ac50f6f4",
    "article": "These people have really helped us to save time and close more deals consistently. Thanks to them, as they have made customized sales funnel for our business which has been a huge help in boosting our business. 100% satisfied.",
    "replies": ""
  },
  {
    "date": "2019-10-15T10:03:46Z",
    "account_name": "Maria Cody",
    "url": "https://www.trustpilot.com/users/5da064947c1d9c5a66197e3c",
    "article": "I've worked with CoachingBusiness for social media, SEO, lead generation, funnel creation, etc. Their teamwork and professionalism is impressive, and the results they deliver are great. Thumbs up.",
    "replies": ""
  },
  {
    "date": "2019-10-07T12:00:45Z",
    "account_name": "George Brooks",
    "url": "https://www.trustpilot.com/users/5d8b1d82bbeb9722a3ea8b55",
    "article": "Promoting my website on social media and search engine has become so much easier and effective with your SEO targeted articles. I am very happy with the growth my business is experiencing. Your services are worth every penny!!",
    "replies": ""
  },
  {
    "date": "2019-09-19T12:23:29Z",
    "account_name": "Mildred Hall",
    "url": "https://www.trustpilot.com/users/5d82086583ffc26e4eab367c",
    "article": "CoachingBusiness helped me in creating target content for my audience on social media. I'm getting a lot more customers now and my CPA is much lower... very cool",
    "replies": ""
  },
  {
    "date": "2019-09-11T05:32:54Z",
    "account_name": "Harry Crompton",
    "url": "https://www.trustpilot.com/users/5c1c76d270d81fbb9be7be18",
    "article": "These people are the best! I was able to grow my business website in no time with the help of their social media promotion service. I'm getting a lot more leads now... Thank you so much!",
    "replies": ""
  }
]