[
  {
    "date": 1581402153000,
    "account_name": "Harold McAvoy",
    "url": "https://www.facebook.com/harold.mcavoy.58/posts/110750543832775",
    "article": "Very friendly customer support people! I bombarded them with questions when I availed of their package that includes SEO. It was my first time hearing about it, so I called them and clarified some things. I appreciate how they listened and responded to my queries (not everyone has that level of patience to teach a person like me who is not familiar with the latest technology)",
    "replies": ""
  },
  {
    "date": 1582355123000,
    "account_name": "Jennifer Briggs",
    "url": "https://www.facebook.com/jennifer.briggs.904108/posts/106622407601257",
    "article": "Their complete package gave my online business a good start. They made an aesthetic and fully functional site for my online store, set up engaging social media platforms, and even created a sales video to make customer engagement easier. All in all, high-quality and top-notch services! Keep doing great, Coaching Business!",
    "replies": ""
  },
  {
    "date": 1581927839000,
    "account_name": "Douglas Morton",
    "url": "https://www.facebook.com/douglas.morton.526/posts/109325613986609",
    "article": "The sales funnel they created for my business immediately improved our site traffic and provided high-conversion sales performance. Coaching Business is the most excellent digital marketing services provider I’ve ever encountered so far!",
    "replies": ""
  },
  {
    "date": 1580896387000,
    "account_name": "Vonnie Dawson",
    "url": "https://www.facebook.com/vonnie.dawson.58/posts/107931704107392",
    "article": "I love how their customer support team handled my transaction issue. Of course, I was really disappointed at first because I saw how good the client feedbacks are on their website and what I was experiencing initially was the total opposite of “excellent” services. However, I felt that their customer support team was doing their best to help, and they did! I do not regret staying with Coaching Business because they deliver REAL results!",
    "replies": ""
  },
  {
    "date": 1579842679000,
    "account_name": "Sammie Oliver",
    "url": "https://www.facebook.com/geraldine.funk.39/posts/104156074479288",
    "article": "I had problems with the coach assigned to me at first. But I am impressed with how their customer support team resolved the issue professionally and quickly. Despite the disappointment, because of the excellent troubleshooting by their side, I can trust them still. So far, their services have been fantastic.",
    "replies": ""
  },
  {
    "date": 1578986598000,
    "account_name": "Jeffrey Garcia",
    "url": "https://www.facebook.com/permalink.php?story_fbid=110945950439667&id=100045727881957",
    "article": "Unlike other business coaching services, their team spent a significant time to figure out the best marketing strategy for us. Moreover, their mentors have a great spirit of educating struggling entrepreneurs in order to establish rigid online connections. 5 Stars.",
    "replies": ""
  },
  {
    "date": 1578484285000,
    "account_name": "Marilyn Almonte",
    "url": "https://www.facebook.com/marilyn.almonte.948/posts/112164443642089",
    "article": "My online business is reaching heights gradually after purchasing their funnel creation package. These guys don’t just work for profit, they take great care of the consequences as well. Their outstanding concept deserves 5 stars!!",
    "replies": ""
  },
  {
    "date": 1578287241000,
    "account_name": "Christopher Simmons",
    "url": "https://www.facebook.com/permalink.php?story_fbid=110199903837363&id=100045420620331",
    "article": "Very good one on one sessions, Thanks to them we were able to learn about our shortcomings with our social media promotions. It has really helped us to gain a better juice flow in our sales funnel. Would definitely recommend them to my friends!!",
    "replies": ""
  },
  {
    "date": 1580726043000,
    "account_name": "Stanley Davis",
    "url": "https://www.facebook.com/tracy.yockey.7/posts/101464871436857",
    "article": "The team of Coaching Business is just amazing! Recently, we acquired their services for social media promotion and sales funnel creation for our website. Their promotion strategies have worked really well for our business and we are now getting more engagement than before. And above all, I have been watching a steady increase in my website's traffic. 100% satisfied! Thank you.",
    "replies": ""
  },
  {
    "date": 1579172757000,
    "account_name": "Alejandro Livingston",
    "url": "https://www.facebook.com/alejandro.livingston.1/posts/102480787966942",
    "article": "Investing in the Coaching Business's sales funnel creation package was one of the best decisions, I have ever taken. It has helped our marketing team a lot to generate a huge amount of leads and engagement for our business. Thumbs Up.",
    "replies": ""
  },
  {
    "date": 1576754051000,
    "account_name": "Richard Laing",
    "url": "https://www.facebook.com/richard.laing.942/posts/103868551122226",
    "article": "I have to say, investing in the sales funnel creation package here at Coaching Business was one of the best decisions I have ever taken. It has really helped my marketing team to generate more leads and conversions for our business. 100% satisfied customer!",
    "replies": ""
  },
  {
    "date": 1583492645000,
    "account_name": "Latoya Ponte",
    "url": "https://www.facebook.com/latoya.ponte/posts/106031154348481",
    "article": "I got good deal from Coaching Business with their social media promotions and sales funnel creation combined services. It included sessions with a social media manager and a copywriter both of which became sort of my marketing mentors. I believe this package was really worth the self-investment.",
    "replies": ""
  },
  {
    "date": 1574494729000,
    "account_name": "Roberto Thole",
    "url": "https://www.facebook.com/leonard.elmore.146/posts/100428844819434",
    "article": "The sales funnel created by Coaching Business for our company is worth every penny! It has helped us gather more leads and generate more sales than ever before. I am very happy with their work! 5 Stars without any doubt!",
    "replies": ""
  },
  {
    "date": 1580383430000,
    "account_name": "Stefanie Quinn",
    "url": "https://www.facebook.com/stefanie.quinn.946/posts/112055960349217",
    "article": "My husband and I have a 10-year old business that almost went bankrupt because of all the rent and utility bills for the company. So, we decided to make it an online shop, to save it from totally shutting down. A friend recommended to us the Coaching Business’s complete package that includes site creation, sales funnel, a sales video, and social media promotion. To our surprise, it is relatively cheaper than other packages we looked up online. Three months after the full implementation of the online business, we were back on our feet, and we are now earning five times more than before (and now we do not have to worry about rent and utility bills)!",
    "replies": ""
  },
  {
    "date": 1573641317000,
    "account_name": "Alex Evans",
    "url": "https://www.facebook.com/permalink.php?story_fbid=154894152551975&id=100040941720301",
    "article": "Their social media promotion has given excellent results for my website! I am continuously gaining new customers, and I am able to convert them into consumers faster. Very happy with the results. Will continue to hire them further too.",
    "replies": ""
  },
  {
    "date": 1581674953000,
    "account_name": "Kimberly Gaines",
    "url": "https://www.facebook.com/ruby.s.lamoreaux/posts/3009851009239321",
    "article": "For our entire business campaign issues, I look for only one solution, and that’s Coaching Business. Their strategies are indeed valuable, which have till now delivered countless gains for us. I would recommend your services to everyone without any fail. Thanks.",
    "replies": ""
  },
  {
    "date": 1572854540000,
    "account_name": "Nancy A. Ashley",
    "url": "https://www.facebook.com/nancy.a.ashley66/posts/1388558854630694",
    "article": "The SEO enabled content that these people created for my money site has worked perfectly in enhancing my business. There’s a significant rise in my website traffic and sales rate now. Great job!",
    "replies": ""
  },
  {
    "date": 1572437129000,
    "account_name": "Elsie H. Christian",
    "url": "https://www.facebook.com/elsie.h.christian/posts/2914926422066599",
    "article": "A site worth checking out! Coaching Business provides a lot of services that have helped me a great deal with my startup. Right from designing a sales funnel, to promoting my site on social media, they have been 100% efficient in gaining more traffic on my website. We will continue with their service and recommend everyone about it!",
    "replies": ""
  },
  {
    "date": 1582526703000,
    "account_name": "Robert Davis",
    "url": "https://www.facebook.com/DeanJStokes/posts/2465275917036086",
    "article": "One a quick note, I want to thank Coaching Business for their great support to my business. Their knowledge has helped me to get a better understanding of marketing strategies. Because of their efforts only, my business has grown tremendously in a period of a few months only.",
    "replies": ""
  },
  {
    "date": 1569324923000,
    "account_name": "Maria Lopaz",
    "url": "https://www.facebook.com/Maria.Lopaz01/posts/2544979128897875",
    "article": "The website that I built with these people looks great and is convenient for the users. They also built a very efficient sales funnel that has helped me increase my business sales. Good job Coaching Business!",
    "replies": ""
  },
  {
    "date": 1573715151000,
    "account_name": "Hector Jalen",
    "url": "https://www.facebook.com/hector.jalen.1/posts/116907369756639",
    "article": "Thank you, Coaching Business for helping me with your highly effective social media promotion strategy. The sales funnel that you guys created has been working great for my business as well, I am getting more consumers on my website now. 5 stars!!",
    "replies": ""
  },
  {
    "date": 1576501139000,
    "account_name": "Rick M. Osuna",
    "url": "https://www.facebook.com/RickM.Osuna/posts/1512782372220618",
    "article": "Very professional! I acquired their services to help us with our marketing team. Within a few weeks of time, we were getting great the output we desired. Thanks to their funnel, my website is getting more leads. I am sure that my team and I would be able to achieve greater success under their guidance. I am very much satisfied with their excellent service. 5 stars for them!",
    "replies": ""
  },
  {
    "date": 1571140259000,
    "account_name": "Luke Girard",
    "url": "https://www.facebook.com/luke.girard.56/posts/755515988230561",
    "article": "Within 2 months, Coaching Business helped me make great improvements in terms of enhancing my website’s visibility and enhancing my social media presence. I would highly recommend them to everyone out there. Thumbs up!",
    "replies": ""
  },
  {
    "date": 1571050111000,
    "account_name": "Nicholas Deftras",
    "url": "https://www.facebook.com/Nicholas.Deftras/posts/1881660955313107",
    "article": "I used their services for promoting my website on social media sites. They covered all three major platforms for promoting our business which was really helpful. Thanks to their strategic approach. The traffic on my website has grown greatly.",
    "replies": ""
  },
  {
    "date": 1575954815000,
    "account_name": "Jim Haley",
    "url": "https://www.facebook.com/jim.haley.313/posts/104149507748559",
    "article": "We were having trouble keeping up with social media campaigns and due to it our engagement was decreasing. So, we deicided to hire Coaching Business to increase our social media presence. These guys got everything right. They implemented a killer promotion strategy that improved our engagement two-fold in just a month. We are very happy with their services. 5 Stars!",
    "replies": ""
  },
  {
    "date": 1583153551000,
    "account_name": "Hector McLaurin",
    "url": "https://www.facebook.com/hector.mclaurin.3/posts/107670847508158",
    "article": "I thought I didn’t need anybody else to run my business’s social media marketing but a close business friend who I’ll admit is more tech savvy than me recommended it. I’m surprised how effective a professional social media manager is at running a campaign. With this manager for Coaching Business at the helm of our social media accounts, posting didn’t just become more consistent and regular but her choice of content was in keeping with my business’s emphasis on service and quality. Our social media following quadrupled in a short time and so did our website visitors. I only wished I tried this sooner.",
    "replies": ""
  },
  {
    "date": 1569051652000,
    "account_name": "Tomas Rosario",
    "url": "https://www.facebook.com/tomas.rosario.165/posts/2381423965286709",
    "article": "In less than 2 months, Coaching Business has helped me make significant improvements in terms of enhancing my website's visibility and improving my social media presence. I highly recommend them.",
    "replies": ""
  },
  {
    "date": 1568792498000,
    "account_name": "Carlos Carmen",
    "url": "https://www.facebook.com/carlos.carmen.18/posts/3002580739784024",
    "article": "Promoted my business website on social media with the help of these people. The results were beyond my expectations. Now I am gaining more traffic and my ROI has improved effectively. Great job!",
    "replies": ""
  },
  {
    "date": 1568358248000,
    "account_name": "Gustavo Vega",
    "url": "https://www.facebook.com/gustavo.vega.14268/posts/2513682812003529",
    "article": "Coaching Business team’s solution had an almost immediate impact on our business. They were able to build our network across 3 major social media platforms incredibly quickly, which resulted in high-value clients within the first month.",
    "replies": ""
  },
  {
    "date": 1578730641000,
    "account_name": "April Biermann",
    "url": "https://www.facebook.com/april.biermann/posts/105450917658293",
    "article": "After waiting for five months to increase my business sales, I asked the Coaching Business team for help. After implementing their methods and techniques, my entire marketing team became qualified enough to improve sales. Thanks a lot!! We are getting better customer responses now.",
    "replies": ""
  },
  {
    "date": 1578118915000,
    "account_name": "William Rothman",
    "url": "https://www.facebook.com/william.rothman.79/posts/108757760647301",
    "article": "We have been very pleased with the guidance provided by the experts of Coaching Business.",
    "replies": ""
  },
  {
    "date": 1568207977000,
    "account_name": "Johhny Bravo",
    "url": "https://www.facebook.com/johhny.bravo.549/posts/2448796531874466",
    "article": "Coaching Business has helped us save time and close more deals consistently. Thanks to them we have made customized sales funnel for our business which has been a huge help in boosting our business. Thumbs Up!",
    "replies": ""
  }
]