[
  {
    "date": "2020-02-14T15:48:04.356Z",
    "account_name": "Mary Davies",
    "article": "Opting for the services of Coaching Business is one of my best business decisions I have ever made. Among the available products, content creation packages I bought and must say that the deal was worth my investment. Their team was highly proficient in developing ideas that outreach more potential customers. My entire sales and advertising team are impressed with their outstanding work. I will hire more services shortly!!"
  },
  {
    "date": "2020-01-06T15:48:34.438Z",
    "account_name": "Oliver Lyman",
    "article": "A big thanks to the coaching business for putting their utmost efforts in creating a customized sales funnel for our business. Very pleased with their excellent service. It really helped us to gain more sales opportunities!"
  },
  {
    "date": "2019-12-07T15:48:34.455Z",
    "account_name": "Luke Arnold",
    "article": "Thank you, Coaching business, for helping me in establishing a sound impression of my website on social media platforms. Your strategies have been working great, and I am attracting more leads than ever. My sales rate has elevated a lot as well. Thanks again!"
  },
  {
    "date": "2020-01-06T15:48:34.468Z",
    "account_name": "priscila hand",
    "article": "The Social Media Promotion Package we bought from here is great! They have increased engagement on our social media profiles two-folds in just a month. We are looking forward to continuing working with them! 5 Stars!"
  },
  {
    "date": "2019-12-07T15:48:34.481Z",
    "account_name": "Will Newman",
    "article": "These people truly know their business. Hired them recently to help me in enhancing my website visibility, and improving it's ranking on search engines, and the results were just as expected. Coaching Business has truly helped my business to grow faster. Would continue with them further as well!"
  },
  {
    "date": "2019-11-07T15:48:34.495Z",
    "account_name": "James Ferguson",
    "article": "I have been using their search engine content creation package for quite some time now, and I can honestly say that they have provided me with the best articles for my website. The content is always fresh, crisp, and I am gaining a lot of leads. Great job, guys!!"
  },
  {
    "date": "2020-01-06T15:48:34.508Z",
    "account_name": "Shawn Garner",
    "article": "We acquired their services to create a business website for our company. Their team worked hard and developed a site for us in just a month. The results are really very astonishing, and our site looks fantastic. We are really impressed with their work and would love to recommend their service!"
  },
  {
    "date": "2020-01-06T15:48:34.521Z",
    "account_name": "Michael Watterson",
    "article": "Their social media promotion package is excellent. I am gaining more leads than ever! 5 stars!"
  },
  {
    "date": "2020-01-06T15:48:34.534Z",
    "account_name": "William Mackay",
    "article": "I have to say, investing in the Coaching Business's sales funnel creation package was the right decision. It has really helped our marketing team to generate a huge amount of leads and conversions for our business. Thumbs up!"
  },
  {
    "date": "2020-02-07T15:48:34.546Z",
    "account_name": "Nathan Wilkins",
    "article": "Top-notch services! Friendly customer support team! Reasonable prices!"
  },
  {
    "date": "2020-02-28T15:48:34.558Z",
    "account_name": "Searlait Rouze",
    "article": "Our 6 year-old website really needed work. It looked… well it’s ok, especially for its time but as the years go, visitor rates have gradually dropped. It could be other things, like more competition happening, or social media trends, but I really think its because our site is dated. In any case, we got Coaching Business to not just spruced up our websites but our social media presence as well. Whatever they did worked. Our company now has a much higher search results ranking and inbound traffic, and our social media accounts have more followers than ever."
  },
  {
    "date": "2019-12-07T15:48:34.571Z",
    "account_name": "Luz Martinez",
    "article": "You guys have really helped me to increase my business website's traffic and engagement with your content marketing campaigns on social media. Thank you so much for your help. Highly recommended!"
  },
  {
    "date": "2020-02-05T15:48:34.585Z",
    "account_name": "Rose Dyer",
    "article": "Coaching Business helped me promote my business on Twitter, Instagram, and Facebook. Since then, my company gained lots of organic followings. Also, my earnings went up significantly. I also love how their customer support team is always ready to accommodate my concerns."
  },
  {
    "date": "2020-02-21T15:48:34.601Z",
    "account_name": "Donna Read",
    "article": "Great! Five-star quality services! I cannot ask for anything better! Highly recommended!"
  },
  {
    "date": "2019-12-07T15:48:34.616Z",
    "account_name": "Eric Hunter",
    "article": "We are very satisfied with the high conversion sales funnel of Coaching Business. Thanks to it, our website visibility has dramatically improved within a month. I am really impressed with their service and would highly recommend them!"
  },
  {
    "date": "2019-12-07T15:48:34.628Z",
    "account_name": "Erin Patrick",
    "article": "Just came here to drop a note and say thank you for helping me in creating the best content for my social media marketing campaign. Your SEO articles are working great as well, and we are able to gain a lot of new traffic on our business site. Again thanks for your sincere service. 5 stars!"
  },
  {
    "date": "2019-12-07T15:48:34.639Z",
    "account_name": "Roger Caverly",
    "article": "I wanted to extend my sincerest thanks for all your help, guidance, and expertise in promoting my company’s website on social media. I am gaining more leads and traffic now. Great Service!"
  },
  {
    "date": "2019-12-07T15:48:34.653Z",
    "account_name": "Marsha G. Chavez",
    "article": "I have been using their services for a couple of months only, and I have got satisfactory results. The high converting sales funnel are quite effective, and the price they charge for them is very reasonable. My website is already getting twice more engagement than before. I would definitely recommend them to each, and everyone out there."
  },
  {
    "date": "2019-11-07T15:48:34.668Z",
    "account_name": "Darcy Younger",
    "article": "Thank you guys for helping me with my SEO marketing. Never knew optimizing my content would help me to rank up my page so fast. Very happy with the results. Highly recommended!"
  },
  {
    "date": "2019-11-07T15:48:34.686Z",
    "account_name": "Augustin Vallee",
    "article": "These people are the best! They helped me create a highly efficient sales funnel for my business about 2 months back, and the growth that I can see in my business is great. Looking forward to use more of their services and recommending them to everyone!"
  },
  {
    "date": "2019-11-07T15:48:34.705Z",
    "account_name": "Melissa Lyman",
    "article": "The site they made for my online shop is fantastic! After just two months of its launch, it gained a significant amount of site traffic. The online shop is performing well for the past three months. So, I am planning to avail of their search engine content creation service soon to improve my business site’s search engine ranking."
  },
  {
    "date": "2020-01-06T15:48:34.723Z",
    "account_name": "Rose Coleman",
    "article": "Coaching Business has been a great help for me in promoting my business! I have used several of their services, and every time they have gone beyond my expectations."
  },
  {
    "date": "2020-01-06T15:48:34.737Z",
    "account_name": "Rawley Niven",
    "article": "The folks at Coach business who took responsibility for our website promotion are highly knowledgeable. They have been working hard to get my business more potential clients, and genuine customers to deal with. Can’t thank them enough at all!!"
  },
  {
    "date": "2020-02-05T15:48:34.761Z",
    "account_name": "Richard Evans",
    "article": "Perfect provider for social media promotion services! Prices are reasonable, and the results are as excellent as what they promise!"
  },
  {
    "date": "2020-02-14T15:48:34.774Z",
    "account_name": "Steven Acosta",
    "article": "Tried their social media promotion, and my business immediately started growing! Prices are reasonable too."
  },
  {
    "date": "2020-02-05T15:48:34.787Z",
    "account_name": "Villette Dastous",
    "article": "Coaching Business made me realize how important Facebook, Twitter, and Instagram are for businesses nowadays!"
  },
  {
    "date": "2020-02-05T15:48:34.800Z",
    "account_name": "Grant Nolen",
    "article": "Their social media promotion helped my business increase its customer base. I highly recommend the social media package with the SEO-enabled articles!"
  },
  {
    "date": "2019-10-08T15:48:34.813Z",
    "account_name": "Gary Carty",
    "article": "Bought a Social Media Promotion Package from this place some days back for promoting my website. I can see more traffic on my page now. Thank you so much!"
  },
  {
    "date": "2019-10-08T15:48:34.824Z",
    "account_name": "Thomas Ferguson",
    "article": "I create my content according to SEO and promote my business page on social media with the help of these people. They are amazing. I have gained more traffic and customers than before on my page. Thank you so much!"
  }
]