[
  {
    "date": "2020-02-05T15:50:56.343Z",
    "account_name": "Hortense Simon",
    "url": "https://goo.gl/maps/udtbka2ZK7RiaW4T8",
    "article": "I’ve always been a bit of a frustrated writer myself. I like writing poetry but never really had the courage to publish my work or make them public in any degree or fashion. But when you grow old and become comfortable with your own skin, you start making up your mind about things. Like how I did. People will dislike things about you, others will love. But you’ll never know until you put yourself out there. So I did. And I went ALL OUT, why not? I’ve held back for so long, I may never get the same chance. Or be as brave. So I got with a local publisher friend to create my books of poetry. Poetry of Life and Other Musings, Volumes 1 and 2. Then I asked the help of Drive For Success to make me website for my work and get some digital promotions going. And what do you know, orders came in. People say I inspire them. Well they inspire me. I’m thankful to Drive For Success for taking good care of me."
  },
  {
    "date": "2020-02-14T15:50:57.582Z",
    "account_name": "Patricia Walters",
    "url": "https://goo.gl/maps/fhWqxcjcM7Sg9d1cA",
    "article": "I thought I had it all figured out since I already had a business website, social media platforms, and everything that an online business needs until a friend recommended Drive For Success’s Sales Conversion Optimization to me. It helped me target customers more precisely, and it improved my business’s sales performance! I did not know my business could do so much more!"
  },
  {
    "date": "2020-03-03T15:50:58.184Z",
    "account_name": "John Langdon",
    "url": "https://goo.gl/maps/6ySCst93i2EzpujLA",
    "article": "We can really tell the difference between our amateur approach to promoting our business in social media and that of DriveForSuccess. Since they’ve took over management of our business’ social media account, our brand became a lot more recognized and visitor traffic to our site has risen exponentially. It was great working with them."
  },
  {
    "date": "2020-03-04T15:50:58.937Z",
    "account_name": "Royden Bellefeuille",
    "url": "https://goo.gl/maps/cC9jqYeNEky1iKhW8",
    "article": "Good selection of online marketing services. Competitively priced and very feature packed. These are what drew us to acquiring the pro services of Drive For Success."
  },
  {
    "date": "2020-02-05T15:50:59.503Z",
    "account_name": "Henry Billson",
    "url": "https://goo.gl/maps/Ya2v6CmJDj3FhoA29",
    "article": "Their services have always worked great for my business! Last week I purchased the complete site package that not only helped me in creating a website for my business, but it has also generated a good amount of leads as well. Thumbs up!"
  },
  {
    "date": "2020-02-29T15:51:00.099Z",
    "account_name": "Gilles Perrault",
    "url": "https://goo.gl/maps/pRBdyXxMJNg9n9WD7",
    "article": "Our website was already getting a ton of visitors but sales wasn’t exactly going through the roof. We needed somebody to figure out why that’s so and that’s what Drive For Success did. Their sales conversion optimization program was what we needed to straighten out our numbers."
  },
  {
    "date": "2020-02-05T15:51:00.772Z",
    "account_name": "Bella Kyle",
    "url": "https://goo.gl/maps/KLBwMnuer8hbqPpY8",
    "article": "It has been a month now, I have been working with Drive for Success, and the results I have got are just excellent. Thanks to their sales video conversion technique our business is already getting more conversions than before. I will definitely work with them again, and recommend everyone about their services too. Excellent service!"
  },
  {
    "date": "2020-02-05T15:51:01.370Z",
    "account_name": "Donna Sutherland",
    "url": "https://goo.gl/maps/ywCxyH578DC3ojyMA",
    "article": "These people are the best at creating a social media strategy for any type of business! I hired Drive For Success to consult me on social media marketing and I am pleased to say that their strategies have driven a considerable amount of sales on my business. Highly recommended."
  },
  {
    "date": "2020-02-14T15:51:01.873Z",
    "account_name": "Aubert Pellerin",
    "url": "https://goo.gl/maps/sBGjGY5M8GdK8JsYA",
    "article": "Responsive customer support team. They always help me with my concerns and issues. I also appreciate how they handle feedback. Great company, indeed!"
  },
  {
    "date": "2019-12-07T15:51:02.517Z",
    "account_name": "Michael Whitehead",
    "url": "https://goo.gl/maps/tumHrrryQTPFpRLu8",
    "article": "These people are amazing! I have been using their consultation services for several months now, and have found them to be the best for my business! Would definitely recommend Drive For Success to each and everyone out there. Thumbs up!"
  },
  {
    "date": "2019-12-07T15:51:03.034Z",
    "account_name": "James Barlee",
    "url": "https://goo.gl/maps/oaY293fAyoH1cUnA7",
    "article": "The optimization that I learn from you guys is working just great for my social media platforms! I am now able to understand and modify my content on them much better than before, and attracting more traffic. Thank you so much Drive For Success for the excellent results! I am very happy I started working with you people."
  },
  {
    "date": "2019-12-07T15:51:03.502Z",
    "account_name": "Anna McShan",
    "url": "https://goo.gl/maps/KEYGt67yV2uTX9SE6",
    "article": "The sales conversion optimization and social media strategies services that we purchased from Drive For Success is working great for our company. We are gaining more engagement on our platforms, and our websites are now among the most popular. Looking forward to working with them for a long time."
  },
  {
    "date": "2020-01-06T15:51:03.968Z",
    "account_name": "Sharon Holly",
    "url": "https://goo.gl/maps/Yyis51gKAnRRStaN9",
    "article": "Fantastic work on my website! Recently, I hired them for the site-development and branding my business and they have done an excellent job at both of them. I am very impressed with their creative approach and quality of service. Also, I would like to appreciate them for their excellent work with branding and SEO of my website. I am looking forward to working with you guys again!"
  },
  {
    "date": "2020-01-06T15:51:04.455Z",
    "account_name": "Martin Stanley",
    "url": "https://goo.gl/maps/ZRVsfQXXEsRD28nW6",
    "article": "It feels like I would have never gained this much of social media popularity without the support of these people. My entire hard work has no value until the Drive For Success team shows the right direction to invest time and effort. The mentors always guide like a business partner with full consciousness towards working on the weak points. I’ll keep writing my gratitude!!"
  },
  {
    "date": "2020-01-06T15:51:05.034Z",
    "account_name": "Pablo Eberly",
    "url": "https://goo.gl/maps/1APaYZSiNb8wW8vW8",
    "article": "Their Social Media Content Creation package worked great throughout the process of curating engaging content for three of my social media campaigns. I never felt confused or annoyed while getting their instructions. Keep going!!"
  },
  {
    "date": "2019-12-07T15:51:05.803Z",
    "account_name": "Troy Delapaz",
    "url": "https://goo.gl/maps/9SeX52Kx2arYygor9",
    "article": "These people are really good at creating a social media strategy for any kind of business. I had never faced any kind of issue working with them and most importantly their strategies drive a considerable amount of sales to my business. I highly recommend them!"
  },
  {
    "date": "2020-01-06T15:51:06.373Z",
    "account_name": "Sabrina Hemmings",
    "url": "https://goo.gl/maps/T45BNkkcXHxWs3Kh9",
    "article": "Thanks to their efficient sales video conversion strategy, it has been easier for us to generate more leads from our video campaigns. Their team is proficient and hardworking in their field. I would recommend their services to everyone!"
  },
  {
    "date": "2019-12-07T15:51:06.869Z",
    "account_name": "Jim Almond",
    "url": "https://goo.gl/maps/wvoSoQPFLjEM4ALi7",
    "article": "The content provided by these professionals for my social media sites is just great. It has helped me to gain more leads and traffic to my website. 100% satisfied with their work. Thumbs up!"
  },
  {
    "date": "2019-12-07T15:51:07.383Z",
    "account_name": "Anthony Kinney",
    "url": "https://goo.gl/maps/DWJMGmJHGkH5J3838",
    "article": "I have built my business website with the help of these people, and honestly, it turned out a lot better than what I expected! Their video scripts have helped me gain a lot of new leads too. Thank you Drive For Success for helping me with my business growth. I will recommend you to everyone I know!"
  },
  {
    "date": "2019-12-07T15:51:07.918Z",
    "account_name": "Jack Crowe",
    "url": "https://goo.gl/maps/TU51ep3fJSdGKeF47",
    "article": "Their services have always been top-notch. The sales videos provided by them has helped us to bring more engagement to our website. I have nothing but good words for you guys. Thank you, Drive For Success!"
  },
  {
    "date": "2020-01-06T15:51:08.454Z",
    "account_name": "Lucas Fraser",
    "url": "https://goo.gl/maps/ss6mFrzEb3yTiJaf8",
    "article": "Their Complete Site package undoubtedly proved fruitful to my small business. The website they built is working great, and I am receiving more engagement than ever before. Every business should check out this site once!"
  },
  {
    "date": "2020-02-28T15:51:09.221Z",
    "account_name": "James Shaffer",
    "url": "https://goo.gl/maps/L1wqeU3hmaiKzpDt9",
    "article": "I’m an independent game designer and I create simple, fun and highly addictive games. All of them are free to download and I make money with game upgrades, ads and premium ad-free membership. To promote my games, I got sales conversion optimization and social media strategy services from driveforsuccess.org. They do a good job promoting mg game on Facebook and because of their service, I can always rely on a steady stream of people downloading my games."
  },
  {
    "date": "2020-02-07T15:51:09.833Z",
    "account_name": "Tracey Sutherland",
    "url": "https://goo.gl/maps/ss5JvPGffJjUNaQ57",
    "article": "I would humbly suggest that driveforsuccess include a lead magnet or lead generation program as a service package on its own and maybe have an email marketing campaign strategy along with that. Email may have lost its popularity to Social Media but all the company shot-callers and deal-makers are still heavily into email communications, so there’s always good opportunity there. But for what driveforsuccess advertises as its services, well those are fine."
  },
  {
    "date": "2020-02-05T15:51:10.513Z",
    "account_name": "Leah Reed",
    "url": "https://goo.gl/maps/rHNdnfbEPY8emEao6",
    "article": "I learned the essentials of online business promotion from their “social media consultation” package. The instructions provided by them were clear, simple, and easy to implement. Plus, they helped me to save money that I would have spent on advertising companies. Good Job!!"
  },
  {
    "date": "2019-12-07T15:51:11.107Z",
    "account_name": "Jessie Mark",
    "url": "https://goo.gl/maps/qfWV9v4bvTChTgqD8",
    "article": "We recently hired the services of Drive For Success for our social media marketing campaign. With their support, we have been able to develop a compelling social media presence for our business. Looking forward to working with them for longer."
  },
  {
    "date": "2020-01-06T15:51:11.821Z",
    "account_name": "Millie Smith",
    "url": "https://goo.gl/maps/EJYXnqqodRhmsEuz9",
    "article": "I used the services of DFS to grow two of my small e-commerce businesses. With their incredible support and systematic working approach, both the project are now earning more potential customers. These guys are definitely the best!!"
  },
  {
    "date": "2019-12-07T15:51:12.485Z",
    "account_name": "Ashlyn Delilah",
    "url": "https://goo.gl/maps/5C8bJyYaAXHch5MXA",
    "article": "Recently hired these people to help me in creating content for my social media platforms. Thanks to them, I am able to save more time and pay attention to my business better. 5 stars!"
  },
  {
    "date": "2019-11-07T15:51:13.252Z",
    "account_name": "Robert Martin",
    "url": "https://goo.gl/maps/9qgEaEiffnx91Cf78",
    "article": "I have used their service multiple times for digital marketing purposes, and they are truly the best at it. These people have an exceptional team, who handles all their client's cases very professionally. I am continuing with their service even further, and I highly recommend them to you guys without any hesitation!"
  },
  {
    "date": "2020-02-28T15:51:13.833Z",
    "account_name": "Pryor Bonami",
    "url": "https://goo.gl/maps/KSc58Agx8Ux3U1Ko7",
    "article": "Our promotional video was made by Driveforsucess. From conceptualization, script writing and actual production and video edits, Driveforsuccess was the creative partner we needed to make our video a reality."
  },
  {
    "date": "2019-11-07T15:51:14.433Z",
    "account_name": "Oliver Davies",
    "url": "https://goo.gl/maps/CVSq4K9oJQUo2jxa6",
    "article": "Great Services!! The customer support service provided by Drive for Success is second to none. I called in mid-night about some issues regarding my content package and they answered all my questions calmly. I would recommend them to everyone!!"
  },
  {
    "date": "2019-12-07T15:51:15.085Z",
    "account_name": "Joseph Berger",
    "url": "https://goo.gl/maps/6pCkFkerYj3H75Gc7",
    "article": "We have been working with this company for a month now and the results have been great. Thanks to their sale video conversion technique our business is already getting more conversions than before. I am really impressed with their services and would highly recommend them."
  },
  {
    "date": "2020-02-21T15:51:15.651Z",
    "account_name": "Austin Nolan",
    "url": "https://goo.gl/maps/jxqMus2JMcXK67Bg6",
    "article": "My brothers and I are in the garden landscaping business. It’s a family business that my father started. Back in his day, he would run a couple of newspaper ad, maybe once a month, and that would take care of all our advertising and promotions. Nowadays it’s all about selling on the internet. My brothers and I wanted to promote the family business in a big way so we decided that we need a video ad we can circulate. We got Driveforsuccess.org’ sales video writing and production services. They wrote the script, shot the ad, and did the edits. The final product really looked professionally made. We posted the vid on our website and social media accounts. It wasn’t long when we started getting more email and phone inquiries about our services. Business did so well that we were able to recoup our video expense in just under a month."
  },
  {
    "date": "2020-02-28T15:51:16.147Z",
    "account_name": "Norris David",
    "url": "https://goo.gl/maps/an4VJ2fHDp7RYGYF6",
    "article": "Their Sales Optimization and Social Media Strategy package is what helped our landscape gardening business really take off. I recommend Drive For Success for any company looking for a competent and affordable online marketing agency."
  },
  {
    "date": "2019-11-07T15:51:16.736Z",
    "account_name": "Salvador Smith",
    "url": "https://goo.gl/maps/FPYep5xveruM4F6D6",
    "article": "Before using their service, I didn’t have much idea about social media marketing or the impact it would have on my business, but these people are just amazing! The professionals are extremely knowledgeable, helped me with understanding my social media strategies, and now I am able to create way better content than earlier. Thank you so very much guys!"
  },
  {
    "date": "2020-02-21T15:51:17.284Z",
    "account_name": "Susanne Bolduc",
    "url": "https://goo.gl/maps/UcsXW3UnBqZc8QJTA",
    "article": "I’m the owner, chief baker and sole operator of an artisan bakery and I promote my bread products and baked goods through Instagram and Facebook. This strategy went well in the beginning. I was able to build a strong following and people started patronizing my products because they saw pictures of them on social media. Sales grew to the point that I had to hire help to meet the demand. That also left little time for me to properly manage other things like the promotions. That’s how I got DriveForSuccess to handle the promotions. Since I now have professional management for our social media accounts, promotions has been 3 times more productive than if I were to do it myself. Now I can concentrate to scaling my bakery."
  },
  {
    "date": "2019-11-07T15:51:17.816Z",
    "account_name": "Thomas Hobart",
    "url": "https://goo.gl/maps/sqc2ye7wyw9wTP2K9",
    "article": "Excellent work, DriveForSuccess! Your social media strategy and content creation have helped me enhance my business reach, without investing much of my time into it. I got the best results in the least time. I am amazed!!!"
  },
  {
    "date": "2019-11-07T15:51:18.334Z",
    "account_name": "Victoria Lewis",
    "url": "https://goo.gl/maps/WAiiw4as8RzUEAfFA",
    "article": "Drive For Success is amazing in their knowledge and ability to teach social media marketing in simple terms. Thanks to the insightful tips provided by them, my business engagement has increased exponentially."
  },
  {
    "date": "2020-01-06T15:51:19.797Z",
    "account_name": "William Paige",
    "url": "https://goo.gl/maps/9iMJvuVHhKxMQcwn9",
    "article": "Your Sales Conversion Optimization subscription has been really a big help for my startup. I would remain your customer to enjoy your incredible support. Thanks a lot"
  }
]