[
  {
    "date": 1582093931000,
    "account_name": "Victoria Tassone",
    "url": "https://www.facebook.com/victoria.tassone.1/posts/100966341505587",
    "article": "It's been a couple of months since I started using the social media content creation services of Drive for Success, and the results I have got are just excellent. They have helped me throughout the process of curating engaging content for almost three of my social media campaigns. I will definitely work with them again and recommend their services to everyone I know.",
    "replies": ""
  },
  {
    "date": 1581313149000,
    "account_name": "Jame Neeley",
    "url": "https://www.facebook.com/jame.neeley/posts/112129477023712",
    "article": "Their Social Media Consultation package made me realize how important it is to maintain a strong online presence for my business. It helped me maintain an excellent customer support team, too, that made clients trust our products and services. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1581752477000,
    "account_name": "Javon Carter",
    "url": "https://www.facebook.com/javon.carter.564/posts/114557000119264",
    "article": "I have an online store, and I decided to avail of their sales conversion optimization and social media strategy package. The results were more than pleasing! Months after availing of their service, my online store recorded improved site traffic and sales performance! Now, I am planning to try their complete package to help me revamp my website and other online platforms.",
    "replies": ""
  },
  {
    "date": 1579678352000,
    "account_name": "William Smith",
    "url": "https://www.facebook.com/permalink.php?story_fbid=107979607416625&id=100046137583556",
    "article": "It's been a couple of months since I hired these people to optimize my video marketing strategy and I must say that these people are amazing. Their video sales script has brought more leads to my website than we ever could. I am looking forward to working with again. Great services.",
    "replies": ""
  },
  {
    "date": 1579001393000,
    "account_name": "Brandon Hoose",
    "url": "https://www.facebook.com/brandon.hoose.33/posts/114606043401650",
    "article": "Their social media strategies were beyond any comparison! The campaigns developed by them are getting enough engagement and leads to help us gain genuine engagement. That’s all we needed! Incredible work!!",
    "replies": ""
  },
  {
    "date": 1582551287000,
    "account_name": "Robert Johnson",
    "url": "https://www.facebook.com/permalink.php?story_fbid=102239788048578&id=100047876705889",
    "article": "Our company does solar panel and windmill installations as alternative power sources for domestic use. When we needed a big online campaign, we employed the services of DriveForSuccess.org. We really liked the combination of marketing services of their more premium packages. The particular package we got included updating our website, content management, and implementing a social media marketing strategy. DriveForSuccess understood our target market, mostly for households that are offgrid or those who are into taking care of the environment. I say their green campaign worked and we are now fully booked with installation works for the next two quarters.",
    "replies": ""
  },
  {
    "date": 1579842101000,
    "account_name": "Mark Dion",
    "url": "https://www.facebook.com/mark.dion.9081323/posts/112287116983863",
    "article": "Thank you so much, Drive For Success, for providing us with such an excellent sales conversion strategy for our business. It has already helped our websites a lot by getting us huge traffic and engagement. I would highly recommend this website to each and everyone out there. Thank you.",
    "replies": ""
  },
  {
    "date": 1579158120000,
    "account_name": "Enrique Foster",
    "url": "https://www.facebook.com/enrique.foster.9277/posts/108864580652904",
    "article": "Before reaching Drive For Success, I felt it was daunting to develop a productive social media campaign. But, these guys are undoubtedly serious players in social media advertising approaches. My brand’s engagement has improved a lot with their help. I highly admire their services.",
    "replies": ""
  },
  {
    "date": 1582704943000,
    "account_name": "Steven Vesely",
    "url": "https://www.facebook.com/steven.vesely.58/posts/111760427087968",
    "article": "We are now able to close more sales and turn a significant amount of leads into customers with your complete ‘sales video writing and production’ package. It delivers the right messages in a way that resonates with our audiences. Glad to invest in it!!",
    "replies": ""
  },
  {
    "date": 1580793453000,
    "account_name": "Virginia Nitta",
    "url": "https://www.facebook.com/virginia.nitta/posts/113246570236734",
    "article": "Drive For Success is great if you need your original Social Media efforts fixed, upgraded or consolidated. I can’t say if a campaign created by Drive For Success from scratch is any good or bad but they seem to be really adept at optimizing what you currently have.",
    "replies": ""
  },
  {
    "date": 1576817890000,
    "account_name": "Frederic Wallace",
    "url": "https://www.facebook.com/frederic.wallace.33/posts/107465384091841",
    "article": "Thanks to their effective sales video conversion strategy, it has been easier for us to generate more leads from our video campaigns. Their complete team is proficient, hard-working, and friendly. I would recommend their services to everyone!",
    "replies": ""
  },
  {
    "date": 1575460655000,
    "account_name": "Miriam Sherwood",
    "url": "https://www.facebook.com/miriam.sherwood.90/posts/102945037862525",
    "article": "Excellent work, Drive For Success! Your social media strategy and content creation have really helped me a lot to enhance my business reach without investing a lot of time into it. I have got 100% results in a very short period of time. Thumbs up!",
    "replies": ""
  },
  {
    "date": 1576651706000,
    "account_name": "Angela Carroll",
    "url": "https://www.facebook.com/angela.carroll.3766952/posts/111400787024842",
    "article": "Drive For Success have gathered proficiency as their team members. Their Products including ‘Social Media strategy’ subscription is really a stroke of luck for startup companies like mine. I would remain their customers to enjoy their incredible support. Thanks a lot!!",
    "replies": ""
  },
  {
    "date": 1580706975000,
    "account_name": "Nicholas Flores",
    "url": "https://www.facebook.com/nicholas.flores.946179/posts/116457739910570",
    "article": "Hired these people to create content for my Social media campaigns, within the first month only, my sales team submitted positive feedback saying that they are receiving a commendable number of website visits and leads via social media platforms. Won’t hesitate to put this company high in the top marketing companies.",
    "replies": ""
  },
  {
    "date": 1582964093000,
    "account_name": "Georgina Moss",
    "url": "https://www.facebook.com/georgina.moss.5437/posts/101825694765359",
    "article": "We thought promoting our business in social media was straightforward. Post a few pics, share a few funny memes, and you’re good to go. How wrong we were. We weren’t getting any significant increase in followers, our content wasn’t exactly going viral. So we decided to get some professional advise from DriveForSuccess. Basically, they gave us Social Media Marketing 101 and there was so much we weren’t doing right. After doing a a lot of recommended tweaks and fixes, we finally were getting traction on social media. All thanks to DriveForSucess.",
    "replies": ""
  },
  {
    "date": 1571897342000,
    "account_name": "Jermaine Burns",
    "url": "https://www.facebook.com/Jermaineburns01/posts/925360761168306",
    "article": "I must say this, hiring the service of Drive For Success was the best decision for my business. They helped me to strategically use social media for getting better traffic on my money site. Thanks to them, my website is getting better customer engagement.",
    "replies": ""
  },
  {
    "date": 1571140636000,
    "account_name": "Amelia Paterson",
    "url": "https://www.facebook.com/amelia.paterson.9021/posts/699177023927515",
    "article": "Hired their sales video conversion optimization service, and I am 100% satisfied with the excellent service they provided us with. These people set the right video conversions which helped me drive more sales and followers to my website and social media accounts! Thank you so much.",
    "replies": ""
  },
  {
    "date": 1571050523000,
    "account_name": "Matthew Daskalakis",
    "url": "https://www.facebook.com/Matthew.Daskalakis01/posts/1846495295497256",
    "article": "Drive For Success has proven greatly beneficial for our company. Their team has created an amazing social media content package which has generated us a good amount of leads.",
    "replies": ""
  },
  {
    "date": 1571645226000,
    "account_name": "Isabel Grosse",
    "url": "https://www.facebook.com/isabel.grosse.52/posts/2407285616226446",
    "article": "Drive For Success has been very helpful in consulting me about social media. Their knowledge and years of experience make them the best in this field. Thanks to their guidance, my business has grown substantially.",
    "replies": ""
  },
  {
    "date": 1572510649000,
    "account_name": "Gilberto R. Quinn",
    "url": "https://www.facebook.com/gilberto.r.quinn/posts/2386186504956688",
    "article": "These people are the best.  I bought the social media content creation package, and the results are just amazing! Thanks to them, I longer have to focus much on creating content for my social media marketing campaigns, and I can pay more attention to my business.",
    "replies": ""
  },
  {
    "date": 1571305656000,
    "account_name": "Stephanie Wilson",
    "url": "https://www.facebook.com/Stephanie111212/posts/2345160059081474",
    "article": "Drive For Success has been great for me! The complete site package that I bought from them has been very beneficial. I am able to get more followers on my website due to which sales have been increased. Thank You!",
    "replies": ""
  },
  {
    "date": 1574937501000,
    "account_name": "Patrick Gustin",
    "url": "https://www.facebook.com/patrick.gustin.777/posts/109933423814919",
    "article": "Recently started working with these people for optimizing my sales funnel, and I got the best results! I am now able to reach out to more audience, and increase my sales rate enormously. Thumbs up!",
    "replies": ""
  },
  {
    "date": 1568792700000,
    "account_name": "Carol Mitschke",
    "url": "https://www.facebook.com/carol.mitschk/posts/10220115447825114",
    "article": "Their social media strategy is the best. I have successfully marketed my website to my targeted customers and now I am able to get more potential leads. 5 stars.",
    "replies": ""
  },
  {
    "date": 1580274360000,
    "account_name": "Herlinda Sanders",
    "url": "https://www.facebook.com/herlinda.sanders.3/posts/101494881416155",
    "article": "I’m giving four out of five stars because no matter how good a job is, there should always be room for improvement. It’s just the kind of expectation I give myself as well as others. So there, Driveforsuccess gets a four.",
    "replies": ""
  },
  {
    "date": 1582873827000,
    "account_name": "Niamh Price",
    "url": "https://www.facebook.com/niamh.price.56481/posts/101562754789782",
    "article": "Drive For Success team has set effective and result-oriented strategies for our online business that are helping us to make our websites work smartly and bring an increase in the sales revenue with its implementation. I can’t thank these folks enough!!",
    "replies": ""
  },
  {
    "date": 1568187288000,
    "account_name": "Megan Stevens",
    "url": "https://www.facebook.com/megan.stevens.1044/posts/2413407708755929",
    "article": "Drive For Success brought fresh-thinking to the table and helped us shape our Social Media Strategy. They came well prepared and were able to present their ideas compellingly. Would definitely buy again!",
    "replies": ""
  },
  {
    "date": 1583394432000,
    "account_name": "Kerry Dickinson",
    "url": "https://www.facebook.com/kerry.dickinson.549/posts/109438237334464",
    "article": "We provide singing and entertainment services for special events. Weddings, office events even funerals, believe it or not. Back in the day, word of mouth was enough to get us paying gigs. But nowadays, we have to compete with rock bands, DJs, and even a local barbershop quartet is getting some of the business. Although we believe that there’s enough business for everyone, we still need to take a more active role in promoting ourselves. And with so much competition, we’re not taking any chances. We got the professional marketing services of Drive For Success. They built us a website, made a short video of our singing services, and promoted our business in social media. I think this is the reason why we’re the first choice of special events in our area.",
    "replies": ""
  },
  {
    "date": 1580984952000,
    "account_name": "Kristi Williams",
    "url": "https://www.facebook.com/kristi.williams.75248795/posts/102951247949521",
    "article": "Drive For Success helped me rebuild my business, but this time, online. I never knew I could do so much with the internet around. I used to think that this digital age kills many businesses, but it turns out, it makes marketing and advertising easier and more convenient than before! I appreciate their hardworking staff, responsive customer support team, and relatively reasonable prices!",
    "replies": ""
  },
  {
    "date": 1568357852000,
    "account_name": "Adrian Taylor",
    "url": "https://www.facebook.com/adrian.taylor.11/posts/2903334353070531",
    "article": "Drive for Success helped us set up the right video conversion tactics that drove more sales and followers into our websites and social media accounts. I would recommend them wholeheartedly!",
    "replies": ""
  },
  {
    "date": 1572855675000,
    "account_name": "Jacqueline C. Lopez",
    "url": "https://www.facebook.com/Jacqueline.C.Lopez856/posts/1431255647027275",
    "article": "Thank you guys for optimizing the sales video for my business, and providing me with the best social media strategies. My site reach hasn’t been so high before. Hats off!",
    "replies": ""
  },
  {
    "date": 1578722313000,
    "account_name": "Ruthie Serrano",
    "url": "https://www.facebook.com/ruthie.serrano.73/posts/113976006795673",
    "article": "I subscribed to their sales conversion optimization package after noticing a continuous decline in the conversion rate. Followed their instruction, strategy, and approach with keen dedication, and it resulted in boosting the sales after a few weeks. Will continue to work with them further!!",
    "replies": ""
  },
  {
    "date": 1582358035000,
    "account_name": "Travis Stover",
    "url": "https://www.facebook.com/travis.stover.731/posts/109085160685637",
    "article": "When I retired from USPS, I had trouble keeping myself occupied. My retirement pay is enough to live by but I couldn’t blow everything on an expensive cruise like what most people would imagine how retirement could be. To keep myself busy, I though of writing about my decades of experience as a mailman and posting it on my website. “Blogging” as the kids would call it. I didn’t know one bit about making a website so I got the services of Drive For Success to do it for me. They set me up a nice website and even promoted it on social media. I couldn’t believe the response I got from people. I guess old timers like me are nostalgic about the days when writing someone a letter really meant something. Drive For Success explained that since I’m getting a lot of visitors on my site, companies are now paying for ad space on my website. Imagine that? I get to do something I like to do and earn a few bucks while I’m at it. All thanks to the expert services of Drive For Success.",
    "replies": ""
  },
  {
    "date": 1583128504000,
    "account_name": "Jesse Henderson",
    "url": "https://www.facebook.com/jesse.henderson.71653/posts/105232821088104",
    "article": "We run a small retail and fulfilment company, composing of just a handful of people. We don’t have a marketing department and any marketing done in the past was by me and some of my partners. We realize that if we’re neglected social media for our marketing. But with all the stuff we needed to do (like running operations), nobody could really do social media marketing full time. that’s why we got the services of Drive For Success. We pretty much entrusted everything to them: strategy, content creation, analytics, and social media management. It was a good call because Drive For Success was able to deliver the numbers we expected.",
    "replies": ""
  },
  {
    "date": 1569325336000,
    "account_name": "Jose Sanches",
    "url": "https://www.facebook.com/jose.sanches.50364/posts/2524193947664442",
    "article": "Drive For Success has helped me with creating content for my social media pages and I am so happy with the results. I can already see more engagement and increase in our website traffic. Impressive!!",
    "replies": ""
  },
  {
    "date": 1568966285000,
    "account_name": "Darius Garcia",
    "url": "https://www.facebook.com/darius.tofil.92/posts/3317153088296567",
    "article": "Thank you for all your hard work! The sales conversion strategy that you guys created for us has been a huge success and our business is already getting the traffic we longed for.",
    "replies": ""
  },
  {
    "date": 1582006462000,
    "account_name": "Miguel Hammond",
    "url": "https://www.facebook.com/miguel.hammond/posts/100536268214350",
    "article": "The Complete Site Package(including site, branding, video production, sales optimization, and social campaigns) of Drive For Success brought a huge increase in my business growth. Thanks to them, we are now getting quality leads, and the conversion rate has also improved significantly. 5 stars.",
    "replies": ""
  },
  {
    "date": 1579496659000,
    "account_name": "Rodney Nutting",
    "url": "https://www.facebook.com/rodney.nutting.1/posts/110460377163419",
    "article": "My wife and I have our own Protein Shake franchising business. A good part of our initial success can be attributed to us being a bit savvy with social media promotions. But now we got four franchises going in four different cities and we’ve gotten our hands a little full. We wanted to take the backseat with our promotions and really have a pro at the helm. Upon speaking with driveforsuccess.org, we realize that they’re the right people for the job. Along with managing our business’ social media accounts, they also create enticing and engaging content that fit our brand. All is going well and we’re considering a more comprehensive marketing program from driveforsuccess.org.",
    "replies": ""
  },
  {
    "date": 1580103207000,
    "account_name": "Alvin O. Moses",
    "url": "https://www.facebook.com/alvin.o.moses.7/posts/117631919780889",
    "article": "They rehauled my website and increased my following a thousand more times. I’m now getting more calls for my consultancy business. Awesome",
    "replies": ""
  }
]