[
  {
    "date": "2020-03-02T12:43:30Z",
    "account_name": "Thomas Lejeune",
    "url": "https://www.trustpilot.com/users/5e5cb7e1878fee1d17cb9bc1",
    "article": "We liked the SaferSeat Baby Child Seat so much we bought two pairs for both my wife’s car and mine. We bought them in colors that matched our cars. Of course, we wouldn’t buy them if they weren’t safe.",
    "replies": ""
  },
  {
    "date": "2020-02-25T13:25:01Z",
    "account_name": "Kenneth Chancey",
    "url": "https://www.trustpilot.com/users/5e551ff8878feeb7c7c7efb9",
    "article": "Easy Life Helper is the best online store for my babies’ needs. Reliable products and responsive customer support team. I appreciate that they have reasonable prices too compared to other online stores I’ve tried.",
    "replies": ""
  },
  {
    "date": "2020-02-22T09:26:18Z",
    "account_name": "Vonnie Dawson",
    "url": "https://www.trustpilot.com/users/5e3a95cd7762da94a321e75f",
    "article": "Their Robo-Pal Baby Walker is just adorable! It is perfect for babies learning how to walk. It is durable and easy to use. Worth its price!",
    "replies": ""
  },
  {
    "date": "2020-02-19T08:19:38Z",
    "account_name": "Saanvi Kirkland",
    "url": "https://www.trustpilot.com/users/5e4ce94268c4b9e6edcca15d",
    "article": "Excellent products! Perfect for new parents like me, who are still trying out things that can help them transition to parenting life. I recommend their infant carrier and car seat. I also appreciate their customer support team! Lovely people!",
    "replies": ""
  },
  {
    "date": "2020-02-17T12:54:49Z",
    "account_name": "Lucy Stoney",
    "url": "https://www.trustpilot.com/users/5e4a6aeb878fee192dc23225",
    "article": "I recently bought the multi-purpose infant carrier from this company. All I can say is that it is easy to use and comfortable. I also loved its versatility; I can carry my baby in various ways. Such a great product for moms and babies!",
    "replies": ""
  },
  {
    "date": "2020-02-14T09:46:12Z",
    "account_name": "Anne MacDonald",
    "url": "https://www.trustpilot.com/users/5e46558512b06cbe00f26bcb",
    "article": "I bought Easy Life Helper’s Snuggle Bear Sleep Sack for my cousin’s newborn and she absolutely loves it! She loves how soft and stylish it is and it keeps her newborn comfortably warm. I highly recommend this company and this product.",
    "replies": ""
  },
  {
    "date": "2020-02-04T07:22:05Z",
    "account_name": "James Long",
    "url": "https://www.trustpilot.com/users/5e2acc9de5a4c739bd873547",
    "article": "We ordered the Multi-Functional Nursing Diaper Bag primarily because of the fabric design. Ours sported an adorable polar bear pattern. Who said diaper bags can’t be fun? And it’s large enough to carry a pack of nappies, two bottles of milk, a container for formula, and maybe a spare set of baby clothes. I also like the baby wipes dispenser at the front for quick access and the carrying strap mechanism for easy fixing to our stroller.",
    "replies": ""
  },
  {
    "date": "2020-02-01T07:20:50Z",
    "account_name": "Eduardo Gilkey",
    "url": "https://www.trustpilot.com/users/5e2ac9a9ddcefaf2455dda07",
    "article": "We got SaferSeat Car seat as a gift from my in-laws. As far as I can tell, it works just as fine as the big name brands. It looks and feels sturdy and I can buckle-down my kid securely. The seating material seems to be made of a breathable material, so that’s a plus. We even got the one in racing red which matched our car’s interior perfectly.",
    "replies": ""
  },
  {
    "date": "2020-01-30T09:46:59Z",
    "account_name": "Sally Russell",
    "url": "https://www.trustpilot.com/users/5e3a95cd7762da94a321e75f",
    "article": "Their Robo-Pal Baby Walker is just adorable! It is perfect for babies learning how to walk. It is durable and easy to use. Worth its price!",
    "replies": ""
  },
  {
    "date": "2020-02-19T08:19:38Z",
    "account_name": "Saanvi Kirkland",
    "url": "https://www.trustpilot.com/users/5e4a6aeb878fee192dc23225",
    "article": "I recently bought the multi-purpose infant carrier from this company. All I can say is that it is easy to use and comfortable. I also loved its versatility; I can carry my baby in various ways. Such a great product for moms and babies!",
    "replies": ""
  },
  {
    "date": "2020-02-14T09:46:12Z",
    "account_name": "Anne MacDonald",
    "url": "https://www.trustpilot.com/users/5e2acc9de5a4c739bd873547",
    "article": "We ordered the Multi-Functional Nursing Diaper Bag primarily because of the fabric design. Ours sported an adorable polar bear pattern. Who said diaper bags can’t be fun? And it’s large enough to carry a pack of nappies, two bottles of milk, a container for formula, and maybe a spare set of baby clothes. I also like the baby wipes dispenser at the front for quick access and the carrying strap mechanism for easy fixing to our stroller.",
    "replies": ""
  },
  {
    "date": "2020-02-01T07:20:50Z",
    "account_name": "Eduardo Gilkey",
    "url": "https://www.trustpilot.com/users/5e298e78d1e2f954739b536b",
    "article": "Last week, I ordered a Snuggle bear sleepsack from here, and I am completely satisfied with it. While I take my baby for a walk with me, this excellent sleepsack keeps my baby safe and warm in the stroller. It is made of protective, tear-resistant polyester fiber with just the right amount of soft cotton inner layer that is super cozy and comfortable for my baby. Thumbs up.",
    "replies": ""
  },
  {
    "date": "2020-01-29T11:37:56Z",
    "account_name": "Tabitha Walker",
    "url": "https://www.trustpilot.com/users/5e284be3e5a4c7a26785be75",
    "article": "I have tried almost all your products as of now. Indeed, it has made my life as a mom more comfortable and happier.",
    "replies": ""
  },
  {
    "date": "2020-01-23T09:49:33Z",
    "account_name": "Lorena Piper",
    "url": "https://www.trustpilot.com/users/5e219b04013d4130f9242b64",
    "article": "I am a first-time dad, and my wife asked me to do our baby daughter's bath time. I was anxious about possible accidents or mistakes that might occur while doing it. So, I looked upon the internet and found your Baby Non-Slip Bath Pad. I have been using it for months now, and it helped me become more confident and comfortable in bathing our baby. So far, so good.",
    "replies": ""
  },
  {
    "date": "2020-01-18T08:40:18Z",
    "account_name": "Scot Nelson",
    "url": "https://www.trustpilot.com/users/5e13109931bb5ae161962c9c",
    "article": "I loved the compatible size and beautiful design of your diaper bag. I had a similar one, but yours is far better than that when it comes to comfortable carrying, sufficient space, strong handles, etc. Frankly, all these features exceeded my expectations It’s just amazing.",
    "replies": ""
  },
  {
    "date": "2020-01-13T13:41:49Z",
    "account_name": "Herman Osgood",
    "url": "https://www.trustpilot.com/users/5e10570d98483674147d7791",
    "article": "I prefer Easy Life Helper when it comes to purchasing trustable baby accessories. Their collection of products is comprehensive and reliable. After buying multiple products from their site, I can confidently recommend their online store to all the parents out there. 5 Stars.",
    "replies": ""
  },
  {
    "date": "2020-01-08T12:46:57Z",
    "account_name": "Margaret Roberts",
    "url": "https://www.trustpilot.com/users/5e05aeb19848367c0c78d008",
    "article": "The whole experience was comfortable and enjoyable. Loved the services, that’s not at all pushy to buy their products. Instead, recommended their mostly-purchased accessories. The lady I had words with, was polite, friendly, and responsive. Moreover, would like to thank you for the amazing baby-care bag. Keep going.",
    "replies": ""
  },
  {
    "date": "2020-01-06T10:22:05Z",
    "account_name": "George Sheely",
    "url": "https://www.trustpilot.com/users/5e04b09db14ccf12ebf5c500",
    "article": "This website is really amazing. I have purchased a variety of products for my baby from here and every time they provide me with satisfactory products. They have made my life much easier. I am highly impressed with them.",
    "replies": ""
  },
  {
    "date": "2020-01-04T06:46:44Z",
    "account_name": "Valerie Graves",
    "url": "https://www.trustpilot.com/users/5e008f5c984836ec4b76a749",
    "article": "Easy Life Helper is best. The site locates all my needs for baby care accessories within the expected prices. The adjustable baby walker that arrived last Saturday is great, reliable, easy to carry, and made exactly according to what a toddler loves. Would rate 5 stars to their amazing products.",
    "replies": ""
  },
  {
    "date": "2019-12-27T11:40:04Z",
    "account_name": "Jess Hutchinson",
    "url": "https://www.trustpilot.com/users/5dfcbf5431bb5a04be8d0181",
    "article": "I recently bought a SaferSeat Baby Safety Car Seat from this site, and I am very happy with my purchase. It has a spacious backrest, and base which makes my baby sit comfortably. The wider straps help keep my child secure and I just feel relaxed. 100% satisfied with the product. Recommended.",
    "replies": ""
  },
  {
    "date": "2019-12-23T12:46:20Z",
    "account_name": "Elmer Ferrin",
    "url": "https://www.trustpilot.com/users/5df9bd8b7293b10706f6bd8a",
    "article": "Easy Life Helper deserves 5 stars for its outstanding collection of baby accessories. I bought their baby care bag to gift my niece when she turned seven months old. I must say the quality is amazing, which is hard to get at such an affordable cost. I loved it.",
    "replies": ""
  },
  {
    "date": "2019-12-19T12:43:15Z",
    "account_name": "Carolyn Sterner",
    "url": "https://www.trustpilot.com/users/5df883a3c490ef0b4b9c679f",
    "article": "I’m obsessed with the products available at Easy Life Helper. I have twins and these little guys completely wiggle, so I bought your sleeping sack. Glad. I instantly noticed a huge difference in his sleeping habits, and now counting hours to receive the same sack for the little girl too. That's a must-have for all the caring mothers out there.",
    "replies": ""
  },
  {
    "date": "2019-12-12T12:05:39Z",
    "account_name": "Arlene Armstrong",
    "url": "https://www.trustpilot.com/users/5de789ed741d5f2efe335cb5",
    "article": "I would like to thank you guys, for delivering the best backpack for all moms. I got my Mommy’s Lil’ Helper Baby-Care Bag yesterday. Seems quite nice, and spacious enough to keep all my baby needs. I really like the cute bear pendant, nice little touch. Best product, for all moms out there.",
    "replies": ""
  },
  {
    "date": "2019-12-10T11:11:23Z",
    "account_name": "Candace Tucker",
    "url": "https://www.trustpilot.com/users/5de0ec99ebb7462274ff990d",
    "article": "Such a top-quality product. The SnuggleBear Sleepsack that I purchased from Easy Life Helper is just amazing. It is made up of a protective, tear-resistant polyester fibre which helps in little mishaps. It has just the right amount of insulation within, and a soft cotton inner layer that is cosy and comfortable to my baby’s skin. 100% satisfied with my purchase! Thank you.",
    "replies": ""
  },
  {
    "date": "2019-12-06T12:32:27Z",
    "account_name": "Naomi Brandon",
    "url": "https://www.trustpilot.com/users/5de0d419c4c83ce627580747",
    "article": "Honestly, I loved the products at Easy Life Helper! Most recently, I bought an Adjustable Baby Walker, and it is amazing. The product is very reliable, beautiful, and fairly priced. Plus, their flexible transactions approach give me another reason to continue shopping with them. The result- a satisfied customer.",
    "replies": ""
  },
  {
    "date": "2019-11-29T11:31:18Z",
    "account_name": "Harvey D. Blessing",
    "url": "https://www.trustpilot.com/users/5ddbd187457a61ae9dab2bc2",
    "article": "Last week, I ordered a Robo-Pal Baby walker from this site. The product is undoubtedly beautiful, made with quality plastic with perfect colour contrast. My baby loves this very much. Great Product.",
    "replies": ""
  },
  {
    "date": "2019-11-26T07:12:27Z",
    "account_name": "Shaun Tyler",
    "url": "https://www.trustpilot.com/users/5dd65cdeeaf163a95f038329",
    "article": "Recently bought a SaferSeat Baby Safety Car Seat from this site, and I am very happy with my purchase. It has a spacious backrest, and base which makes my baby sit comfortably. The wider straps help keep my child secure. 100% satisfied with the product. Recommended.",
    "replies": ""
  },
  {
    "date": "2019-11-23T08:46:10Z",
    "account_name": "Leticia R. Figueroa",
    "url": "https://www.trustpilot.com/users/5dd37ab5ccc6ab7b81ae1daf",
    "article": "EasyLifeHelper is a complete shop to buy accessories for your babies. Last week, I ordered a nursing diaper bag, which got delivered exactly on time. The space provided in it is sufficient enough to carry everything that my baby needs. Great product! Now, I’m looking forward to buying a baby walker from here as well.",
    "replies": ""
  },
  {
    "date": "2019-11-21T07:05:46Z",
    "account_name": "Eliza Clark",
    "url": "https://www.trustpilot.com/users/5d9f18fc96d3fdaad96d2a7a",
    "article": "Whenever I have to carry my kid, I use the multipurpose infant carrier which I purchased from Easy life helper some days back. Now I can easily take my kid anywhere along without breaking a sweat. A very useful product for parents. Would definitely recommend.",
    "replies": ""
  },
  {
    "date": "2019-11-18T12:39:49Z",
    "account_name": "Bradley Kern",
    "url": "https://www.trustpilot.com/users/5dce5e2987f09fa960229229",
    "article": "I have recently ordered a lot of products for my baby from this site and I am very happy with services and quality I received. Among all my purchases, I like Baby Non-Slip Bath Pad the most. It is made up of soft material that gives a great comfort to my baby as well as keep him safe while taking a bath. Thanks a lot guys.",
    "replies": ""
  },
  {
    "date": "2019-11-16T08:49:47Z",
    "account_name": "Hernandez Daisy",
    "url": "https://www.trustpilot.com/users/5dcd33c817e36e7d492b026e",
    "article": "I bought a nursing diaper bag to carry my baby's stuff. It is very spacious inside, easy to carry diapers, wipes, baby bottles, and medicines, plus there is enough space inside where I can keep my phone and accessories. A very useful product for all the moms out there for sure.",
    "replies": ""
  },
  {
    "date": "2019-11-14T14:00:51Z",
    "account_name": "Roberta Duke",
    "url": "https://www.trustpilot.com/users/5dcbed65a380ed1a157d6228",
    "article": "Thank you so much Easy Life Helper for providing me with such a good quality Adjustable Baby Walker and that too at such an affordable price. It is really comfortable to use and my baby has slowly started to learn walking! 5 stars.",
    "replies": ""
  },
  {
    "date": "2019-11-07T11:43:59Z",
    "account_name": "Adele Rolfson",
    "url": "https://www.trustpilot.com/users/5db96e5d204297faada4fdc9",
    "article": "Recently bought a SnuggleBear Sleepsack from EasyLifeHelper! It has soft fabric and slots at the back helps me to attach it to strollers. I really love this product as it has made carrying my child easy. Recommended.",
    "replies": ""
  },
  {
    "date": "2019-10-30T09:58:36Z",
    "account_name": "Stuart Marsh",
    "url": "https://www.trustpilot.com/users/5dad87a10f4c1aff6bb77bea",
    "article": "I recently bought a baby walker for my newborn grandson from this site. He loves playing with it all the time and I am sure that he will start walking soon with its help! Great product.",
    "replies": ""
  },
  {
    "date": "2019-10-29T06:56:44Z",
    "account_name": "Junior Chen",
    "url": "https://www.trustpilot.com/users/5d8db6fcee682136ca669544",
    "article": "Excellent baby products at affordable prices. Would definitely recommend EasyLifeHelper to all the parents out there. 5 stars!",
    "replies": ""
  },
  {
    "date": "2019-10-26T05:35:01Z",
    "account_name": "Dorothy Jimenez",
    "url": "https://www.trustpilot.com/users/5da065a77c1d9c7ed6197f0b",
    "article": "My husband and I bought 2 sleep sacks from this site for our twin kids. the sacks look really cute, and the fabric feels warm and comfy. I am very happy with how less these people charged for this amazing product. Recommending it to my friends too.",
    "replies": ""
  },
  {
    "date": "2019-10-25T11:45:29Z",
    "account_name": "Jessica Springer",
    "url": "https://www.trustpilot.com/users/5daf03e6a1c9cf87f304652f",
    "article": "Thank you so much EasyLifeHelper for selling such adorable and cute baby products. Recently I purchased a Robo-Pal Baby Walker from this amazing website, and I am 100% satisfied with it. The walker comes with amazing features and has helped my baby to learn to walk. It comes with a comfortable seat and back support that gives him the freedom and safety to try-out his legs. Thanks once again.",
    "replies": ""
  },
  {
    "date": "2019-10-23T11:42:05Z",
    "account_name": "Eldon Russell",
    "url": "https://www.trustpilot.com/users/5daad35e98b06041020f15a9",
    "article": "After 3 months of use, the nursing diaper bag that I got from here still looks new. No tearing or ripping of fabric, and I am happy that the bag makes it easy for me to carry my baby’s belongings around whenever we go out. Great product!",
    "replies": ""
  },
  {
    "date": "2019-10-14T09:49:58Z",
    "account_name": "james R. McCree",
    "url": "https://www.trustpilot.com/users/5d2d84fa1cd7aa2d766fe928",
    "article": "Awesome website for buying baby products. Very nice quality, quick delivery and reasonable pricing. Recommended for everyone.",
    "replies": ""
  },
  {
    "date": "2019-10-09T09:57:37Z",
    "account_name": "Christina R. Shelton",
    "url": "https://www.trustpilot.com/users/5d8e0be647d8f7a980cd4952",
    "article": "Recently purchased a Baby Non-Slip Bath Pad from EasyLifeHelper, and I am 100% satisfied with the product. The quality of the product is very good, and the design shape is simply amazing. Thank you for such a great product!",
    "replies": ""
  },
  {
    "date": "2019-10-04T13:03:06Z",
    "account_name": "Tasha Hinds",
    "url": "https://www.trustpilot.com/users/5d95e6b0ee938221a73b6ff4",
    "article": "I love how compact the bag is and how much stuff I can fit in it, it's easy to keep things organized and bottles fit perfectly in the side! The straps are more comfortable than my last diaper bag and are surprisingly thin! Happy with the purchase.",
    "replies": ""
  },
  {
    "date": "2019-09-27T11:05:54Z",
    "account_name": "Kora Maddox",
    "url": "https://www.trustpilot.com/users/5d6f49b2f1cb2d3604496a8a",
    "article": "Bought a multi-purpose infant carrier from this place. The product quality is good and safe, it holds my baby well. Now I am able to carry my baby around comfortably. Good job.",
    "replies": ""
  },
  {
    "date": "2019-09-24T12:40:15Z",
    "account_name": "Raquel Simmons",
    "url": "https://www.trustpilot.com/users/5d5d429adacb65f81b030b27",
    "article": "The adjustable baby walker is good. Got it for my little brother and the product has made it extremely feasible for him to walk. Great product at such a cost. Cheap cost. 5 stars.",
    "replies": ""
  },
  {
    "date": "2019-09-21T05:25:05Z",
    "account_name": "Joan Kolb",
    "url": "https://www.trustpilot.com/users/5d52ab6b1255be3b70cc847e",
    "article": "I got a multi-functional nursing diaper bag from Easy life helper and it has literally made my life easy. I always keep it with me especially whenever I travel with my baby. It is very spacious and perfect to carry all the baby products. 5 stars.",
    "replies": ""
  },
  {
    "date": "2019-09-18T13:05:54Z",
    "account_name": "Kohar Sargsyan",
    "url": "https://www.trustpilot.com/users/5d4c21216cd7aee2b8e3dc38",
    "article": "Recently purchased an infant carrier for my baby from your site and I really loved it. The carrier has adjusting straps and the best part is, I can carry my baby comfortably in Kangaroo style. Happy with my purchase. 5 stars for such a great product.",
    "replies": ""
  }
]