[
  {
    "date": "2020-02-14T15:46:45.151Z",
    "account_name": "Jessica Bergeron",
    "url": "https://goo.gl/maps/EjnUPq9wd28JAz1W8",
    "article": "As a mother, I’ve always wanted to give the best for my daughter. However, taking care of her makes my backache, especially on times that I need to lean over to help her with walking. And I can’t even do it for more than 5 minutes. Good thing I found Easy Life Helper’s adjustable baby walker. I love its sturdiness and how it can be easily adjusted to fit my baby properly. Great product!"
  },
  {
    "date": "2020-02-05T15:46:45.818Z",
    "account_name": "Alexander Wright",
    "url": "https://goo.gl/maps/f9RH91cPhaTAAVTP7",
    "article": "My husband and I together analyzed dozens of infant carriers on different sites and found out that your Multi-Purpose Infant Carrier met all of our expectations. It is perfect for our child and with that extra cushioning it is comfortable too. We are really happy with the product and would love to buy more."
  },
  {
    "date": "2020-02-05T15:46:46.219Z",
    "account_name": "Sandoval Dawn",
    "url": "https://goo.gl/maps/BCGSde3NAE3ivDB6A",
    "article": "The Baby Non-Slip Bath Pad that I purchased from Easy life helper is just amazing. It is made up of soft material that keeps my baby completely safe while taking a bath. Plus, it is very comfortable too. I am super satisfied with the product! Thank you."
  },
  {
    "date": "2020-02-29T15:46:46.590Z",
    "account_name": "Todd Harris",
    "url": "https://goo.gl/maps/R6yr3gxa8GNkz4D26",
    "article": "Loved their infant carrier! It makes me feel at ease whenever I carry my baby around when I am outside running errands. I get to keep my baby feel secure and safe with me while doing the chores that I need to get done every day. Also, I appreciate their customer support team for always helping me with my questions."
  },
  {
    "date": "2020-02-05T15:46:47.026Z",
    "account_name": "Tristan McEacharn",
    "url": "https://goo.gl/maps/ERKnVXfMLT8qGCoE6",
    "article": "Recently got a non-slip bath pad from this site. It's very soft and gets easily stuck to the bottom of the bathtub. It also has a nice grip which helps prevent falls in the bathtub. Very happy with their product. Would love to buy more from them!"
  },
  {
    "date": "2020-02-21T15:46:47.439Z",
    "account_name": "Eino Jacobs",
    "url": "https://goo.gl/maps/Rg7Dzm3TYeD9kKNbA",
    "article": "As a mother, I’ve always wanted to give the best for my daughter. However, taking care of her makes my backache, especially on times that I need to lean over to help her with walking. And I can’t even do it for more than 5 minutes. Good thing I found Easy Life Helper’s adjustable baby walker. I love its sturdiness and how it can be easily adjusted to fit my baby properly. Great product!"
  },
  {
    "date": "2020-02-05T15:46:47.838Z",
    "account_name": "Alexander Wright",
    "url": "https://goo.gl/maps/f9RH91cPhaTAAVTP7",
    "article": "My husband and I together analyzed dozens of infant carriers on different sites and found out that your Multi-Purpose Infant Carrier met all of our expectations. It is perfect for our child and with that extra cushioning it is comfortable too. We are really happy with the product and would love to buy more."
  },
  {
    "date": "2020-02-05T15:46:47.923Z",
    "account_name": "Sandoval Dawn",
    "url": "https://goo.gl/maps/BCGSde3NAE3ivDB6A",
    "article": "The Baby Non-Slip Bath Pad that I purchased from Easy life helper is just amazing. It is made up of soft material that keeps my baby completely safe while taking a bath. Plus, it is very comfortable too. I am super satisfied with the product! Thank you."
  },
  {
    "date": "2020-02-29T15:46:48.027Z",
    "account_name": "Todd Harris",
    "url": "https://goo.gl/maps/R6yr3gxa8GNkz4D26",
    "article": "Loved their infant carrier! It makes me feel at ease whenever I carry my baby around when I am outside running errands. I get to keep my baby feel secure and safe with me while doing the chores that I need to get done every day. Also, I appreciate their customer support team for always helping me with my questions."
  },
  {
    "date": "2020-02-05T15:46:48.098Z",
    "account_name": "Tristan McEacharn",
    "url": "https://goo.gl/maps/ERKnVXfMLT8qGCoE6",
    "article": "Recently got a non-slip bath pad from this site. It's very soft and gets easily stuck to the bottom of the bathtub. It also has a nice grip which helps prevent falls in the bathtub. Very happy with their product. Would love to buy more from them!"
  },
  {
    "date": "2020-02-21T15:46:48.170Z",
    "account_name": "Eino Jacobs",
    "url": "https://goo.gl/maps/Rg7Dzm3TYeD9kKNbA",
    "article": "Purchased a baby safety car seat from Easy Life Helper. Whenever I drive away from home, I use this car seat to carry my baby. Thanks to it, driving feels safer now, and I feel more relaxed on our road trips."
  },
  {
    "date": "2020-03-04T15:46:48.234Z",
    "account_name": "Virginia Kelly",
    "url": "https://goo.gl/maps/bYS9Ddq1WjWFqBJt6",
    "article": "Got ourselves the SaferSeat Baby Car Seat. Well it’s not really for babies until they can sit up on their own. No problem for us because our girl is already 3 years old. It’s just a nicely built car seat. The quality is up there with big name brands but the SaferSeat is a little more affordable. Definitely a good buy."
  },
  {
    "date": "2020-02-05T15:46:48.605Z",
    "account_name": "Sean Oliver",
    "url": "https://goo.gl/maps/G7kUKzWmGu5A7d6V9",
    "article": "Last week, I purchased a Multi-Purpose Infant Carrier from this excellent website and I am highly impressed with its quality. The carrier has strong and adjustable straps that keep my baby safe. I use it on a daily basis and absolutely love it.100% satisfied with my purchase. 5 stars!"
  },
  {
    "date": "2020-01-06T15:46:49.035Z",
    "account_name": "Max Alsop",
    "url": "https://goo.gl/maps/EGHvBTLS2X82LuK86",
    "article": "I spent an entire hour in comparing Easy Life Helper’s products from similar sites, and found none better! Their baby walker is super cute, which is reliable enough to be worth my money. I would buy more in the coming days. Keep it up!!"
  },
  {
    "date": "2020-02-05T15:46:49.415Z",
    "account_name": "Sheshebens Algonquin",
    "url": "https://goo.gl/maps/b3AFA1icpJ4FALed6",
    "article": "For a busy mom like me, I really appreciate that your customer support team is very responsive. Even though I had issues with the initial product that I purchased, I am glad and satisfied with how the team handled my situation. Kudos to everyone!"
  },
  {
    "date": "2020-01-06T15:46:49.897Z",
    "account_name": "Priscilla Griffin",
    "url": "https://goo.gl/maps/QxtQY2Y2mkjtZ6iw9",
    "article": "Gifted the baby care bag’ form Easy Life Helper to my younger sister who became a mother last month. When she unwrapped the gift, there was a cute smile on her face. At the very moment, I utilized the money paid for the product. I would order more from here and suggest others too. Great products!!"
  },
  {
    "date": "2020-02-28T15:46:50.290Z",
    "account_name": "Declan Briggs",
    "url": "https://goo.gl/maps/HGFmQmVmnReoMLB46",
    "article": "Responsive customer support team. The product I ordered was defective, so I contacted their customer support right away. They were able to resolve the issue immediately. Satisfied customer here!"
  },
  {
    "date": "2020-02-14T15:46:50.700Z",
    "account_name": "Dolores Hines",
    "url": "https://goo.gl/maps/5DzuN5xcnUPCU4B98",
    "article": "I had difficulty in checking out the products on my shopping cart. I immediately contacted their customer support and within a minute I have already received an immediate response. They were able to resolve the issue in a short span of time. Very efficient CSR!"
  },
  {
    "date": "2020-01-06T15:46:51.139Z",
    "account_name": "Raison Busque",
    "url": "https://goo.gl/maps/1Pdxo6FnKxpBynfc8",
    "article": "Thanks, Easy Life Helper for the Super cute baby walker. My daughter is 1 year old and loves riding on it. Her feet of course not long enough, still the walker provides a comfy seat. Perfect!! Must say, it’s a perfect rematch for little teeth."
  },
  {
    "date": "2020-02-05T15:46:51.624Z",
    "account_name": "James Wise",
    "url": "https://goo.gl/maps/Jx4WsAEBDVtmyb9o7",
    "article": "The Easy Life Helper is the most recommended baby accessories store for friends and relatives from me. Their products have helped my son to play, enjoy, and grow. Thank you for the awesome baby walker, this time!!"
  },
  {
    "date": "2020-02-28T15:46:52.040Z",
    "account_name": "Charles Wells",
    "url": "https://goo.gl/maps/YubCyqw6Eo27Cw4f7",
    "article": "Superb baby products! We’ve tried almost all their products, from diaper bags, car seats, baby walkers, to bath pads. Each product is durable and keeps babies secure for sure!"
  },
  {
    "date": "2019-12-07T15:46:52.444Z",
    "account_name": "Eric Thomson",
    "url": "https://goo.gl/maps/CFi2jisQLYy2TJTo6",
    "article": "Thank you, Easy Life Helper for delivering that amazing SnuggleBear Sleep Sack for my baby. The material of the bag is very soft, and of high quality. It really helps my baby to sleep comfortably all night. Plus, I can attach it easily to strollers with baby in it. Great Product! Highly Recommended!"
  },
  {
    "date": "2020-01-06T15:46:52.853Z",
    "account_name": "David Allan",
    "url": "https://goo.gl/maps/VNyn4WpftaowJKrJ9",
    "article": "I bought a non-slip bath pad for my baby girl from here. They delivered the product on time. The bath pad is great, I have used it a couple of times and it works as advertised. Great Product! Will make more deals!!"
  },
  {
    "date": "2020-01-06T15:46:53.219Z",
    "account_name": "David Gray",
    "url": "https://goo.gl/maps/iJgeWMVeyu8y8sKH9",
    "article": "This website has always been my only choice to buy anything for my baby! They have the best quality baby products and the price they quote for each of them is very reasonable. The non-slip bath pad I bought from this site is great. 5 stars all the way!"
  },
  {
    "date": "2019-11-07T15:46:53.606Z",
    "account_name": "Mirna Jennifer",
    "url": "https://goo.gl/maps/sG5WqM9JSKzGjkgv7",
    "article": "The products here are just so genius! My babies loved the colors of the Bath Pad that I bought here. Now, they are more focused on their bath times and indeed much easier for me to get the task done. Also, with less distraction, their bath times are now much safer. I value the safety of my family the most and that is why I just love the products here so much! It puts our family first! Kudos EasyLifeHelper!"
  },
  {
    "date": "2019-12-07T15:46:54.006Z",
    "account_name": "Beth Ingram",
    "url": "https://goo.gl/maps/SKXbpA7y3sfHP1PG9",
    "article": "Bought the baby care bag set from this website a few weeks back, and honestly, it has just made my life so much easier! Not only is the fabric quality awesome, but the space is quite commendable as well. I like how easily I can store my mobile and makeup kit along with my daughter's belongings in it. Overall it's a very good product!"
  },
  {
    "date": "2019-12-07T15:46:54.427Z",
    "account_name": "Rigoberto Smith",
    "url": "https://goo.gl/maps/ULjDWdPKka2XHbCQA",
    "article": "Excellent website for buying baby products! I have used their site for a few times to buy products for my son, and I can say that they provide top-quality products at a reasonable price. 100% satisfied with them!"
  },
  {
    "date": "2019-12-07T15:46:54.905Z",
    "account_name": "Martha Trent",
    "url": "https://goo.gl/maps/38TBeN48KjbBK8Ds9",
    "article": "I purchased a very cute elephant shaped non-slip bath pad for my 1-year-old kid. It's really soft and sticks well with the bathtub floor. Very nice product! Highly Recommended!"
  },
  {
    "date": "2019-12-07T15:46:55.293Z",
    "account_name": "Jonathan James",
    "url": "https://goo.gl/maps/CUja4BuYXUCXLpZc6",
    "article": "Easy Life Helper’s awesome products always satisfy me. Their ‘Robo-Pal’ baby walker is the best first birthday gift for my nephew. Its material is fine, the colour is attractive, as well as the price is reasonable. Will came back soon!!"
  },
  {
    "date": "2020-02-21T15:46:55.664Z",
    "account_name": "Judy Collier",
    "url": "https://goo.gl/maps/r9v8gp5MqBzVCX5m7",
    "article": "I bought a SnuggleBear SleepSack from Easy Life Helper, and I am super satisfied with my purchase! It is designed with special slots at the back where the stroller’s seat-belts get easily inserted which helps to keep my baby safe and secure. Top-notch product!"
  },
  {
    "date": "2020-02-05T15:46:56.043Z",
    "account_name": "Tim Duncan",
    "url": "https://goo.gl/maps/S2uScmyxPMysf44S8",
    "article": "I ordered two of the SnuggleBear SleepSack for our twins, one red and one blue. The product’s quality was a little better than what I expected, which is a good thing. The inner fleece like material was soft and fluffy but didn’t shed too much fiber, the outer layer seems water-resistant, and the in between insulating layer had the right thickness. Perfect for nippy morning stroll or a night out with the twins."
  },
  {
    "date": "2019-11-07T15:46:56.510Z",
    "account_name": "Danny Harris",
    "url": "https://goo.gl/maps/7Law4hotiFgYmfcq6",
    "article": "EasyLifeHelper has all the baby products that you need! I am amazed at the variety of products that they are offering here on their website. It is very unique and fits all the baby needs that you can think of. I have never seen such cute and baby-friendly products before! I will definitely order again!"
  },
  {
    "date": "2020-01-06T15:46:56.911Z",
    "account_name": "Gretchen Thibodeau",
    "url": "https://goo.gl/maps/fznSGVVAV4JqjHDn6",
    "article": "This website is really amazing to buy cute products for your baby. Like last week, I purchased a SnuggleBear Sleepsack from here only which is a great product and is totally comfortable for my baby. Whenever I go for a walk, I just warp this sack around him, which keeps him warm in the stroller and safe as well. Amazing!"
  },
  {
    "date": "2019-11-07T15:46:57.350Z",
    "account_name": "Carolann Purnell",
    "url": "https://goo.gl/maps/PjsPAsQZEGpchHxaA",
    "article": "The Multi-Functional Nursing Diaper Bag that I bought at EasyLifeHelper is made up of really soft and high-quality fabric that is very attracting for moms like me. It also has perfectly designed pockets and organizers that help us even more to store all my baby’s needs. This is such a great buy indeed!"
  },
  {
    "date": "2020-02-05T15:46:57.776Z",
    "account_name": "Boris Tucker",
    "url": "https://goo.gl/maps/39DmDYceYo5E58849",
    "article": "The wife bought me your infant carrier, the one thatyou wear your kid like a backpack but likethe front? I hate the look really. But try hand-carrying all day an 8 pound newborn that gains a pound a day. I love my kid, don’t get me wrong, but he’s killing my back. So that infant carrier is a Godsend especially in places where you can’t take a stroller with you. If you don’t mind looking like a dork, I know I don’t, save your back and use that product."
  },
  {
    "date": "2020-01-06T15:46:58.293Z",
    "account_name": "Anna Gonzalez",
    "url": "https://goo.gl/maps/ADmRL1iXb7N21RJV7",
    "article": "I found top-notch and fairly priced parenting products at Easy Life helper! Their sleepsack works best to keep my baby warm and relaxed throughout the night. Would continue shopping further!!"
  },
  {
    "date": "2020-02-05T15:46:58.714Z",
    "account_name": "jewel crossingham",
    "url": "https://goo.gl/maps/7VL8WAJPKN9Mp3LS6",
    "article": "Our son loves the Robo-Pal Walker. We put him there and he goes into his little Robot playtime while we can go about doing our housechores without worrying about our son crawling into trouble. When he’s done, we collapse the thing and store it under the bed. It’s very convenient!"
  },
  {
    "date": "2020-02-14T15:46:59.086Z",
    "account_name": "Megan Fabre",
    "url": "https://goo.gl/maps/w8FB9jK5wg6LVE4DA",
    "article": "I so love their products! I can’t wait for them to launch other baby products."
  },
  {
    "date": "2019-12-07T15:46:59.461Z",
    "account_name": "Benjamin Brown",
    "url": "https://goo.gl/maps/2HZyduJTsxS4Mp7e8",
    "article": "The SnuggleBear Sleepsack I purchased from this site is amazing. Its outer layer is made from polyester and inner layer from cotton which provides the right amount of comfort and insulation for your child. It also has slots at the back to attach it to the stroller. I am absolutely loving this product and so is my kid. Highly Recommended!"
  },
  {
    "date": "2019-11-07T15:46:59.926Z",
    "account_name": "Erika Verhey",
    "url": "https://goo.gl/maps/cZtkLZzG55hfYNP2A",
    "article": "As a single mother, raising up your baby and attending to his needs is very hard and almost impossible. You will be needing a lot of products and a lot of bags even to make sure that you have everything. Not a day goes by that I am not exhausted in checking and rechecking the things that I need for my baby. EasyLifeHelper rescued me from all of these miseries by providing unique and high-quality baby products that are chiefly designed for busy moms like me. I would not know what to do if I haven’t discovered EasyLifeHelper. It is indeed life-changing to have these products with me!  Thank you so much!"
  },
  {
    "date": "2019-12-07T15:47:00.436Z",
    "account_name": "Alana Allmond",
    "url": "https://goo.gl/maps/dgA8Zb9qiG8btwme7",
    "article": "I am a mother who’s always on the go, and most of the time I struggle with multi-tasking because my hands are already full by just carrying my baby. I incur a lot of backlogs with my other tasks because of this matter and sometimes it feels hopeless that I will get anything done in the first place. It is depressing really not to check off things in the long list of my things-to-do. I know that taking care of my baby is my priority, but I also want to finish off other tasks at home and attend to my other kids. Life is indeed emotionally and physically draining having that struggle, but everything changed when I came across EasyLifeHelper who indeed has everything I need to make my mom’s life a whole lot easier. Their products are designed to help moms like me finish our jobs efficiently without compromising our time with our babies. Now, I can clear my things-to-do checklist in no time! EasyLifeHelper, you’re such a lifesaver!"
  },
  {
    "date": "2020-02-05T15:47:00.785Z",
    "account_name": "Choice David",
    "url": "https://goo.gl/maps/eekKvAqLTch7ztC96",
    "article": "Excellent website and products!"
  },
  {
    "date": "2020-01-06T15:47:01.257Z",
    "account_name": "Catherine Flowers",
    "url": "https://goo.gl/maps/XQoHsznT2aqpUHpr8",
    "article": "Delivered exactly on time."
  },
  {
    "date": "2020-02-05T15:47:01.758Z",
    "account_name": "Jasmine Mathis",
    "url": "https://goo.gl/maps/L2QEMrsaDEw9DatK7",
    "article": "Cute products."
  }
]