[
  {
    "date": "2020-02-14T11:48:14.925Z",
    "account_name": "Jessica Bergeron",
    "url": "https://goo.gl/maps/ZSYFYs61xpbHXPcG7",
    "article": "Recently got a non-slip bath pad from this site. It's very soft and gets easily stuck to the bottom of the bathtub. It also has a nice grip which helps prevent falls in the bathtub. Very happy with their product. Would love to buy more from them!"
  },
  {
    "date": "2020-02-21T11:48:16.131Z",
    "account_name": "Eino Jacobs",
    "url": "https://goo.gl/maps/Ttz2xdvqEk8WCHJD8",
    "article": "Got ourselves the SaferSeat Baby Car Seat. Well it’s not really for babies until they can sit up on their own. No problem for us because our girl is already 3 years old. It’s just a nicely built car seat. The quality is up there with big name brands but the SaferSeat is a little more affordable. Definitely a good buy."
  },
  {
    "date": "2020-01-06T11:48:16.808Z",
    "account_name": "Max Alsop",
    "url": "https://goo.gl/maps/sU8498LDPi6zw36y6",
    "article": "For a busy mom like me, I really appreciate that your customer support team is very responsive. Even though I had issues with the initial product that I purchased, I am glad and satisfied with how the team handled my situation. Kudos to everyone!"
  },
  {
    "date": "2020-01-06T11:48:17.511Z",
    "account_name": "Priscilla Griffin",
    "url": "https://goo.gl/maps/9YHSZnMBTAhWFeex5",
    "article": "I had difficulty in checking out the products on my shopping cart. I immediately contacted their customer support and within a minute I have already received an immediate response. They were able to resolve the issue in a short span of time. Very efficient CSR!"
  },
  {
    "date": "2020-01-06T11:48:18.078Z",
    "account_name": "Raison Busque",
    "url": "https://goo.gl/maps/b8X4RA8LxdKhnsTm9",
    "article": "The Easy Life Helper is the most recommended baby accessories store for friends and relatives from me. Their products have helped my son to play, enjoy, and grow. Thank you for the awesome baby walker, this time!!"
  },
  {
    "date": "2020-02-28T11:48:18.576Z",
    "account_name": "Charles Wells",
    "url": "https://goo.gl/maps/kgAjBgqSC3Bc2rcc6",
    "article": "Thank you, Easy Life Helper for delivering that amazing SnuggleBear Sleep Sack for my baby. The material of the bag is very soft, and of high quality. It really helps my baby to sleep comfortably all night. Plus, I can attach it easily to strollers with baby in it. Great Product! Highly Recommended!"
  },
  {
    "date": "2020-01-06T11:48:19.155Z",
    "account_name": "David Allan",
    "url": "https://goo.gl/maps/kmSUDCwWdyeq5teK9",
    "article": "This website has always been my only choice to buy anything for my baby! They have the best quality baby products and the price they quote for each of them is very reasonable. The non-slip bath pad I bought from this site is great. 5 stars all the way!"
  },
  {
    "date": "2019-11-07T11:48:19.611Z",
    "account_name": "Mirna Jennifer",
    "url": "https://goo.gl/maps/hnoGc9iooEu9VC197",
    "article": "Bought the baby care bag set from this website a few weeks back, and honestly, it has just made my life so much easier! Not only is the fabric quality awesome, but the space is quite commendable as well. I like how easily I can store my mobile and makeup kit along with my daughter's belongings in it. Overall it's a very good product!"
  },
  {
    "date": "2019-12-07T11:48:20.077Z",
    "account_name": "Rigoberto Smith",
    "url": "https://goo.gl/maps/9CiGDignmvMHAnTT7",
    "article": "I purchased a very cute elephant shaped non-slip bath pad for my 1-year-old kid. It's really soft and sticks well with the bathtub floor. Very nice product! Highly Recommended!"
  },
  {
    "date": "2020-01-06T11:48:20.516Z",
    "account_name": "Jonathan James",
    "url": "https://goo.gl/maps/pqzCvyKX429km1W1A",
    "article": "I ordered two of the SnuggleBear SleepSack for our twins, one red and one blue. The product’s quality was a little better than what I expected, which is a good thing. The inner fleece like material was soft and fluffy but didn’t shed too much fiber, the outer layer seems water-resistant, and the in between insulating layer had the right thickness. Perfect for nippy morning stroll or a night out with the twins."
  },
  {
    "date": "2019-11-07T11:48:21.421Z",
    "account_name": "Danny Harris",
    "url": "https://goo.gl/maps/YVEVvXRaBchysmvF7",
    "article": "The wife bought me your infant carrier, the one thatyou wear your kid like a backpack but likethe front? I hate the look really. But try hand-carrying all day an 8 pound newborn that gains a pound a day. I love my kid, don’t get me wrong, but he’s killing my back. So that infant carrier is a Godsend especially in places where you can’t take a stroller with you. If you don’t mind looking like a dork, I know I don’t, save your back and use that product."
  },
  {
    "date": "2020-01-06T11:48:22.361Z",
    "account_name": "Anna Gonzalez",
    "url": "https://goo.gl/maps/MRHn3k5fNLTV5E7PA",
    "article": "Our son loves the Robo-Pal Walker. We put him there and he goes into his little Robot playtime while we can go about doing our housechores without worrying about our son crawling into trouble. When he’s done, we collapse the thing and store it under the bed. It’s very convenient!"
  },
  {
    "date": "2020-02-14T11:48:22.839Z",
    "account_name": "Megan Fabre",
    "url": "https://goo.gl/maps/axz7TDGtRX1ApHAt6",
    "article": "The SnuggleBear Sleepsack I purchased from this site is amazing. Its outer layer is made from polyester and inner layer from cotton which provides the right amount of comfort and insulation for your child. It also has slots at the back to attach it to the stroller. I am absolutely loving this product and so is my kid. Highly Recommended!"
  },
  {
    "date": "2019-11-07T11:48:23.404Z",
    "account_name": "Erika Verhey",
    "url": "https://goo.gl/maps/cyfX7UpNTJ6R9Cq97",
    "article": "I am a mother who’s always on the go, and most of the time I struggle with multi-tasking because my hands are already full by just carrying my baby. I incur a lot of backlogs with my other tasks because of this matter and sometimes it feels hopeless that I will get anything done in the first place. It is depressing really not to check off things in the long list of my things-to-do. I know that taking care of my baby is my priority, but I also want to finish off other tasks at home and attend to my other kids. Life is indeed emotionally and physically draining having that struggle, but everything changed when I came across EasyLifeHelper who indeed has everything I need to make my mom’s life a whole lot easier. Their products are designed to help moms like me finish our jobs efficiently without compromising our time with our babies. Now, I can clear my things-to-do checklist in no time! EasyLifeHelper, you’re such a lifesaver!"
  },
  {
    "date": "2020-02-05T11:48:24.011Z",
    "account_name": "Choice David",
    "url": "https://goo.gl/maps/RkEhjQPbvC5ftpgC8",
    "article": "Cute products."
  }
]