[
  {
    "date": 1582712634000,
    "account_name": "Joseph Burroughs",
    "url": "https://www.facebook.com/joseph.burroughs.315/posts/100808894863584",
    "article": "The snuggle bear sleepsack I bought from Easy Life Helper is superb!!. Extremely soft, warm, and cozy that helps my daughter sleep. I Will be buying more products soon, they’re definitely worth the money!!",
    "replies": ""
  },
  {
    "date": 1581485301000,
    "account_name": "Jennie Richmond",
    "url": "https://www.facebook.com/jennie.richmond.794/posts/105502074366220",
    "article": "The Robo-Pal baby walker is one of the most adorable and top-notch quality walkers I've bought. I just loved the fantastic craftsmanship, alluring and non-allergic paint colors. The product keeps my baby engaged and entertained. I utilized each penny invested in it.",
    "replies": ""
  },
  {
    "date": 1581148120000,
    "account_name": "Rory Matthews",
    "url": "https://www.facebook.com/rory.matthews.946/posts/112593513639693",
    "article": "This site has numerous comfortable and safe baby accessories, including the fabulous sleepsack that I bought last week. The product is a sure shot remedy for sleep-deprived parents who pray for their baby’s sound overnight sleep. Also, it is made out of cute material with many different patterns to choose from. Just perfect!!",
    "replies": ""
  },
  {
    "date": 1578307844000,
    "account_name": "Leon Gildea",
    "url": "https://www.facebook.com/leon.gildea/posts/106793557516038",
    "article": "Recently bought a Snuggle Bear SleepSack bag from this amazing store! And I am extremely satisfied with it. The quality of the bag is just top-notch, and I got it at a very affordable price as well. Great place, would love to buy more!",
    "replies": ""
  },
  {
    "date": 1578985270000,
    "account_name": "Diane Holmes",
    "url": "https://www.facebook.com/diane.holmes.9026040/posts/107607130777530",
    "article": "So far, I had an amazing shopping experience at Easy Life Helper. This is my third purchase, in which I bought a bath pad, and I’m 100% satisfied with the quality of the product. Plus, they delivered my package on time and without any damage. Kudos team!!!",
    "replies": ""
  },
  {
    "date": 1577945937000,
    "account_name": "Nicholas Arbogast",
    "url": "https://www.facebook.com/nicholas.arbogast.129/posts/104398314419820",
    "article": "I must say that Easy Life Helper is committed to delivering quality baby accessories on time. I feel lucky to get their baby care bag at such an affordable price. Though the price is low, its features are just fantastic. The bag is sewed perfectly and has multiple pockets. Overall, a fruitful deal!!",
    "replies": ""
  },
  {
    "date": 1577100267000,
    "account_name": "Joe Jones",
    "url": "https://www.facebook.com/permalink.php?story_fbid=105157197663387&id=100045073211645",
    "article": "This place is just amazing! I have been purchasing baby products from this website for a very long time, and have always received the best item. The quality is top-notch, and the price of the products is very reasonable as well as compared to other online websites. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1578726184000,
    "account_name": "Madeline Brown",
    "url": "https://www.facebook.com/madeline.brown.1441/posts/112979863564093",
    "article": "Thank you a bunch, Easy Life Helper for the awesome sleepsack!! Quality is reliable, the fabric is top-notch, and the price is affordable. Moreover, I loved the way your site illustrated the product’s features. 5 stars, undoubtedly!!",
    "replies": ""
  },
  {
    "date": 1576823106000,
    "account_name": "Crystal Funchess",
    "url": "https://www.facebook.com/crystal.funchess.3/posts/108648947305887",
    "article": "Purchased a SnuggleBear Sleepsack for my baby, which has been a great help in keeping him warm. Another best thing about it is the design, it is hard to come off on its own. Extremely satisfied with my purchase!",
    "replies": ""
  },
  {
    "date": 1581756439000,
    "account_name": "Terry Parr",
    "url": "https://www.facebook.com/terry.parr.948/posts/108789117371451",
    "article": "Last week, I purchased one Adjustable Baby Walker from Easy life helper, and I am super satisfied with it. The baby walker was delivered to me before the expected time and that too at a very affordable price. 5 stars without any doubt!",
    "replies": ""
  },
  {
    "date": 1577709703000,
    "account_name": "Mohammad Massenburg",
    "url": "https://www.facebook.com/mohammad.massenburg/posts/109922230523387",
    "article": "This site is just amazing! I have been purchasing several necessary items for my baby, and they have always provided me with the best! I purchased a baby non-slip bath pad last month, that was delivered to me within the expected delivery date. Great quality, excellent price. 5 stars without any doubt!",
    "replies": ""
  },
  {
    "date": 1580104462000,
    "account_name": "Herbert Walker",
    "url": "https://www.facebook.com/herbert.walker.7549/posts/108517164035865",
    "article": "Last month, I bought a Baby non-slip bath pad from this website which is of amazing quality and is made up of soft materials that are safe for babies of all sizes. I am happy that I got such an amazing product for my baby at this price. I recommend this site to all the parents out there!",
    "replies": ""
  },
  {
    "date": 1576305289000,
    "account_name": "Frank Galyon",
    "url": "https://www.facebook.com/frank.galyon/posts/112312373593568",
    "article": "Their baby-care bag is perfect!! Its straps are quite fantastic and sewn perfectly at the neck for lasting reliability. The bottom surface is thick and puffy, which makes it easy to keep the bag anywhere. Recommended!",
    "replies": ""
  },
  {
    "date": 1578118160000,
    "account_name": "Janelle Heck",
    "url": "https://www.facebook.com/janelle.heck.5/posts/100633778137819",
    "article": "I am really happy with the infant carrier I bought from Easy Life Helper. It has very comfortable and light airy shoulder straps that make my baby feel relaxed. Would love to buy more baby products from them.",
    "replies": ""
  },
  {
    "date": 1578481084000,
    "account_name": "Steven Pursel",
    "url": "https://www.facebook.com/steven.pursel.1/posts/109550353906673",
    "article": "Bought your “Nursing Diaper Bag” before going on the trip last month. I’m glad I bought it, as it has enough space, multiple pockets, and perfectly sewed handles to carry all my things. Plus, the price was quite reasonable than other companies selling the same product. Thank you!!",
    "replies": ""
  },
  {
    "date": 1576904589000,
    "account_name": "Kristina Witter",
    "url": "https://www.facebook.com/kristina.witter.9/posts/112277446940734",
    "article": "As a mom, I have purchased their products several times and found them to be very satisfactory.",
    "replies": ""
  },
  {
    "date": 1582802341000,
    "account_name": "Gladys Boling",
    "url": "https://www.facebook.com/gladys.boling.3/posts/102732161335525",
    "article": "Their products are durable and reasonably priced! I bought their baby walker. My eldest son used it when he was learning how to walk, and now my eight-month-old daughter is using it too!",
    "replies": ""
  },
  {
    "date": 1580381098000,
    "account_name": "Arnulfo Stone",
    "url": "https://www.facebook.com/arnulfo.stone.1/posts/112254466997321",
    "article": "Your products really made our family's life hassle-free! Keep up the excellent work!",
    "replies": ""
  },
  {
    "date": 1583218466000,
    "account_name": "Theresa Butler",
    "url": "https://www.facebook.com/theresa.butler.1420/posts/102826491335211",
    "article": "I really like the Nursing Diaper bag from Easy Life Helper. It hangs perfectly on our son’s stroller handles. It’s just the right size too, holding enough baby stuff like diapers and milk but it’s small enough to not get in the way of using the stroller.",
    "replies": ""
  },
  {
    "date": 1579172028000,
    "account_name": "Carl Crump",
    "url": "https://www.facebook.com/carl.crump.779/posts/109474440591091",
    "article": "The Multi-Functional Nursing Diaper Bag I bought from Easy Life helper is amazing. It is perfectly made, and the right size to carry all the essential things for my two-year-old baby. Plus, the designs are super cute too. You guys provided excellent customer service and quick delivery. Truly satisfying.",
    "replies": ""
  },
  {
    "date": 1571898365000,
    "account_name": "John N. Williams",
    "url": "https://www.facebook.com/JohnN.Williams0/posts/1392007950954003",
    "article": "I absolutely love this site. There are a wide range of baby products, their shipping and delivery is fast, and I also like the prices they offer. I have purchased some products for my kids from here, and I am very much satisfied. 5 stars!",
    "replies": ""
  },
  {
    "date": 1579765749000,
    "account_name": "Monica Tindall",
    "url": "https://www.facebook.com/monica.tindall.98/posts/101088568118408",
    "article": "I’m loving the Mommy’Lil Helper Baby Care Bag. It packs all that I need for a day out with my baby. But it doesn’t look frumpy like the other bags. Nor is it as expensive as those really upscale one. It looks great, it’s priced just right, and it does what it does. Highly-recommended for on-the-go Moms like me.",
    "replies": ""
  },
  {
    "date": 1571386178000,
    "account_name": "Kosmas Persakis",
    "url": "https://www.facebook.com/Kosmas.Persakis/posts/1904962776316447",
    "article": "Excellent products! Bought a SnuggleBear Sleepsack from Easy Life Helper and I am 100% satisfied with my purchase. It has amazing design, super comfortable to use and also reasonably priced. 5 stars!",
    "replies": ""
  },
  {
    "date": 1582291024000,
    "account_name": "Jesus Lyons",
    "url": "https://www.facebook.com/jesus.lyons.90/posts/109978520593244",
    "article": "As parents of a newborn, we appreciate how the things we bought from Easy Life Helper helped us adjust easily to our new lifestyle. My spouse and I love their bath pad, diaper bag, and sleep sack. These things made bath time and sleeping time hassle-free! They also make our baby girl comfortable. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1573727148000,
    "account_name": "Benjamin Herbert",
    "url": "https://www.facebook.com/benjamin.herbert.3367/posts/106546177473666",
    "article": "I have purchased Mommy's Lil' Helper Baby Care backpack from this website. It easy to carry and has enough space to pack all the essential baby stuff when you are travelling. I really liked this product. 5 stars!",
    "replies": ""
  },
  {
    "date": 1572528247000,
    "account_name": "Victoria R. Brown",
    "url": "https://www.facebook.com/victoria.r.brown.10/posts/2542337735998810",
    "article": "Recently bought a baby non-slip bath pad from Easy Life Helper and it is really amazing! My son loves playing on it while bathing, and it is safe as well. Great product!",
    "replies": ""
  },
  {
    "date": 1570828465000,
    "account_name": "Jill Yarbrough Vaughn",
    "url": "https://www.facebook.com/jillvaughn/posts/10218962981799286",
    "article": "they fraudulently charged us hundreds of dollars for a product we never ordered and services we never ordered or authorized and definitely never recieved . can't get anyone to answer the phone and when they do they say they cant help with refunds we have to email the company.  we then get back a stock form email response about staying during our 30 day free trial. this crap definitely ISNT free and oh yeah we didn't authorize it, let alone authorize being charged 3 different times. from the same company address and phone number but with 3 different business names. if I don't get the money back immediately I'll do everything legally possible to make sure they have consequences for their actions.",
    "replies": "Dear Jill,We are very sorry to hear about what has happened to you; we take this feedback seriously.We note you said you did not purchase any products or services from us. We advise you to report these unauthorized transactions to your bank.We value the security of our customers, so we ensure our website and payment methods are both secure and up-to-par with changing standards.  When a customer places an order with us, we send all customers a confirmation email, a product email, and they receive a call from our support team to confirm the order. This ensures our customers are reminded about their purchase and provides information about from whom they ordered what.We recommend securing your bank account so this does not happen again and asking them for help in tracking down fraudulent transactions.Yours in service,Easy Life Helpers"
  },
  {
    "date": 1571653387000,
    "account_name": "Sherley Schultz",
    "url": "https://www.facebook.com/sherley.schultz/posts/2390405981200704",
    "article": "I recently purchased a Multi-Functional Nursing Diaper Bag from Easy Life Helper, and it is amazing. The bag is super comfortable to use, and it carries all the important things which I need for my baby. Happy customer!",
    "replies": ""
  },
  {
    "date": 1569324058000,
    "account_name": "Rose Kelly",
    "url": "https://www.facebook.com/rose.kelly.942/posts/2748664871844379",
    "article": "The Multi-Functional Nursing Diaper Bag I bought from Easy Life Helper is great. It has one big compartment to carry everything that my baby needs and helps me keep things organized. This bag is great for a working mother like me. Great Product!",
    "replies": ""
  },
  {
    "date": 1582526235000,
    "account_name": "Bridget McLaughlin",
    "url": "https://www.facebook.com/bridget.mclaughlin.5055/posts/110243323904551",
    "article": "l love going outside, and the first thing that came to my mind when I found out that I was pregnant was how would I be able to be a mom and an adventurous lady at the same time! Thank goodness, my hiker friend recommended to me Easy Life Helper’s infant carrier. When my baby turned six-month-old, I started hiking again, and I was able to bring him with me! I love that I get to do what I love with my son!",
    "replies": ""
  },
  {
    "date": 1571138249000,
    "account_name": "James Tinsley",
    "url": "https://www.facebook.com/JamesTinsley0/posts/754948191617102",
    "article": "I always bathe my daughter in the non-slip bath pad that I ordered from your website. It has a nice shape and holds my baby well. Recommended to every parent!",
    "replies": ""
  },
  {
    "date": 1581336560000,
    "account_name": "Michael Cook",
    "url": "https://www.facebook.com/permalink.php?story_fbid=105938014319007&id=100047084262611",
    "article": "I just bought their non-slip bath pad. I like its cute rabbit design and actually there’s nothing I don't like about the product. Thanks!",
    "replies": ""
  },
  {
    "date": 1572434143000,
    "account_name": "Jen Clark",
    "url": "https://www.facebook.com/jenclark122/posts/1528936417263814",
    "article": "The Robo Pal baby walker has made it extremely easy for me to help my child walk. I like its fabric, the material seemed quite durable to me, plus it looks so cute! I can’t believe I got it at such a reasonable rate. Thumbs up!",
    "replies": ""
  },
  {
    "date": 1569476230000,
    "account_name": "Frantzesa Kalapida",
    "url": "https://www.facebook.com/Frantzesa.Kalapida0/posts/1878398958972786",
    "article": "My Dad purchased an adjustable baby walker from this website and the product came just yesterday. The fabric is tough and provides good support to my little sister while walking. Thank you so much for such an amazing product!",
    "replies": ""
  },
  {
    "date": 1574403842000,
    "account_name": "Wanda Harding",
    "url": "https://www.facebook.com/wanda.harding.965/posts/109750703827136",
    "article": "I bought a Robo PalBaby Walker about a few days back from this website for my daughter, and I got the product last week itself. It looks really cute, just as mentioned on the website, and has made it extremely easy for my baby to learn how to walk. 5 stars for such an exceptional product! Will come here for more soon.",
    "replies": ""
  },
  {
    "date": 1583151368000,
    "account_name": "Maria Murray",
    "url": "https://www.facebook.com/permalink.php?story_fbid=110125580594689&id=100047917431885",
    "article": "We already have the exercise jumpers for our toddler, the spring loaded walker that you hang on the door way. Our kid just loves bopping around in that thing. But now that she’d develop muscle strength, it’s time for a mobile version that will teach her how to really walk. That’s why we got the Adjustable Baby Walker. It works the same except we have to hold the reigns. And we she’s walking, this walker can also serve as a tether to us just to make sure she won’t get to far.",
    "replies": ""
  },
  {
    "date": 1579335467000,
    "account_name": "Pearlene Ball",
    "url": "https://www.facebook.com/pearlene.ball/posts/109611097246349",
    "article": "I am a mom of three. Two of them can already walk, but the youngest is still crawling. Since I am the only one taking care of them at home, running errands can be a challenge sometimes. So, I bought Easy Life Helper's Multi-Purpose Infant Carrier. Since then, I had an easier time taking care of my lovely sons. Thank you for the beautiful product!",
    "replies": ""
  },
  {
    "date": 1579592403000,
    "account_name": "Donna Zuniga",
    "url": "https://www.facebook.com/donna.zuniga.7921/posts/112412790300910",
    "article": "Teaching seven-month-old son how to walk became hassle-free when I purchased the Robo-Pal Baby Walker. It physically prepared him to move around on his own.",
    "replies": ""
  },
  {
    "date": 1572864701000,
    "account_name": "Larry Coggin",
    "url": "https://www.facebook.com/larry.coggin.35/posts/2419517544976641",
    "article": "Thank you Easy Life Helper for the baby products that you guys provide! I and my sister have bought various supplies from your website for our babies, and your products have made our lives much easier. Thank you once again. Thumbs up!",
    "replies": ""
  },
  {
    "date": 1580818788000,
    "account_name": "Jayson Cool",
    "url": "https://www.facebook.com/jayson.cool.351/posts/122184582656770",
    "article": "I love your products ever since! I hope you will add more to the list. I'll be waiting!",
    "replies": ""
  }
]