[
  {
    "date": "2020-02-04T16:16:52.838Z",
    "account_name": "Cassandra Gomez",
    "url": "https://goo.gl/maps/3iaDNSh7mBn1bSDQ8",
    "article": "Before reaching My Success Team, I was all set to invest in social media companies. Thanks to my cousin, who suggested me this place. Along with a proficient coach, they can motivate new entrepreneurs efficiently. My business is now finding better ways to reach its ultimate goals. I admire your great work!!"
  },
  {
    "date": "2020-02-13T16:16:53.874Z",
    "account_name": "Valerie Guertin",
    "url": "https://goo.gl/maps/XnRDEsYf2Rat8tzy5",
    "article": "They offer services that are more than helpful to anyone's business today. They made a sales funnel for my business, and I also tried their social media marketing strategy services. Adding to that, the business coaching sessions I had with them—all I can say is that they give what they promise! I am planning to work with them again soon."
  },
  {
    "date": "2020-02-04T16:16:54.806Z",
    "account_name": "Luke Lee",
    "url": "https://goo.gl/maps/htfKocibAU5o8zwL8",
    "article": "My Success Team is just amazing! \nThe social media marketing services they have been providing us so far are just excellent. Thanks to it, we have been able to gather more leads and has helped to increase the engagement level on our business websites as well. Thank you!"
  },
  {
    "date": "2020-01-05T16:16:55.540Z",
    "account_name": "James Lambert",
    "url": "https://goo.gl/maps/mq5xzt7gDi5fSHh9A",
    "article": "Thank you, My Success Team, for providing such a great Social Media Marketing services. You guys have increased engagement on my social media profiles significantly. I will continue to use your services! Thanks Again!"
  },
  {
    "date": "2019-12-06T16:16:56.442Z",
    "account_name": "Collin Macy",
    "url": "https://goo.gl/maps/8rRinW4Zg8qCgKYf9",
    "article": "Initially, The marketing concept was too much for me to comprehend. But later on, I found them working for my business. With their assistance, it has been easier for me to comprehend the marketing concepts and to implement them in my website. Would surely recommend their excellent service!"
  },
  {
    "date": "2019-12-06T16:16:57.330Z",
    "account_name": "Patricia Liedtke",
    "url": "https://goo.gl/maps/rPgXZ3CUkxqdNZXT8",
    "article": "I had a pretty great experience while working with My Success Team. Their coaching calls are really effective and have helped me to generate more leads for my business. Thanks to their efforts, my sales are growing better and better. Would surely recommend their best services to everyone!"
  },
  {
    "date": "2019-12-06T16:16:58.242Z",
    "account_name": "Alfonso Howe",
    "url": "https://goo.gl/maps/fAC8ZdCUHwXtC6sc9",
    "article": "It’s hard to get objective, competent and useful feedback if you’re the guy on top and everybody else is in your employ. That’s why there’s always a need for coaches like Braxton Yoeman who’s job it is to make sure businessmen like me follow thru in the fulfillment of the business goals we make."
  },
  {
    "date": "2019-12-06T16:16:59.157Z",
    "account_name": "Oliver Hill",
    "url": "https://goo.gl/maps/5a2uVhZm6muZvUU49",
    "article": "Thanks to their assistance with social media marketing, we have got stellar growth in our business and a better conversion rate on our website. Extremely happy with the results. Thumbs up!"
  },
  {
    "date": "2020-02-27T16:17:00.007Z",
    "account_name": "Alan Jackson",
    "url": "https://goo.gl/maps/ZKpxAAXH2Kuuos1GA",
    "article": "I read somewhere that one secret to business success is having a mentor or a business partner. I didn’t have the luxury of a teacher. And with regard to partners, well I do have my friends who are always supportive, but they didn’t share the business language so to speak, and so when it comes to the technicalities, I was on my own. At least that was how it was until I got the services of Braxton Yoeman from MySuccess.Team. He’s what they call a business coach. He helped me when I was developing new business ideas and like a partner, he pushed me to accomplishing my tasks and goals when I really needed pushing. He was instrumental in making me stay on track with my goals. As much as I want to take all the credit for my current success, the outcome would have probably been different had I done it alone. If you need help keeping your course in your business journey, get someone like Braxton Yoeman."
  },
  {
    "date": "2020-02-04T16:17:00.940Z",
    "account_name": "tiana jones",
    "url": "https://goo.gl/maps/KW1X3gqavuGDE5cM6",
    "article": "I’m from a family of proud entrepreneurs and self-made business men. They said my grandfather was a really talented salesman who could sell ice to Eskimos. My father made his fortune buying failing small businesses for cheap, rehabilitating them, and reselling them at a profit. My uncle owns a few car detailing shops, my aunt has several AirBnBs, my sister is an Amazon reseller, and my youngest brother is trading crypto currencies. Unfortunately, our family never shared trade secrets. Not in bad faith, of course. It’s just that we never were in the habit of mixing business stuff with family. And there’s also an assumption that money-making is second-nature to us and nobody in the family needed help with it. Until I did.  \nI tried my hand at several business and all of them were dismal failures. I lost a lot of money and it made me seriously consider that I may have been adopted. But before surrendering my soul to a boring office job, I decided to take one last stab at it, both figuratively and literally. One of my interests is collecting ornamental hand-crafted knives, and to describe the new business briefly, I wanted to connect craftsmen with consumers. \nTo do it differently this time, I got myself a business coach. One I got is Braxton Yoeman from MySuccess.team based on a few recommendations. Having a business coach was quite a revelation. Braxton really helped me formulate my business plans while providing insights that only an expert with true experience with business success will have. It’s like having a family member teaching me the ropes and guiding me along but without all the judgment perhaps.\nLong story short, my members-only website for carvers and collectors is quite a hit with already a few hundred members. My site’s classifieds and online auctions are well participated and I’m getting a fair share of the profits and transaction fees. My family is impressed with me of course but I couldn’t tell them quite yet that I cheated a bit by hiring an exceptional business coach."
  },
  {
    "date": "2020-02-04T16:17:01.873Z",
    "account_name": "Parfait Fouquet",
    "url": "https://goo.gl/maps/5SQhXHp46G5VQrkK9",
    "article": "These people have provided stellar results to us and made sure that we reach our goals in the shortest time possible. I have been using their services for several months now, and my business has grown substantially. Highly recommended!"
  },
  {
    "date": "2020-02-04T16:17:02.672Z",
    "account_name": "Sebastian Grant",
    "url": "https://goo.gl/maps/kuYW4yFiJrBzxf4w8",
    "article": "MySuccess.team and Braxton Yoeman are the secret to my new found success."
  },
  {
    "date": "2020-01-05T16:17:03.324Z",
    "account_name": "Robert Taylor",
    "url": "https://goo.gl/maps/jjqkpKnUPB4QrsP57",
    "article": "I’d been in the business industry for more than 3 years and I can say that it’s not working out well. When I started I get a lot of clients but as years passed by, I only get a few of them. My website is not converting at all. I’ve tried making some changes for my business and basing it on other people’s business models – but it didn’t turn out well, too. Good thing I came across this renowned business coach Braxton Yoeman. He gave me the confidence and clarity to realize the worth of what I am doing. He also shared with me the knowledge that I need to pick my business off the ground. He efficiently helped me to structure my business and within a month of working with him, I started getting new clients and my conversion rate has increased to 50%! That’s an amazing gain for me and my business! I can’t thank Braxton enough for all his help."
  },
  {
    "date": "2020-01-05T16:17:04.023Z",
    "account_name": "Virginia Serra",
    "url": "https://goo.gl/maps/WcDfWjmhx2mBjDmS7",
    "article": "I’ve been a business consultant for 10 years now and I thought that I already knew everything. I’ve already heard about business coaches before but didn’t care at all because I know for myself, that I already know what I am doing and my years of experience as a consultant is enough. Well, I was wrong. I stumbled upon the name Braxton Yoeman while on the internet. I got curious about all the good reviews about him and all his accomplishments. I thought they were just written on the page just to lure audiences to hire him. And guess what? He is more than just a coach! He has helped me understand myself deeply. I was able to renew my motivation to act more towards my dreams and goals. It’s good to have you as a coach, Braxton!"
  },
  {
    "date": "2019-12-06T16:17:04.889Z",
    "account_name": "Rocky Schuler",
    "url": "https://goo.gl/maps/6irCJzzzwiTfJDb38",
    "article": "I am a single dad of three beautiful children. Ever since my wife died, I had been experiencing challenges and difficulties in managing my business. I needed to stay at home so I could take care of them. I was so ready to give up on the business venture I started with my wife when we got married until a friend recommended me to get a business coach. MySuccess.Team assigned Braxton to me. Honestly, I was hesitant at first since I was not sure if it was a good investment. However, Braxton helped me with different aspects of my business that made my life easier. Now, I can be both a good father to my children and a successful businessman. Thanks to you!"
  },
  {
    "date": "2020-02-04T16:17:05.774Z",
    "account_name": "Ariadna Elvia Cardona",
    "url": "https://goo.gl/maps/iakn9yFhMykBYRbB9",
    "article": "You’re the best!"
  },
  {
    "date": "2019-12-06T16:17:06.306Z",
    "account_name": "Tom Browning",
    "url": "https://goo.gl/maps/HPyquxFArCeBMFry7",
    "article": "Great service! Thank you!"
  }
]