[
  {
    "date": 1582868525000,
    "account_name": "Derek Lara",
    "url": "https://www.facebook.com/derek.lara.940436/posts/112484570350715",
    "article": "Superb coaching. Learned a lot from their coaches. Most remarkable one? Braxton Yoeman! I will be expanding my business soon, so I will definitely avail of their services again.",
    "replies": "Dear Derek,Thank you so much for taking the time to leave us this amazing review. Our staff will surely be happy about this review. It was a pleasure transacting with you, and we hope to see you again!Cheers,MySuccess.Team"
  },
  {
    "date": 1582537669000,
    "account_name": "Nicholas Sanderson",
    "url": "https://www.facebook.com/nicholas.sanderson.96741/posts/834474470399709",
    "article": "MySuccess.Team is the best online business coaching company! I cannot say anything bad about my experience with them. I keep coming back because they give the best services out there! Love their dedicated business coaches and staff too!",
    "replies": "Hey Nicholas, This review made our day! Thank you so much for taking the time to leave a lovely review! We look forward to working with you again!Sincerely,MySuccess.Team"
  },
  {
    "date": 1582183127000,
    "account_name": "Melissa J. Repass",
    "url": "https://www.facebook.com/melissa.j.repass/posts/2534181873495144",
    "article": "Excellent customer support team. Knowledgeable coaches. Great company!",
    "replies": "Hi, Melissa, thank you so much for taking the time to leave us this amazing review. Our staff will surely be happy about this review. It was a pleasure transacting with you, and we hope to see you again!Sincerely,My Success Team"
  },
  {
    "date": 1582278329000,
    "account_name": "Neville Zuckerman",
    "url": "https://www.facebook.com/neville.zuckerman78/posts/2724529707643892",
    "article": "Comprehensive and excellent coaching. Braxton Yoeman was my coach, and I experienced firsthand how good he is in teaching. I have tried other business coaching services, but MySuccess.Team stands out among the rest. Keep up the good work team!",
    "replies": "Dear Neville, We are so grateful for your wonderful review. Thank you so much for taking the time to share your feedback with us.Sincerely,MySuccess.Team"
  },
  {
    "date": 1583127292000,
    "account_name": "Howard Guidry",
    "url": "https://www.facebook.com/howard.guidry.77/posts/112954593641908",
    "article": "Excellent and professional. I surely learned a lot them. A few months after my coaching sessions with MySuccess.Team, many of my employees mentioned that I improved a lot in dealing with crises and challenges inside the company. I am so glad to have grown as an entrepreneur! I love my employees, so I always aim to improve as much as I can.",
    "replies": "Dear Howard, We are so glad you like work! We will pass along the kind words. This will surely encourage our dedicated staff to continue giving their best.Sincerely,MySuccess.Team"
  },
  {
    "date": 1581402879000,
    "account_name": "Lottie Cruz",
    "url": "https://www.facebook.com/lottie.cruz.16/posts/103504074567574",
    "article": "I think Yoeman is a very capable coach and his program is thorough. I thought I was too old for this online education stuff, but I was wrong. Braxton Yoeman is a good bet for executive development.",
    "replies": "Thanks for leaving us such a wonderful review, Lottie. Your review reaffirms our commitment to give excellent and quality services to our customers. We look forward to working with you again.Sincerely,My Success Team"
  },
  {
    "date": 1579765801000,
    "account_name": "Marvin Imhoff",
    "url": "https://www.facebook.com/marvin.imhoff/posts/105540550998885",
    "article": "Excellent services and very responsive customer support!",
    "replies": "Hey Marvin,Thank you for allowing us to serve you and even more, for leaving us this review. We are glad that you are happy with our service. Do reach out to us for any suggestions or queries by sending an email to info@mysuccess.team.Sincerely, My Success Team"
  },
  {
    "date": 1578304645000,
    "account_name": "Karen Washington",
    "url": "https://www.facebook.com/permalink.php?story_fbid=104418981089448&id=100045640390619",
    "article": "Just a quick note to thank My Success Team! As an entrepreneur, I found their coaching calls very good. They helped me to get a deeper understanding of the complicated marketing concepts. I'm doing great in my business now! Excellent service!!",
    "replies": "Hey Karen,Thank you for allowing us to serve you and for leaving us an amazing review.We are happy to help your business.All the best,My Success Team"
  },
  {
    "date": 1581936734000,
    "account_name": "Michael Patton",
    "url": "https://www.facebook.com/permalink.php?story_fbid=111615680422924&id=100047234780919",
    "article": "I was assigned to a coach named Braxton, and I can say that he knows a lot about the business industry. He teaches unconventionally. Each session did not feel like a transaction between a provider and client. He is an excellent mentor, coach, and businessman.",
    "replies": "Dear Michael, we are so glad you like Braxton's work! We will pass along the kind words. This will surely encourage our dedicated staff to continue giving their best.Sincerely,My Success Team"
  },
  {
    "date": 1578126441000,
    "account_name": "Amy Gallagher",
    "url": "https://www.facebook.com/amy.gallagher.90226628/posts/109882527201155",
    "article": "My Success Team has been a fantastic asset to all our online marketing approaches. After implementing their excellent strategies, we have started getting a lot of positive responses on our website. 100% satisfied with their services!",
    "replies": "Thank you for recommending us, Amy. It is always our goal to provide our clients with the best experience.Have a great day ahead!All the best,MySuccess.Team"
  },
  {
    "date": 1579071083000,
    "account_name": "Leopoldo Grimes",
    "url": "https://www.facebook.com/leopoldo.grimes.7/posts/105165781025499",
    "article": "With My Success Team's Funnel Creation package, it has been much easier for us to create a high converting sales funnel for my business. They have increased our sales by a huge margin and have got us more engagement. Good Job.",
    "replies": "Hi Leopoldo,Thanks for leaving us such a wonderful review. We are glad that you loved our Funnel Creation package. It is always our goal to provide our clients with the best experience.Our dedicated staff will be pleased to read about your feedback. They work very diligently, so it will provide them with great encouragement to keep doing what they are doing. We look forward to working with you again!Cheers, My Success Team"
  },
  {
    "date": 1576473702000,
    "account_name": "Joey Witman",
    "url": "https://www.facebook.com/joey.witman.52/posts/114653620027005",
    "article": "My Success Team is just amazing! The social media marketing services they have been providing us so far are just amazing. Thanks to it, we have been able to gather more leads and increase engagement on our business websites. Highly recommended!",
    "replies": "Dear Joey,Thank you for taking the time to share with us your feedback. It is always our goal to provide our clients with the best experience. Have a great day ahead. Sincerely, MySuccess.Team"
  },
  {
    "date": 1577687172000,
    "account_name": "Raymond Haynes",
    "url": "https://www.facebook.com/raymond.haynes.9026/posts/104715307717612",
    "article": "For me, working with a strict budget, it was a challenging decision to invest in the product of My Success Team. But, all I have to say is, they are undoubtedly the best. My websites are now quite renowned over the social media networks and are ranking far better. Fruitful services!!",
    "replies": "Thank you for allowing us to serve you and for leaving us this amazing review, Raymond. We are happy to help your business. Have a great day ahead.All the best,My Success Team"
  },
  {
    "date": 1579503404000,
    "account_name": "Terrence Erickson",
    "url": "https://www.facebook.com/terrence.erickson.7/posts/102299841324072",
    "article": "I feel grateful to obtain valuable insights from My Success Team. Their coaching calls were indeed effective and easy to understand. The strategies they told me about marketing has worked perfectly for my e-commerce business. Thumbs Up.",
    "replies": "Thanks for giving us such a wonderful review, Terrence. We are glad to help you and your business.Have a great day ahead!All the best,MySuccess.Team"
  },
  {
    "date": 1577769730000,
    "account_name": "Vicki Reese",
    "url": "https://www.facebook.com/vicki.reese.144/posts/111137183734463",
    "article": "My Success Team has terrific coaches, who worked proficiently to figure out the strengths and weaknesses of my business. Their guidance and strategies are highly valuable. With their extreme support, I’m now able to make a better profit, without spending money on expensive social media marketing services. I highly recommend them!!",
    "replies": "Hey Vicki,Thanks for recommending us and for leaving such a wonderful review. It is always our goal to provide our clients with the best experience.Our dedicated staff will be pleased to read about your feedback. They work very diligently, so it will provide them with great encouragement to keep doing what they are doing. We look forward to working with you again!Cheers,MySuccess.Team"
  },
  {
    "date": 1580124263000,
    "account_name": "Charles Billiot",
    "url": "https://www.facebook.com/charles.billiot.75/posts/100180794881200",
    "article": "I won’t go as far as to say that I’m a naturally gifted businessman. But I know I got great ideas, ideas that will sell. It’s running a business that I’m not too keen at. I understand the principles but I’ve always found it dry and uninteresting. Also a necessary evil if you want things to work. So what I did when I had to create my own business, I hired somebody to give me “the constant push.” I got the services of MySuccess.Team. My coach, Braxton Yoeman, was not much of a drill sergeant but he does have his ways of making me do what I ought to. And the best thing about it? I kinda learned to like running a business a lot more because of him.",
    "replies": "Dear Charles,We are incredibly grateful that you took the time to leave us this feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!Sincerely, My Success Team"
  },
  {
    "date": 1578910206000,
    "account_name": "Jazmin Maynard",
    "url": "https://www.facebook.com/jazmin.maynard.7/posts/107852380751300",
    "article": "I have grown my business under the guidance of My Success Team. Their teaching really helped me to enhance my business further ahead. They have also been handling our advertising campaigns and so far, I am getting better sales for my business. I would like to continue taking their services for longer. Excellent services!",
    "replies": "Hey Jazmin,Thanks for recommending us and giving us such a wonderful review. It is always our goal to provide our clients with the best experience.Our dedicated staff will be pleased to read about your feedback. They work very diligently, so it will provide them with great encouragement to keep doing what they are doing. Have a great day ahead!Cheers,MySuccess.Team"
  },
  {
    "date": 1575695277000,
    "account_name": "Richard Scales",
    "url": "https://www.facebook.com/richard.scales.754/posts/105540754269387",
    "article": "The sales funnel created by the professionals of My Success Team for our company’s product is just amazing. It has resulted in high sales output and has driven more traffic to our website. Great Job!",
    "replies": "Hi Richard,Thank you for allowing us to serve you and even more, for leaving us this review. We are happy to help your business. Have a great day ahead.All the best,MySuccess.Team"
  },
  {
    "date": 1583488909000,
    "account_name": "Liliana Donato",
    "url": "https://www.facebook.com/LilianaDonato2/posts/117971169796707",
    "article": "Admirable coach named Braxton. I read about him before in an article posted on Harvard site. I did not expect to come across him on MySuccess.Team. He is goal-driven, focused, and knowledgeable!",
    "replies": ""
  },
  {
    "date": 1573812987000,
    "account_name": "Jennifer Cantrell",
    "url": "https://www.facebook.com/jennifer.cantrell.90226/posts/106137997517133",
    "article": "My Success Team has great knowledge and the ability to teach social media marketing in simple terms. Their social media strategies and sales funnel have been a huge success for our website. Would recommend them anytime!",
    "replies": "Hi Jennifer,Customer experience and satisfaction is our priority. Your review reaffirms our commitment to provide quality services to our customers. Thank you for leaving us a positive review.Sincerely,MySuccess.Team"
  },
  {
    "date": 1577101555000,
    "account_name": "Patrick Klein",
    "url": "https://www.facebook.com/patrick.klein.92123015/posts/104281791085538",
    "article": "They have a gathering of social media growth experts, who delivers valuable insights for businesses. I purchased their sales funnel creation package which proved to be a boon for my online business website. Would recommend this to everyone!!",
    "replies": "Hi Patrick Klein,Thanks for giving us such a wonderful review. We are glad that you loved our Sales Funnel Creation Package. It is always our goal to provide our clients with the best experience.Our dedicated staff will be pleased to read about your feedback. They work very diligently, so it will provide them with great encouragement to keep doing what they are doing. Have a great day ahead!Cheers, MySuccess.Team"
  },
  {
    "date": 1576674216000,
    "account_name": "Denis Tang",
    "url": "https://www.facebook.com/denis.tang.54/posts/111304913701761",
    "article": "I have been working with My Success Team for growing my business website, and I am very pleased with the results. Their sales funnel, and social media marketing strategies are amazing. Now, I am gaining more new leads, and earning more profits. Highly recommended service!",
    "replies": "Hi Denis,We are incredibly grateful that you took the time to leave us this amazing review. We look forward to serving you again!Sincerely, MySuccess.Team"
  },
  {
    "date": 1577510170000,
    "account_name": "Shannan Wilson",
    "url": "https://www.facebook.com/shannan.wilson.33/posts/103108704544361",
    "article": "We are very satisfied with the paid social media reach! Thanks to the excellent gathering of My Success Team, who increased it significantly in just a month. Now, our profile is expanding with time. Will recommend your service to everyone!!",
    "replies": "Thank you for such an amazing feedback, Shannan. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. Looking forward to serving you again!Sincerely,My Success Team"
  },
  {
    "date": 1582697841000,
    "account_name": "Ashley Hong",
    "url": "https://www.facebook.com/ashley.hong.3701779/posts/199564338088261",
    "article": "Five stars!!! Best online coaching.",
    "replies": "Ashley, your experience means a lot to us! If you have additional feedback, send an email at info@mysuccess.team or call us at +44 (800) 031-8176.All the best,MySuccess.Team"
  },
  {
    "date": 1578485463000,
    "account_name": "Loren Hall",
    "url": "https://www.facebook.com/loren.hall.507/posts/105519854314238",
    "article": "My Success Team is a master in making any business popular across social networking platforms. That's what they did with my undertaking. My websites are getting a high amount of leads and engagement. Keep doing the same!!!",
    "replies": "Thank you for an amazing feedback, Loren. We look forward to serving you again!Sincerely,My Success Team"
  },
  {
    "date": 1581057890000,
    "account_name": "Constance Lee",
    "url": "https://www.facebook.com/constance.lee.568294/posts/103515214560040",
    "article": "I think it’s good value for the insights you’re getting. Never under estimate the power of knowledge. Or self-realization. Or the value of having a good sounding board.",
    "replies": "Dear Constance,Thanks for the feedback. We would love to hear more about your experience so that we can use your valuable opinion to deliver an even better service next time. Please reach out to info@mysuccess.team for any further comments or suggestions you wish to share. Again, thank you for taking the time to share with us your review!Yours sincerely, MySuccess.Team"
  },
  {
    "date": 1571471726000,
    "account_name": "Nate Rigby",
    "url": "https://www.facebook.com/nate.rigby.79/posts/2350976831820907",
    "article": "The experts of My Success Team have great knowledge and ability to teach social media marketing in simple terms. Their social media strategies and sales funnel have been a huge success for our website. Thank you so much!",
    "replies": "Hi Nate,It is always our goal to provide our clients with the best experience. Our dedicated staff will be pleased to read about your feedback. They work very diligently, so it will provide them with great encouragement to keep doing what they are doing. Have a great day ahead. Cheers, My Success Team"
  },
  {
    "date": 1579847381000,
    "account_name": "Thelma Benoit",
    "url": "https://www.facebook.com/thelma.benoit.56/posts/107014457517458",
    "article": "I needed to quit my job to take care of my one-year-old son, so I was worried about where to get the money to support his needs. Upon searching online, I came across MySuccess.Team and saw how it has helped clients with their online businesses. So, I tried their coaching sessions, and I do not regret doing so. I now have an online store where I sell hats and bags. It is gaining more and more customers every day! Thank you, team!",
    "replies": "Hi Thelma,We are incredibly grateful for your amazing feedback. We look forward to serving you again!Cheers, MySuccess.Team"
  },
  {
    "date": 1571651342000,
    "account_name": "Dawn D. Lumsden",
    "url": "https://www.facebook.com/love.dawn12/posts/2526453904251019",
    "article": "We had the pleasure of working with the My Success Team. Their methods and techniques really helped us to enhance sales production. They have been pretty helpful to predict the hiccups and provide the streamline juice flow to gain more conversions for my business.",
    "replies": "Hi Dawn,Thanks for leaving us such a wonderful review. Cheers, My Success Team"
  },
  {
    "date": 1568631214000,
    "account_name": "Daron Howe",
    "url": "https://www.facebook.com/ibo.berfin/posts/2503591956384089",
    "article": "My Success Team has amazing knowledge and ability to teach social media marketing in simple terms. Their social media strategies and sales funnel have been a huge success for our website. Thank You!",
    "replies": "Hi Daron,Your review made our day! Thank you for taking the time to leave us such a positive review. We look forward to working with you again.Sincerely, My Success Team"
  },
  {
    "date": 1577959856000,
    "account_name": "Dorothy McKean",
    "url": "https://www.facebook.com/dorothy.mckean.1/posts/102955327899582",
    "article": "As my business grew and time management becomes challenging, I started searching for services that fulfill my entire SEO needs. At last, found My Success Team, who works with extreme perfection that ultimately helped my brand to gain popularity across social networking platforms. It’s indeed a profitable deal!!",
    "replies": "Hi Dorothy,Thank you for this amazing feedback. Our company values customer satisfaction and we are consistently committed to making our services better. We look forward to serving you again!Sincerely,My Success Team"
  },
  {
    "date": 1572605698000,
    "account_name": "Felicity Dickens",
    "url": "https://www.facebook.com/felicity.dickens.54/posts/2427024164232369",
    "article": "I’ve been working in a big company for 15 years, and I felt that I’m not earning enough even if I worked full time. A friend of mine introduced me to MySuccess.Team. She said that they helped her with managing her own business. I took a course with them and you know what??  I now have my very own online biz! My earnings have also doubled!",
    "replies": "Dear FelicityWe are incredibly grateful that you took the time to leave us this feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!Sincerely,My Success Team"
  },
  {
    "date": 1574161058000,
    "account_name": "Bruce McEwan",
    "url": "https://www.facebook.com/bruce.mcewan.52/posts/143769717030119",
    "article": "After connecting with My Success Team, my business is gaining more and more new clients and clicks on my website. I would highly recommend them to everyone out there. Thank you!",
    "replies": "Hi Bruce,Thanks for leaving us such a wonderful review. It is always our goal to provide our clients with the best experience.Have a great day ahead. Sincerely, MySuccess.Team"
  },
  {
    "date": 1571049120000,
    "account_name": "William Adams",
    "url": "https://www.facebook.com/williams.adams0/posts/1489726211175490",
    "article": "My Success Team aims to provide stellar results to their clients, and they make sure that you reach your goals in a very short period of time and can grow a sustainable business fast. Their strategies and expertise have made our business grow tremendously in just a few months. Thank you so much. 5 stars!",
    "replies": "Hi William,We are incredibly grateful that you took the time to leave us this feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!Sincerely, My Success Team"
  },
  {
    "date": 1568186733000,
    "account_name": "Gregg Cashdollar",
    "url": "https://www.facebook.com/gregg.cashollar/posts/3608802732479099",
    "article": "Braxton is one of the most effective and innovative executive coaches I’ve worked with. Thanks to his guidance, I was able to increase my revenue significantly and boost my business.",
    "replies": "Hi Gregg,Thanks for recommending us. You have been an awesome client and we are happy to know that you are able to use what you've learned to boost your business. Have a great day ahead!Sincerely,My Success Team"
  },
  {
    "date": 1571138861000,
    "account_name": "Adolfo Scheffel",
    "url": "https://www.facebook.com/AdolfoScheffel/posts/753918228384774",
    "article": "This is my review of MySuccess.Team: Working with the team was never easy. We have ups and downs, and there are moments that I thought I was just wasting my time and money on this business.. There are moments that the site I set up with full of issues. I was just glad that they never gave up on me despite me being impatient and sometimes rude.. The team showed me nothing but professionalism and hard work.  MySuccess.Team is simply the best!",
    "replies": "Hi Adolfo,We are incredibly grateful that you took the time to leave us this feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!Sincerely,My Success Team"
  },
  {
    "date": 1568890587000,
    "account_name": "Elizabeth Griffin",
    "url": "https://www.facebook.com/elizabeth.griffin.7902/posts/2493864330696880",
    "article": "These people have made my life so much easier! I found that social media marketing was taking way more time than it should and it was difficult for me to focus on my business. My Success Team has finally taken away this burden from me. There is a commendable increase in my social media traffic. Thank you for this convenient service!",
    "replies": "Hi Elizabeth,Thank you for your feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!Sincerely,My Success Team"
  },
  {
    "date": 1576904985000,
    "account_name": "Patrick Wilson",
    "url": "https://www.facebook.com/permalink.php?story_fbid=114618966702387&id=100044628533167",
    "article": "Thank you, My Success Team, for providing such a great high converting sales for our business. I would love to recommend you guys to others! 5 stars!",
    "replies": "Hi Patrick, Your review made our day! Thank you for taking the time to leave us such a positive review. It is only through customers like you who reaffirm our hard work to give the best experience that we know that we have done our jobs well.We promise to consistently be committed to delivering excellent services to our clients. Looking forward to working with you again. Sincerely, MySuccess.Team"
  },
  {
    "date": 1579245701000,
    "account_name": "Geraldine Tillett",
    "url": "https://www.facebook.com/geraldine.tillett.9/posts/103141797900925",
    "article": "I am a mother of two, and I needed to find ways how to earn money from home. So, a friend recommended to me MySuccessTeam's online coaching. Fortunately, I gained lots of learnings from our sessions! Now, I am managing my own online business, and I also get to take care of my lovely daughters. I cannot wait to learn more from their excellent coaches!",
    "replies": "Dear Geraldine,We are incredibly grateful that you took the time to leave us this feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!All the best, MySuccess.Team"
  },
  {
    "date": 1568357667000,
    "account_name": "Rebecca James",
    "url": "https://www.facebook.com/rebecca.jamess/posts/3494869793860378",
    "article": "The Mysuccessteam has been very helpful in promoting our social media pages. Their strategies and expertise have made our business grow enormously in just a few months.",
    "replies": "Hi Rebecca,Thank you for allowing us to serve you and even more, for leaving us this review.  Like your experience, other customers also loved our \"Social Media Marketing\". We are glad that you are happy with our service. My Success Team"
  },
  {
    "date": 1571896706000,
    "account_name": "Samantha Melville",
    "url": "https://www.facebook.com/samantha.melville.568/posts/2434508740101406",
    "article": "Thank you, My Success Team, for going above and beyond in providing the best social media promotion service. There has been visible progress in my business within the last few weeks. We are gaining new clients and getting more clicks on our site. I highly recommend your service to everyone reading this!",
    "replies": "Dear Samantha,Thanks for leaving us such a wonderful review. We are happy to help your business.All the best,My Success Team"
  },
  {
    "date": 1570446038000,
    "account_name": "Glen Tucker",
    "url": "https://www.facebook.com/glen.tucker.182/posts/2466149936952988",
    "article": "I'm a wounded veteran and having difficulties leaving my home, so when I first heard about an opportunity to start a business working from home I was naturally intrigued. I was skeptical as I've heard about many of these \"business opportunities\" and most of them are worthless and are only there to take your money and give you nothing in return. But I decided to take a leap of faith and try it out. At the beginning it wasn't easy.. I am not very computer-literate and never did any web stuff before, so the idea of me creating an online business was really out of my comfort zone. Also, it took almost a week until I got in touch with my coach Braxton as he was fully booked back then. However after a week as soon as we had our first call, I knew I was in good hands. I still had my doubts and thought I could never make it work. But my coach Braxton never gave up on me and kept motivating me and providing his guidance whenever I needed some support... and lo and behold, fast forward 2 months later and I actually have my very own internet site and a real business attached to it. I can't thank you enough Braxton! I can now work from the comfort of my home, on my own hours, whenever I want to. I could have never done it without you. Tears come to my eyes when I just think about it. I'm truly blessed to have come across you.",
    "replies": "Dear Glen,We are incredibly grateful that you took the time to leave us this feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!Sincerely,My Success Team"
  },
  {
    "date": 1572075386000,
    "account_name": "Esther K. Olson",
    "url": "https://www.facebook.com/EstherK.Olson01/posts/1420031124820301",
    "article": "As a startup, it wasn't easy for me to set up my business, but thanks to the assistance that I got from My Success Team, I have been getting better engagement on my money site. Looking forward to gaining more traffic and increasing my sales while working with these people. Excellent service!",
    "replies": "Hi Esther,We are incredibly grateful that you took the time to leave us this feedback.Sincerely,My Success Team"
  },
  {
    "date": 1580724736000,
    "account_name": "William Rasmussen",
    "url": "https://www.facebook.com/william.rasmussen.58910/posts/122963539243630",
    "article": "Whenever I need to launch a new product that requires planning an entirely new marketing strategy, I can always count on MySuccess to help me execute the planning stage correctly. Goals, ways and means are always better figured out with a business counsel. I recommend MySuccess if you want objective and competent feedback and review of your business operations.",
    "replies": "Hi William, Thank you for allowing us to serve you and even more, for leaving us this review. We are glad that you are happy with our service. Do reach out to us for any suggestions or queries by sending an email to info@mysuccess.team.Sincerely,MySuccess.Team"
  },
  {
    "date": 1580364103000,
    "account_name": "Terry Miller",
    "url": "https://www.facebook.com/permalink.php?story_fbid=108103337416932&id=100046517982981",
    "article": "When I was tasked to head my first big IT project for my company, I wanted to do everything right and not come across as a complete noob among other project heads. I did have a higher-ranking officer that I answer to and I’m free to ask him for guidance. But he has a hundred of other things going and there so much bandwidth he could reasonably devote to mentoring me. So I got myself the next best thing. I got a business coach and he’s from MySuccess Team. The coach didn’t come from my industry but it didn’t matter because I didn’t need help with the technical stuff. What I needed was someone to help me clarify my own plan and objective and help me follow-thru with my own deliverables, tasks that the coach from MySuccess Team brilliantly carried-out. My plan worked. The project was completed in time and it was graded as a success. All thanks to MySuccess Team.",
    "replies": "Dear Terry,Thank you for taking the time to share with us your feedback. It is always our goal to provide our clients with the best experience.Have a great day ahead.All the best,MySuccess.Team"
  },
  {
    "date": 1571742417000,
    "account_name": "Elza C. Crocker",
    "url": "https://www.facebook.com/Elzacrocker10/posts/2574220076145131",
    "article": "Thanks to sales funnel created by My Success Team for our company. We're getting a lot of engagement as compared to before. I've already recommended them to my friends!",
    "replies": "Elza,Thanks for leaving us such a wonderful review. We are glad that you loved our \"Funnel Creation\". It is always our goal to provide our clients with the best experience. Have a great day!Cheers, My Success Team"
  },
  {
    "date": 1579583437000,
    "account_name": "Cathy Wells",
    "url": "https://www.facebook.com/cathy.wells.31542/posts/103713341181813",
    "article": "After college, I tried office-based jobs, and I felt like it was not my niche. A friend who was also managing an online business told me about My Success Team. I had a few business coaching sessions with them, and I got convinced of putting up my own online store. I can't believe I am earning what I have now while enjoying the comfort of my home and without worrying about commuting. My Success Team literally changed my life!",
    "replies": "Dear Cathy,Your review made our day! Our company’s priority is customer experience and satisfaction. Your review reaffirms our commitment to give excellent and quality services to our customers. We look forward to working with you again.All the best, MySuccess.Team"
  },
  {
    "date": 1580887045000,
    "account_name": "Timothy Chavis",
    "url": "https://www.facebook.com/timothy.chavis.127/posts/112804353616628",
    "article": "If you’ve been with the same company for decades, doing whatever it is you’re doing day-in and day-out, everything becomes stale and you’ll just start losing touch. I call it droning on the job. Yes, you can use that catchphrase. You’re welcome. Same thing happened to me. I started hating my job. I didn’t want to quit, the job paid well. But it didn’t want to be miserable at work either. I just miss being emotionally invested in my career, or at least mentally involved. That’s what I felt until I got a little refresher program from MySuccess.team. It’s business coaching, they call it. It was like therapy for worn-out management executives. It’s like having a personal bartender on whom you can dump the worries of your day, except that bartender has a masters in business development and strategic planning (I’m sure some actual bartenders have). Anyway, it works, not overnight, and effects don’t last forever, but I now get it occasionally.",
    "replies": "Hey Timothy, We are incredibly grateful that you took the time to leave us this feedback. Our company values customer satisfaction and we are consistently committed to making our services better. It is customers like you that make our job wonderful. We look forward to serving you again!Sincerely, My Success Team"
  },
  {
    "date": 1572851940000,
    "account_name": "Jack Cardi",
    "url": "https://www.facebook.com/jack.cardi965/posts/1452391048245907",
    "article": "Kudos MySuccess.Team! It’s always a Job well done with You!",
    "replies": "Hi Jack,Thank you for allowing us to serve you and even more, for leaving us this review.All the best,My Success Team"
  },
  {
    "date": 1571203449000,
    "account_name": "Scott L. Collins",
    "url": "https://www.facebook.com/mustafa.zalim.9/posts/3752977128061918",
    "article": "I have been in business for quite some time now and as years passed by, more and more online businesses are booming while brick and mortar businesses go down... and I was afraid that this would happen to my business as well. I am just glad that a friend of mine introduced me to MySuccess.Team. I checked some online reviews and they seemed legit so I went ahead with it. They are a team of professionals who are amazing in social media management and advertising. They completely revamped my business and it's finally growing again.",
    "replies": "Scott, Thanks for leaving us such a wonderful review. :)Your review made our day! Thank you for taking the time to leave us such a positive review. It is only through customers like you who reaffirm our hard work to give the best experience that we know that we have done our jobs well. We promise to consistently be committed to delivering excellent services to our clients. We look forward to working with you again. Sincerely, My Success Team"
  },
  {
    "date": 1580535470000,
    "account_name": "James Smith",
    "url": "https://www.facebook.com/james.smith552/posts/110137897213456",
    "article": "You may need to schedule way ahead for their business coaching services. In my case, it took four weeks of lead time to get a schedule with coach Braxton Yoeman that worked for me. But I’m glad it worked out though but I do wish I got him sooner.",
    "replies": "Hi James, Thank you for allowing us to serve you and even more, for leaving us this review.  Like your experience, other customers also loved our business coaching services. We are glad that you are happy with our service. Do reach out to us for any suggestions or queries by sending an email to info@mysuccess.team.Cheers,My Success Team"
  },
  {
    "date": 1572435804000,
    "account_name": "Joey L. Lopez",
    "url": "https://www.facebook.com/joey.l.lopez.9/posts/2578556489032579",
    "article": "Thank you, My Success Team, for your social media marketing services. I am organically gaining a lot more followers, and my page is growing exponentially! 5 stars.",
    "replies": "Dear Joey,Thanks for giving us 5 stars! We are happy that you are satisfied with our \"Social Media Marketing\" service.Wishing you all the best,My Success Team"
  },
  {
    "date": 1581571393000,
    "account_name": "Alexis Taylor",
    "url": "https://www.facebook.com/permalink.php?story_fbid=112060917036072&id=100046964933593",
    "article": "I’m grateful for you guys!",
    "replies": "Dear Alexis, we are so grateful for your wonderful review. Thank you so much for taking the time to share your feedback with us.Sincerely,My Success Team"
  }
]