[
  {
    "date": "2020-02-05T11:47:46.208Z",
    "account_name": "Damon James",
    "url": "https://goo.gl/maps/sxY76QG1xtWAZ7oeA",
    "article": "Online Success Site has been successfully hosted two of my websites earlier, which are working fabulously these days. Now, I have assigned the third project to them and hope that they would keep up their great services. Moreover, affordable charges are also a reason to invest in their company. Overall, a fruitful deal!!"
  },
  {
    "date": "2020-03-02T11:47:47.129Z",
    "account_name": "Royden Bellefeuille",
    "url": "https://goo.gl/maps/HKfLwzUJSfNbF8jm9",
    "article": "The whole team of Online Success is very professional! Amazing services. Double thumbs up for a fast and high quality of service."
  },
  {
    "date": "2020-01-06T11:47:47.575Z",
    "account_name": "Neil Hughes",
    "url": "https://goo.gl/maps/MceQPAVm6Gpb943q6",
    "article": "I just can’t thank these guys enough for the amazing work they did for my website. They helped me in setting up my new website in the best manner and also helped in the promotion of the website on various social media platforms as well. 5 stars without any doubt!"
  },
  {
    "date": "2020-02-05T11:47:47.975Z",
    "account_name": "Austin Coleman",
    "url": "https://goo.gl/maps/bMUFkiiGwvz1AVW28",
    "article": "I would definitely give 5 stars to the entire team of Online Success Site who worked on my social media campaigns. Their instructions and teaching approach are extremely effective and easy to get into the mind. Moreover, the charges are also quite competitive in the industry."
  },
  {
    "date": "2020-01-06T11:47:48.382Z",
    "account_name": "Stephan Conner",
    "url": "https://goo.gl/maps/24ukoGAyjytKqYee7",
    "article": "The proficient team of the Online Success Site remains all set to meet the challenges in online business. Moreover, their products helped my e-commerce business to get trustworthy recognition among robust competitors. More than just fine!!"
  },
  {
    "date": "2020-02-28T11:47:48.781Z",
    "account_name": "Julia Russell",
    "url": "https://goo.gl/maps/YVDsUveoUzyMcmTY9",
    "article": "I have tried several of their services, and each one catered to my business need. My business is now one of the top-performing ones in the industry!"
  },
  {
    "date": "2020-02-05T11:47:49.249Z",
    "account_name": "Thomas Stevens",
    "url": "https://goo.gl/maps/Z1SrNB4vvXNYRSby8",
    "article": "Top-notch hosting service! They are very professional in their work, and with their help, my business revenue has increased substantially. It was really a great pleasure to work with them. Looking forward to hiring their services again! Thumbs up!!"
  },
  {
    "date": "2020-01-06T11:47:49.623Z",
    "account_name": "Lucinda Dunstan",
    "url": "https://goo.gl/maps/teDsLFmeepfqhCg89",
    "article": "Have been using their service to optimize my sales strategies, and trust me, I have always got the best results. Thanks to Online Success site! Now, I am able to market my products better online, and I am getting more number of leads. 5 stars all the way!"
  },
  {
    "date": "2020-01-06T11:47:50.044Z",
    "account_name": "Warren Peake",
    "url": "https://goo.gl/maps/dD39P5PKX4GZpVf79",
    "article": "Online Success Site is awesome! I have been using their hosting services for quite some time now, and whenever we had any IT issues, their support team is always there to resolve those problems. Plus, my websites are running very smoothly too. Keep it up!"
  },
  {
    "date": "2019-12-07T11:47:50.583Z",
    "account_name": "Curtis Rose",
    "url": "https://goo.gl/maps/2iKGTbQKJ5Qx7NLQ9",
    "article": "I hiring Online Success Site to host my company website was the best decision I ever made. They have made my site more fluid and user-friendly. And their support team has always been able to resolve my issue within minutes. Amazing Services! Highly Recommended!"
  },
  {
    "date": "2019-12-07T11:47:51.012Z",
    "account_name": "Virginia T. Snyder",
    "url": "https://goo.gl/maps/uXp5PSh8qswGf9Dj6",
    "article": "I have been a customer of the Online Success Site for years and extremely satisfied with their service. Their support team is always there to help me out with my website issues and provides assistance quickly. Very impressed with their service."
  },
  {
    "date": "2020-02-05T11:47:51.393Z",
    "account_name": "Kiara Galvin",
    "url": "https://goo.gl/maps/cdzMjefUacFhcETC9",
    "article": "Many thanks, guys, your unique web hosting services helped my newly established eCommerce websites to boost its performance and also to gain more engagement. Plus, you also helped me save a significant portion of my money. Great Services."
  },
  {
    "date": "2019-11-07T11:47:51.840Z",
    "account_name": "Michelle Coletti",
    "url": "https://goo.gl/maps/5cuMTHkL5Uf6M3vZ7",
    "article": "These people are the best! I have been using their cloud hosting services for several months now, and it has really helped me a lot to manage my business website in the best possible way. Would definitely continue using them further, and recommend them to everyone out there. Thumbs up!"
  },
  {
    "date": "2020-01-06T11:47:52.206Z",
    "account_name": "Riccardo Neri",
    "url": "https://goo.gl/maps/2zBjwhehh7Ynroof7",
    "article": "After using so many hosting services, finally, I got the right one! Not only is their service the best, but also very affordable! I would highly recommend this website to each and everyone out there, 5 stars."
  },
  {
    "date": "2019-12-07T11:47:52.626Z",
    "account_name": "Martha Perez",
    "url": "https://goo.gl/maps/H2fcUgUQtMZT4yay8",
    "article": "I have purchased their social media promotion ultimate package and very happy with their services. The team assigned to us was very knowledgeable, and their coaching sessions were of great help. Also, they have done an incredible job in promoting our products on social media. 5 Stars!"
  }
]