[
  {
    "date": "2020-03-02T09:57:31Z",
    "account_name": "Eileen Garduno",
    "url": "https://www.trustpilot.com/users/5e56555668c4b9dc39d1770d",
    "article": "When we had to downsize our organization due to unforeseen shifts in the market, I had to trim-off several departments including marketing. Since the company still needed marketing, I outsourced the job to Support Service Pro. Their content management service kept our marketing going and did a good job at it while we were still working to make ourselves stable.",
    "replies": ""
  },
  {
    "date": "2020-02-29T08:31:49Z",
    "account_name": "Frank Johnson",
    "url": "https://www.trustpilot.com/users/5e564ec76ca715b61884667e",
    "article": "I have zero regrets hiring them. Highly recommended.",
    "replies": ""
  },
  {
    "date": "2020-02-25T08:12:23Z",
    "account_name": "Kathy Smith",
    "url": "https://www.trustpilot.com/users/5e4bc6039ecf7463113c71d4",
    "article": "Coaches have long years of experience, so it was so easy for me to learn from them. They also made me realize how important it is to be updated about the latest technologies and to cope with the developments around me. I feel that they are mentoring me, so I decided to stay with them, and avail of their marketing strategy services. No regrets at all.",
    "replies": ""
  },
  {
    "date": "2020-02-19T08:27:41Z",
    "account_name": "Jennifer Jones",
    "url": "https://www.trustpilot.com/users/5e4a8e2c9ecf7467233bb64f",
    "article": "Excellent coaching. The coach that helped me with my online business is knowledgeable about the clothing industry. He helped me strategize how to market my products to the RIGHT target market. We were able to formulate plans for social media promotion, and he even gave me tips about managing an online business. He is also easy to work with. Good job.",
    "replies": ""
  },
  {
    "date": "2020-02-03T10:30:50Z",
    "account_name": "Olga Burnell",
    "url": "https://www.trustpilot.com/users/5e2eaf9b6167812cf2892160",
    "article": "The entire team of Support Service Pro has provided us with a comprehensive, fast and well-planned email marketing strategy that has yielded great results in our business. Highly impressed with the visible increase in ROI. Would definitely come back for more.",
    "replies": ""
  },
  {
    "date": "2020-01-29T10:03:37Z",
    "account_name": "Robin Smith",
    "url": "https://www.trustpilot.com/users/5e26cc394c24531b01047969",
    "article": "Our company was in dire need of video documentation about our company as we planned to extend our reach online. I came across Support Service Pro, but I was reluctant if they could provide what we needed in a short span of time – we needed the presentation within 2 weeks but they agreed that they could comply with our deadline. The video was amazing and they were able to capture what we had in mind. I couldn’t more be grateful for this company.",
    "replies": ""
  },
  {
    "date": "2020-01-24T11:48:08Z",
    "account_name": "Ridley William",
    "url": "https://www.trustpilot.com/users/5e21b7a54c24535984024067",
    "article": "For quite some time, email marketing was entirely out of our sales strategies. Frankly, we were thinking it was dead for us. But Support Service Pro proved us wrong. With their email marketing package, we are now earning quality leads, and most of our client pitches are getting positive responses. Great Services!",
    "replies": ""
  },
  {
    "date": "2020-01-18T07:34:16Z",
    "account_name": "Boris Payne",
    "url": "https://www.trustpilot.com/users/5e1dbc12616781f35f80c287",
    "article": "Very responsive customer team. Just like to thank you for replying on time whenever I had questions. It helped me a lot since I did not have any background in digital marketing. Now, I am more confident in determining which is the best strategy for my business. Excellent support to clients, indeed!",
    "replies": ""
  },
  {
    "date": "2020-01-09T06:32:28Z",
    "account_name": "Leonard Elmore",
    "url": "https://www.trustpilot.com/users/5e131009b14ccf2b4ffba8c1",
    "article": "The premium email marketing package that I hired from Support Service Pro has worked wonders for my business, and I am highly satisfied with the excellent results. Both our leads and engagement have been increased substantially. I highly recommend them to everyone! Thumbs up!!",
    "replies": ""
  },
  {
    "date": "2020-01-04T07:49:26Z",
    "account_name": "John Spurlock",
    "url": "https://www.trustpilot.com/users/5e0dd29a6af50281262fab50",
    "article": "Their content marketing strategy is working great! Support Service's guidance is simple enough to understand even for an amateur marketer, who can learn, practice, and implement true approaches. Moreover, their charges are quite fair. Recommended service!!",
    "replies": ""
  },
  {
    "date": "2019-12-28T07:08:47Z",
    "account_name": "Josefina Harris",
    "url": "https://www.trustpilot.com/users/5dfddbd931bb5a41de8d8716",
    "article": "I purchased their premium video sales script package, and I am really very happy with the astonishing results my business has got. They helped me in building up an effective video script and an effective promotion strategy as well. Highly recommended. Thank you.",
    "replies": ""
  },
  {
    "date": "2019-12-28T06:43:59Z",
    "account_name": "Leonard Randall",
    "url": "https://www.trustpilot.com/users/5e06f863b14ccf44e5f6cb0b",
    "article": "Recently hired their Video Sales Script service, and I am quite satisfied with the excellent work they did for my business. The writing and editing work was done very professionally, and also the price quoted was quite affordable. Highly recommended!",
    "replies": ""
  },
  {
    "date": "2019-12-26T07:34:28Z",
    "account_name": "Matthew Greeley",
    "url": "https://www.trustpilot.com/users/5dfca8c59848366cce750d40",
    "article": "I hired Support Service Pro to provide us consultancy on Search Engine Advertising. Their team developed a killer marketing strategy paired with keyword research which has helped us generate a good amount of leads. Also, the coaching calls included in the package has helped us better understand SEO. Great Services.",
    "replies": ""
  },
  {
    "date": "2019-12-23T10:42:38Z",
    "account_name": "Valerie Martinez",
    "url": "https://www.trustpilot.com/users/5dfa0cd0d348bf3ce37b97ff",
    "article": "The email marketing package I purchased from this site is working great for my company. We are generating twice the leads than ever before and enjoying a better ROI. Thank You.",
    "replies": ""
  },
  {
    "date": "2019-12-21T09:09:04Z",
    "account_name": "Curtis McAvoy",
    "url": "https://www.trustpilot.com/users/5dfdd579b14ccfdfdef30601",
    "article": "The content marketing package I bought from this site is working great for my company. Their marketing strategy and coaching calls have helped us get more leads and engagement on our website. Thank you for such an amazing service!",
    "replies": ""
  },
  {
    "date": "2019-12-21T06:05:18Z",
    "account_name": "Cesar Charles",
    "url": "https://www.trustpilot.com/users/5dfa03a8bc44db50e414242d",
    "article": "As we all know, Email marketing is one of the important factors in a marketing strategy. And it has proven to be an excellent marketing instrument to help you better convey your message and be in touch with your customers. Thankfully, Support Service Pro has provided me with the best email marketing package, which helped me to promote my business in no time. 5 stars without any doubt.",
    "replies": ""
  },
  {
    "date": "2019-12-17T06:36:14Z",
    "account_name": "Frank Stover",
    "url": "https://www.trustpilot.com/users/5df2273e815b04ca3d7530d5",
    "article": "These people have really helped me a lot with creating strategies for content marketing. Thumbs up.",
    "replies": ""
  },
  {
    "date": "2019-12-13T05:50:19Z",
    "account_name": "Lillian Anderson",
    "url": "https://www.trustpilot.com/users/5dea0ac0ae775850b8b84036",
    "article": "I was really tired of not getting enough conversions for my business, despite my sincere efforts for months together. Then one of my friends suggested me to start working with Supportservicepro, and I have to say they have certainly helped me a lot to boost my ROI with their effective email marketing campaigns. Couldn't be more satisfied with the results. Will definitely come back for more.",
    "replies": ""
  },
  {
    "date": "2019-12-12T13:12:04Z",
    "account_name": "Lorraine Pierce",
    "url": "https://www.trustpilot.com/users/5de8cfc81ef7dc0f8cd92a61",
    "article": "The entire crew of Support Service Pro performed a critical role in assisting my new website and getting more quality leads through three of my remarkable social media campaigns (Facebook, Instagram, and LinkedIn). Working with them is undoubtedly an excellent opportunity to accelerate the lead flow, get potential clients, and build a solid ROI.",
    "replies": ""
  },
  {
    "date": "2019-12-10T10:40:21Z",
    "account_name": "Kevin Lavallee",
    "url": "https://www.trustpilot.com/users/5de4c80debb746380e00f7b3",
    "article": "Working with them has made a huge difference in our business. Their content marketing strategies and SEO knowledge have been a great asset, which helped us to gain more engagement on our site. Very happy with the fruitful results of their efforts.",
    "replies": ""
  },
  {
    "date": "2019-12-06T11:46:08Z",
    "account_name": "Seymour McKay",
    "url": "https://www.trustpilot.com/users/5de0edca741d5f8ac230514a",
    "article": "Thanks a lot for providing such great services. I have got good success using your Email Marketing services so far. Also , I am very contented with the fact that my emails never got jammed and always delivered on time. Thanks again.",
    "replies": ""
  },
  {
    "date": "2019-11-26T09:49:11Z",
    "account_name": "Lyons Pamela",
    "url": "https://www.trustpilot.com/users/5dd66053513905d256590551",
    "article": "Their content marketing strategies have worked a great deal in bringing new audiences and increasing my website interaction. Thanks to Support service Pro, I am gaining a lot more leads than before. 5 stars.",
    "replies": ""
  },
  {
    "date": "2019-11-23T07:11:50Z",
    "account_name": "Zachary Shelton",
    "url": "https://www.trustpilot.com/users/5dd289d4ccc6abcc07ad92b9",
    "article": "Thrilled with the results after using their services. Their email marketing campaign helped us to enhance our deliverability and gained more leads for my business. Would surely recommend their service to everyone.",
    "replies": ""
  },
  {
    "date": "2019-11-21T09:51:00Z",
    "account_name": "Gabriella Gaylord",
    "url": "https://www.trustpilot.com/users/5db971232042973afda50021",
    "article": "We have used their service for customizing scripts for our video marketing, and I must say their team is very creative. The script that they created was quite interactive and has brought more engagement on our business website. Excellent service.",
    "replies": ""
  },
  {
    "date": "2019-11-16T06:03:19Z",
    "account_name": "Holly Wiley",
    "url": "https://www.trustpilot.com/users/5dcbd8a82441831e898a1a3c",
    "article": "Support Service Pro helped us out with their marketing strategies and advertised our business effectively. Though we needed the work to be done urgently, these people were still able to accommodate us and provide a level of professional quality we needed. I am really very happy with the whole services. Thank you.",
    "replies": ""
  },
  {
    "date": "2019-11-14T11:38:50Z",
    "account_name": "Amare Beach",
    "url": "https://www.trustpilot.com/users/5dcaae8da380ed64fd7cbdf8",
    "article": "SupportServicePro proved to be of great help in increasing my site ranking and visibility! I am really happy that the results have been long-lasting and profitable. I would definitely use their services again soon. Thumbs up.",
    "replies": ""
  },
  {
    "date": "2019-11-05T13:05:14Z",
    "account_name": "Henry Howard",
    "url": "https://www.trustpilot.com/users/5dbfbbc4e6bff795992692ff",
    "article": "I have previously used a few other online marketing services for my business, but I am glad that I finally started working with SupportServicePro. The email marketing and content marketing service that they provide is the best. My website engagement and sales rate has increased a lot. I cannot be more thankful.",
    "replies": ""
  },
  {
    "date": "2019-11-04T12:33:25Z",
    "account_name": "Thomas Atwood",
    "url": "https://www.trustpilot.com/users/5dbc1bca9787db762e3f51a8",
    "article": "These people have helped me a lot to create a suitable content marketing strategy for my business! And I am really impressed by the results that I got. The excellent strategy that they performed has helped me gain more leads, and improved the engagement level as well. Great job guys.",
    "replies": ""
  },
  {
    "date": "2019-10-31T07:25:11Z",
    "account_name": "Isabella Johnson",
    "url": "https://www.trustpilot.com/users/5db983c707c9462bb0f6a6d1",
    "article": "Glad that I invested in your service, it has helped me generate more leads for my business. Because of your email marketing campaign, we have grown our reach to the customers now, and are getting more clicks on our website. Thank you.",
    "replies": ""
  },
  {
    "date": "2019-10-29T07:33:50Z",
    "account_name": "Luke Baxter",
    "url": "https://www.trustpilot.com/users/5dad83d30452e6f792ff5e79",
    "article": "We trust SupportServicePro for handling our content marketing campaigns for our business. They’re excellent and I’m in awe of how fast our website is growing. The staff is extremely knowledgeable and up-to-date about the trends. I recommend their service to everyone.",
    "replies": ""
  },
  {
    "date": "2019-10-24T10:25:45Z",
    "account_name": "Aidan James",
    "url": "https://www.trustpilot.com/users/5da05cec2cab13900b679681",
    "article": "I just want to tell you guys that I am really happy with the telephonic coaching that you people provide. Your company is great. You have helped me understand content marketing in-depth, and I am able to increase my sales now. Thank you so much.",
    "replies": ""
  },
  {
    "date": "2019-10-21T10:30:09Z",
    "account_name": "Emma Williams",
    "url": "https://www.trustpilot.com/users/5da71aa6ef6d6263946080ab",
    "article": "After taking their email marketing package, the door of revenue opened for my business and I got the best return on investment. A big thanks to Support Service Pro.",
    "replies": ""
  },
  {
    "date": "2019-10-17T07:38:29Z",
    "account_name": "Mattie Gill",
    "url": "https://www.trustpilot.com/users/5da46e680084ace9be306416",
    "article": "Support Service Pro helped me to improve the content marketing strategy for my business. Now my website is showing in the top positions in the search engines and I would love to work with them in the future as well.",
    "replies": ""
  },
  {
    "date": "2019-10-12T06:39:48Z",
    "account_name": "Cynthia Lewis",
    "url": "https://www.trustpilot.com/users/5d9f1483fc585494f0f8543b",
    "article": "These people were really prompt and responded to all of my doubts in details. They meticulously carried out the keyword research, and their coaching calls have been extremely helpful. I have no hesitation in recommending their service to all the online businesses out there.",
    "replies": ""
  },
  {
    "date": "2019-10-01T09:42:11Z",
    "account_name": "Giovanna Bates",
    "url": "https://www.trustpilot.com/users/5d8af94c2bfdf55a3b2aab5d",
    "article": "These people have helped me with content marketing campaigns for various search engines like google. The keywords that they provided me have worked well for my business page and I can see a commendable increase in the sales. 5 stars.",
    "replies": ""
  },
  {
    "date": "2019-09-28T07:42:05Z",
    "account_name": "Ivanna Mckenzie",
    "url": "https://www.trustpilot.com/users/5d7b7ddf24615b03816fd24d",
    "article": "Supportservicepro are the best if you are looking for a great email marketing service. They offer everything that you need to create a good email, target your audience, monitor the results and boost your sales. I highly recommend them.",
    "replies": ""
  },
  {
    "date": "2019-09-28T06:46:33Z",
    "account_name": "Jamison Callahan",
    "url": "https://www.trustpilot.com/users/5d78848cfde9e2318df97d30",
    "article": "These people are the best. They have helped me with improvising my marketing campaigns with their email marketing strategies and I am able to witness a fair amount of growth in my business. 5 stars.",
    "replies": ""
  },
  {
    "date": "2019-09-26T06:15:47Z",
    "account_name": "Malakai Ryan",
    "url": "https://www.trustpilot.com/users/5d6372743dd41174b20cf185",
    "article": "Just came here to drop a note and say thank you to these people who helped me rank my page up so fast. They are the best. I am finally able to gain more leads and increase my sales.",
    "replies": ""
  },
  {
    "date": "2019-09-23T07:28:27Z",
    "account_name": "Thomas Ferguson",
    "url": "https://www.trustpilot.com/users/5d56afd408fa0e7dd1a8f1cc",
    "article": "These people helped me with creating strategies for content marketing. Their coaching calls have helped me a lot and I am able to enhance the online presence of my business site. Good job SupportServicePro.",
    "replies": ""
  },
  {
    "date": "2019-09-16T12:19:48Z",
    "account_name": "Ruben Matevosyan",
    "url": "https://www.trustpilot.com/users/5d45546e197a687f0ae6f6bc",
    "article": "I would like to thank this company for helping me with marketing for my start-up business. Honestly, I can't even think that any other company could deliver results like them. My money site got top positions in the search engines, again thanks to Supportservicepro.",
    "replies": ""
  },
  {
    "date": "2019-09-07T07:53:05Z",
    "account_name": "Neil Hughes",
    "url": "https://www.trustpilot.com/users/5d70aafc0913a75f21285e74",
    "article": "I have learnt a lot about marketing and advertising on Google and other search engines, thanks to Supportservicepro. These people have helped me understand and implement SEO better. Cannot be more thankful for your services. 5 stars!",
    "replies": ""
  },
  {
    "date": "2019-09-05T10:25:07Z",
    "account_name": "Orlene Deserres",
    "url": "https://www.trustpilot.com/users/5d70ab0ee9e2516fa187d418",
    "article": "Thank you Supportservicepro for helping me learn about content marketing. Now I am able to use those strategies and I can already see much traffic driving into my business page. Thank you so much!",
    "replies": ""
  },
  {
    "date": "2019-08-30T07:53:34Z",
    "account_name": "Lucas Hudson",
    "url": "https://www.trustpilot.com/users/5d4925be705d03b6cdb8c94f",
    "article": "The search engine advertising consultancy of this company is great. They have experienced professionals and amazing resources. Thanks to their guidance now I am able to formulate marketing strategies for my business. 5 stars!!",
    "replies": ""
  },
  {
    "date": "2019-08-27T12:33:08Z",
    "account_name": "Elen Gerthart",
    "url": "https://www.trustpilot.com/users/5d4809746bc3c1f6a60976ac",
    "article": "Thank you Supportservicepro for helping me with my Email marketing campaign. The results are really effective and I can see my website grow. Highly recommended for everyone. 5 stars.",
    "replies": ""
  }
]