[
  {
    "date": 1582705325000,
    "account_name": "Marcia Bradtke",
    "url": "https://www.facebook.com/marcia.bradtke.583/posts/517900299142526",
    "article": "Reasonable prices, high-quality services, and excellent coaches! They know what they are talking about, and they deliver real POSITIVE results. My business is growing and thriving now because of its excellent video sales script, content marketing, and email marketing services!",
    "replies": ""
  },
  {
    "date": 1582180398000,
    "account_name": "Darrell Kirlin",
    "url": "https://www.facebook.com/darrell.kirlin.121/posts/495122411424766",
    "article": "Their content marketing strategies have worked very well in bringing up more customers to my website, and we have started gaining a lot more leads than before. 100% satisfied with the excellent services Support Service Pro provided me with! Highly recommended to everyone reading this.",
    "replies": ""
  },
  {
    "date": 1583126326000,
    "account_name": "Velma Turner",
    "url": "https://www.facebook.com/velma.turner.9809/posts/104292941183619",
    "article": "I run a therapeutic massage service and I only do home service. Getting a massage is something that people don’t decide on a whim. They plan for it like at the end of a work day or a coming weekend. When I consulted with SupportServicePro on which marketing campaign will be best for me, they recommended their email marketing campaign package. It makes sense because clients can save my email like a calling card and retrieve it later on should they decide to schedule an appointment. So I went with it. Lo and behold, just after a week of the campaign, clients started calling in for appointments. It was non-stop and I even had to decline some because of schedule conflicts with other clients. Choosing SupportServicePro was a great decision.",
    "replies": ""
  },
  {
    "date": 1580965147000,
    "account_name": "Roderick Rodriguez",
    "url": "https://www.facebook.com/roderick.rodriguez.355/posts/110012653896909",
    "article": "Great services! Highly recommended, especially for business owners aiming to thrive on the online platforms. Worth the money that you pay!",
    "replies": ""
  },
  {
    "date": 1582523511000,
    "account_name": "Gary A Janes",
    "url": "https://www.facebook.com/gary.ajanes.5/posts/104574611147066",
    "article": "Committed customer support team and business coaches! I was skeptical at first since Support Service Pro is an online company but working with them made me realize how much more I needed to learn about marketing and managing my business. They know a lot about the latest technologies out there, so I am now able to employ these technologies and techniques to my business!",
    "replies": ""
  },
  {
    "date": 1580798317000,
    "account_name": "Edwin Crofts",
    "url": "https://www.facebook.com/edwin.crofts.9/posts/107005294199221",
    "article": "I have tried other digital marketing services providers before, but support service pro proves to be the best. Kudos to the team for their fantastic work!",
    "replies": ""
  },
  {
    "date": 1582887550000,
    "account_name": "Stephen Gomes",
    "url": "https://www.facebook.com/stephen.gomes.142687/posts/105816267692770",
    "article": "Their coaches were extremely helpful in teaching me how to set up my business’s online platforms. I appreciate how they assisted me in strategizing and implementing online marketing plans using their digital marketing services.",
    "replies": ""
  },
  {
    "date": 1579843997000,
    "account_name": "Karri Jones",
    "url": "https://www.facebook.com/karri.jones.505/posts/105018231053408",
    "article": "Excellent service and reasonable prices!",
    "replies": ""
  },
  {
    "date": 1582886197000,
    "account_name": "George Watanabe",
    "url": "https://www.facebook.com/george.watanabe.142/posts/100296691586494",
    "article": "Highly recommended! Great company.",
    "replies": ""
  },
  {
    "date": 1580458309000,
    "account_name": "Bonnie Orozco",
    "url": "https://www.facebook.com/bonnie.orozco.92/posts/102361904665166",
    "article": "SupportServicePro.com provides excellent results! Their services are worth the price. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1579242366000,
    "account_name": "Rowena McDonagh",
    "url": "https://www.facebook.com/rowena.mcdonagh.5/posts/115129643357075",
    "article": "SupportServicePro’s email marketing services are superb. It helped me boost my business’s sales performance. Their strategy helped me widen my customer reach and pretty much gave stability to my earnings too.",
    "replies": ""
  },
  {
    "date": 1580707294000,
    "account_name": "Joanne Snodgrass",
    "url": "https://www.facebook.com/joanne.snodgrass.146/posts/106662210898384",
    "article": "The coaches are experts in their respective industries. It was comfortable working with them since they are approachable and straightforward. I learned a lot from the sessions, and I am planning to schedule more.",
    "replies": ""
  },
  {
    "date": 1580277315000,
    "account_name": "Ruben Holmberg",
    "url": "https://www.facebook.com/ruben.holmberg.71/posts/101909154707317",
    "article": "We have been very impressed with their methodology and approach for our marketing campaign. We took their premium content marketing plan, with their highly focused methods, we are getting more web traffic on our platform. It was quite a pleasant experience working with their team of experts. Would love to opt for their service again!!",
    "replies": ""
  },
  {
    "date": 1576907507000,
    "account_name": "Carrie Fowler",
    "url": "https://www.facebook.com/carrie.fowler.79219/posts/102753414570655",
    "article": "Highly impressed with their service! After purchasing their Premium Email Marketing Package, it has been a lot easier for us to target potential leads and turn them into your dedicated clients. Thanks to that, we are gaining better revenue than ever before. 5 stars!",
    "replies": ""
  },
  {
    "date": 1576499210000,
    "account_name": "Everett Jim",
    "url": "https://www.facebook.com/everett.jim.7/posts/102666711239855",
    "article": "Excellent marketing services! Support Service Pro has really helped us to gain more engagement on our website. Thanks to them, our ROI has increased two-fold in just a month. Great Services!",
    "replies": ""
  },
  {
    "date": 1575696647000,
    "account_name": "Laurie Connor",
    "url": "https://www.facebook.com/laurie.connor.96387/posts/103936577765877",
    "article": "Purchasing their Video Sales Script service, was one of the best decisions I could have ever taken for my business. The writing and editing work was done very professionally, and the price they quoted was very reasonable. Thanks to their efforts, we are now getting more leads and engagement on our website. Highly impressed and satisfied with their work. 5 stars!",
    "replies": ""
  },
  {
    "date": 1575975956000,
    "account_name": "Jack Bailey",
    "url": "https://www.facebook.com/jack.bailey.5680899/posts/104956264333466",
    "article": "The entire credit for my fully optimized websites goes to your dedicated team. I bought two of your products ‘Video sales script’ and ‘web hosting’ and they both are working great. Thrilled to get such an outstanding outcome from them. Would continue enjoying your services in the future to flourish my online business. Keep going, team!!",
    "replies": ""
  },
  {
    "date": 1577081584000,
    "account_name": "Tommie Bell",
    "url": "https://www.facebook.com/tommie.bell.391/posts/106164534227369",
    "article": "The Search Engine Advertising Consultancy package we have purchased from Support Service Pro is working great for us. Their coaching guide and advice about search engine advertisements have brought us a great amount of engagement. Our ROI has also been improved greatly. Honestly, I am very happy with the service provided by them. 5 Stars!",
    "replies": ""
  },
  {
    "date": 1581418307000,
    "account_name": "Francis O'Connor",
    "url": "https://www.facebook.com/francis.oconnor.7315/posts/112293863675064",
    "article": "I was struggling to make my online business gain a higher ranking on search engines. It affected my business performance significantly, so I decided to avail of Support Service Pro’s search engine advertising consultancy, as recommended by a trusted colleague. Luckily, because of it, I was also able to improve in managing my business through the coaching sessions. The service they provide is worth the money that I paid for! No regrets at all!",
    "replies": ""
  },
  {
    "date": 1581578590000,
    "account_name": "Patience Knox",
    "url": "https://www.facebook.com/patience.knox.58/posts/105207981064182",
    "article": "I was just starting my business when I realized that I needed a content expert to help me market my company, as well as its services. However, I was not comfortable in hiring a full-time employee, so I looked up online and found Support Service Pro’s content marketing package. It really helped me improve all my business platforms and resulted in an increase in my business’s customer base. Just months after availing of the service, my business started growing in terms of sales and profits.",
    "replies": ""
  },
  {
    "date": 1575459052000,
    "account_name": "Bruce Eldredge",
    "url": "https://www.facebook.com/bruce.eldredge.94/posts/101657021327135",
    "article": "Their team has provided me with top-notch and comprehensive email marketing strategy that has earned so many potential leads lately. It was really a pleasure to interact with their business experts, who guided me thoroughly regarding the curation of engaging content. I must say, my campaigns got an excellent return on investment.",
    "replies": ""
  },
  {
    "date": 1583385267000,
    "account_name": "Melvin Odom",
    "url": "https://www.facebook.com/melvin.odom.144/posts/110454730563703",
    "article": "Our used car dealership needed a boost in sales. Traditionally, we ran ads in the local newspaper and TV. Unfortunately, nobody reads the papers anymore, and we can only afford TV slots passed midnight. To modernize our marketing effort, we got the help of Support Service Pro. They created a very professional looking video sales letter which ran on YouTube and with social media accounts. It didn’t take long for sales to pick-up. Support Service Pro is really top-notched.",
    "replies": ""
  },
  {
    "date": 1580105376000,
    "account_name": "Kendra Bell",
    "url": "https://www.facebook.com/kendra.bell.5496/posts/102201231343678",
    "article": "At first, I had some issues with the coach assigned to me. He kept on canceling and changing the sessions' schedule, and I felt like it was too disappointing. So, I contacted their customer support, and I'm glad that they accommodated me well. Even though my experience is not perfect, I think it is fair to say that it is not too bad as well.",
    "replies": ""
  },
  {
    "date": 1579677611000,
    "account_name": "Sandra Cerrone",
    "url": "https://www.facebook.com/sandra.cerrone.908/posts/105385797680117",
    "article": "I’m pleased enough to say that your email marketing strategies are top-notch. Right from the content drafting approach to follow-up techniques, all were highly valuable and worked superbly for my email campaigns. Thanks a bunch.",
    "replies": ""
  },
  {
    "date": 1572417114000,
    "account_name": "Anna W. Lozada",
    "url": "https://www.facebook.com/anna.w.lozada/posts/2339713909613780",
    "article": "If you are looking for good content marketing services then, Support Service Pro is the ideal choice for you. They have constantly provided me with great advice which has helped me get more leads on my website. Great Services!",
    "replies": ""
  },
  {
    "date": 1571645966000,
    "account_name": "Flynn Kelley",
    "url": "https://www.facebook.com/flynn.kelley/posts/2363327563917461",
    "article": "I recently hired Support Service Pro to create a video sales script for my company. They are very fast, created the script within some days, and it has helped my company a lot. These people are great. I will recommend their service to everyone!",
    "replies": ""
  },
  {
    "date": 1571141467000,
    "account_name": "Max McDonald",
    "url": "https://www.facebook.com/max.mcdonald.547/posts/694685584374995",
    "article": "We have consulted with Support Service Pro to improve our search engine advertising strategy and their coaching was really helpful. Their experts have guided us with SEO tools and strategies to enhance the viewership on our business site. Would like to thank them for their great service.",
    "replies": ""
  },
  {
    "date": 1572510215000,
    "account_name": "Marilyn J. Barry",
    "url": "https://www.facebook.com/marilyn.j.barry.7/posts/2512270512334413",
    "article": "The video sales scripts have worked the best for our business site! Support Service Pro has produced really creative, and high-quality videos, and also promoted it very well on YouTube. Our business reach has increased exponentially now, and we are gaining more potential leads than ever before. Excellent work!",
    "replies": ""
  },
  {
    "date": 1572862082000,
    "account_name": "Jay Luther",
    "url": "https://www.facebook.com/jaylutherr/posts/1528112790674618",
    "article": "Trust me, this website is the best at providing email marketing services! I hired them for the same about a few months back, and since then I am gaining more leads than ever. Glad that I started working with these people. 5 stars!",
    "replies": ""
  },
  {
    "date": 1579002768000,
    "account_name": "John Robles",
    "url": "https://www.facebook.com/permalink.php?story_fbid=109733203896272&id=100045787789450",
    "article": "Their content marketing strategy approach is unlike the service I used before. None of the techniques is tricky or hard to implement. Plus, there is a huge essence of concern in their teammates regarding customer issues. Keep going!!",
    "replies": ""
  },
  {
    "date": 1578727044000,
    "account_name": "Theresia Sumlin",
    "url": "https://www.facebook.com/theresia.sumlin/posts/2590910297831963",
    "article": "Support Service Pro’s search engine advertising consultancy helped our Adword campaigns greatly. Moreover, I just loved the way you guys explain the keyword research approach. Keep going!!",
    "replies": ""
  },
  {
    "date": 1571306186000,
    "account_name": "Lorikeet Taylor",
    "url": "https://www.facebook.com/lorikeet.taylor.7/posts/2514822388764240",
    "article": "Support Service Pro has been very helpful for us. Thanks to their email marketing strategy we have been getting considerable amount of traffic as compared to before. We are really impressed with their work and would use them again!",
    "replies": ""
  },
  {
    "date": 1568447337000,
    "account_name": "Juanetta Verdejo",
    "url": "https://www.facebook.com/JuanettaVerdejo/posts/2414070545342587",
    "article": "These people helped me create a suitable content marketing strategy for my business, and I am really impressed by the outcome. Their strategy has helped me gain more leads and improved engagement. Great job!",
    "replies": ""
  },
  {
    "date": 1568272039000,
    "account_name": "Bradly Rinner",
    "url": "https://www.facebook.com/bradly.rinners/posts/2532235616888014",
    "article": "These people are the best! They helped me with boosting up my business reach, and I am gaining more audience than before. There is also an elevation in my sales too. I am extremely satisfied with the results. Thank you so much!",
    "replies": ""
  },
  {
    "date": 1576663420000,
    "account_name": "Robert Klein",
    "url": "https://www.facebook.com/permalink.php?story_fbid=104857814353457&id=100044877158099",
    "article": "Support Service Pro had been a great assistance in growing my e-commerce business. With their guidance and support, I’m now able to secure a good position among the competitors. Keep going, team!!",
    "replies": ""
  },
  {
    "date": 1573284684000,
    "account_name": "Laticia Provenza",
    "url": "https://www.facebook.com/marcia.bradtke.583/posts/517900299142526",
    "article": "The team of Support Service Pro understands our industrial needs. With their relevant and engaging email marketing campaign, our business is generating more leads. Would surely recommend!",
    "replies": ""
  },
  {
    "date": 1582180398000,
    "account_name": "Darrell Kirlin",
    "url": "https://www.facebook.com/darrell.kirlin.121/posts/495122411424766",
    "article": "Their content marketing strategies have worked very well in bringing up more customers to my website, and we have started gaining a lot more leads than before. 100% satisfied with the excellent services Support Service Pro provided me with! Highly recommended to everyone reading this.",
    "replies": ""
  },
  {
    "date": 1583126326000,
    "account_name": "Velma Turner",
    "url": "https://www.facebook.com/velma.turner.9809/posts/104292941183619",
    "article": "I run a therapeutic massage service and I only do home service. Getting a massage is something that people don’t decide on a whim. They plan for it like at the end of a work day or a coming weekend. When I consulted with SupportServicePro on which marketing campaign will be best for me, they recommended their email marketing campaign package. It makes sense because clients can save my email like a calling card and retrieve it later on should they decide to schedule an appointment. So I went with it. Lo and behold, just after a week of the campaign, clients started calling in for appointments. It was non-stop and I even had to decline some because of schedule conflicts with other clients. Choosing SupportServicePro was a great decision.",
    "replies": ""
  },
  {
    "date": 1580965147000,
    "account_name": "Roderick Rodriguez",
    "url": "https://www.facebook.com/roderick.rodriguez.355/posts/110012653896909",
    "article": "Great services! Highly recommended, especially for business owners aiming to thrive on the online platforms. Worth the money that you pay!",
    "replies": ""
  },
  {
    "date": 1582523511000,
    "account_name": "Gary A Janes",
    "url": "https://www.facebook.com/gary.ajanes.5/posts/104574611147066",
    "article": "Committed customer support team and business coaches! I was skeptical at first since Support Service Pro is an online company but working with them made me realize how much more I needed to learn about marketing and managing my business. They know a lot about the latest technologies out there, so I am now able to employ these technologies and techniques to my business!",
    "replies": ""
  },
  {
    "date": 1580798317000,
    "account_name": "Edwin Crofts",
    "url": "https://www.facebook.com/edwin.crofts.9/posts/107005294199221",
    "article": "I have tried other digital marketing services providers before, but support service pro proves to be the best. Kudos to the team for their fantastic work!",
    "replies": ""
  },
  {
    "date": 1582887550000,
    "account_name": "Stephen Gomes",
    "url": "https://www.facebook.com/stephen.gomes.142687/posts/105816267692770",
    "article": "Their coaches were extremely helpful in teaching me how to set up my business’s online platforms. I appreciate how they assisted me in strategizing and implementing online marketing plans using their digital marketing services.",
    "replies": ""
  },
  {
    "date": 1579843997000,
    "account_name": "Karri Jones",
    "url": "https://www.facebook.com/karri.jones.505/posts/105018231053408",
    "article": "Excellent service and reasonable prices!",
    "replies": ""
  },
  {
    "date": 1582886197000,
    "account_name": "George Watanabe",
    "url": "https://www.facebook.com/george.watanabe.142/posts/100296691586494",
    "article": "Highly recommended! Great company.",
    "replies": ""
  },
  {
    "date": 1580458309000,
    "account_name": "Bonnie Orozco",
    "url": "https://www.facebook.com/bonnie.orozco.92/posts/102361904665166",
    "article": "SupportServicePro.com provides excellent results! Their services are worth the price. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1579242366000,
    "account_name": "Rowena McDonagh",
    "url": "https://www.facebook.com/rowena.mcdonagh.5/posts/115129643357075",
    "article": "SupportServicePro’s email marketing services are superb. It helped me boost my business’s sales performance. Their strategy helped me widen my customer reach and pretty much gave stability to my earnings too.",
    "replies": ""
  },
  {
    "date": 1580707294000,
    "account_name": "Joanne Snodgrass",
    "url": "https://www.facebook.com/joanne.snodgrass.146/posts/106662210898384",
    "article": "The coaches are experts in their respective industries. It was comfortable working with them since they are approachable and straightforward. I learned a lot from the sessions, and I am planning to schedule more.",
    "replies": ""
  },
  {
    "date": 1580277315000,
    "account_name": "Ruben Holmberg",
    "url": "https://www.facebook.com/ruben.holmberg.71/posts/101909154707317",
    "article": "We have been very impressed with their methodology and approach for our marketing campaign. We took their premium content marketing plan, with their highly focused methods, we are getting more web traffic on our platform. It was quite a pleasant experience working with their team of experts. Would love to opt for their service again!!",
    "replies": ""
  },
  {
    "date": 1576907507000,
    "account_name": "Carrie Fowler",
    "url": "https://www.facebook.com/carrie.fowler.79219/posts/102753414570655",
    "article": "Highly impressed with their service! After purchasing their Premium Email Marketing Package, it has been a lot easier for us to target potential leads and turn them into your dedicated clients. Thanks to that, we are gaining better revenue than ever before. 5 stars!",
    "replies": ""
  },
  {
    "date": 1576499210000,
    "account_name": "Everett Jim",
    "url": "https://www.facebook.com/everett.jim.7/posts/102666711239855",
    "article": "Excellent marketing services! Support Service Pro has really helped us to gain more engagement on our website. Thanks to them, our ROI has increased two-fold in just a month. Great Services!",
    "replies": ""
  },
  {
    "date": 1575696647000,
    "account_name": "Laurie Connor",
    "url": "https://www.facebook.com/laurie.connor.96387/posts/103936577765877",
    "article": "Purchasing their Video Sales Script service, was one of the best decisions I could have ever taken for my business. The writing and editing work was done very professionally, and the price they quoted was very reasonable. Thanks to their efforts, we are now getting more leads and engagement on our website. Highly impressed and satisfied with their work. 5 stars!",
    "replies": ""
  },
  {
    "date": 1575975956000,
    "account_name": "Jack Bailey",
    "url": "https://www.facebook.com/jack.bailey.5680899/posts/104956264333466",
    "article": "The entire credit for my fully optimized websites goes to your dedicated team. I bought two of your products ‘Video sales script’ and ‘web hosting’ and they both are working great. Thrilled to get such an outstanding outcome from them. Would continue enjoying your services in the future to flourish my online business. Keep going, team!!",
    "replies": ""
  },
  {
    "date": 1577081584000,
    "account_name": "Tommie Bell",
    "url": "https://www.facebook.com/tommie.bell.391/posts/106164534227369",
    "article": "The Search Engine Advertising Consultancy package we have purchased from Support Service Pro is working great for us. Their coaching guide and advice about search engine advertisements have brought us a great amount of engagement. Our ROI has also been improved greatly. Honestly, I am very happy with the service provided by them. 5 Stars!",
    "replies": ""
  },
  {
    "date": 1581418307000,
    "account_name": "Francis O'Connor",
    "url": "https://www.facebook.com/francis.oconnor.7315/posts/112293863675064",
    "article": "I was struggling to make my online business gain a higher ranking on search engines. It affected my business performance significantly, so I decided to avail of Support Service Pro’s search engine advertising consultancy, as recommended by a trusted colleague. Luckily, because of it, I was also able to improve in managing my business through the coaching sessions. The service they provide is worth the money that I paid for! No regrets at all!",
    "replies": ""
  },
  {
    "date": 1581578590000,
    "account_name": "Patience Knox",
    "url": "https://www.facebook.com/patience.knox.58/posts/105207981064182",
    "article": "I was just starting my business when I realized that I needed a content expert to help me market my company, as well as its services. However, I was not comfortable in hiring a full-time employee, so I looked up online and found Support Service Pro’s content marketing package. It really helped me improve all my business platforms and resulted in an increase in my business’s customer base. Just months after availing of the service, my business started growing in terms of sales and profits.",
    "replies": ""
  },
  {
    "date": 1575459052000,
    "account_name": "Bruce Eldredge",
    "url": "https://www.facebook.com/bruce.eldredge.94/posts/101657021327135",
    "article": "Their team has provided me with top-notch and comprehensive email marketing strategy that has earned so many potential leads lately. It was really a pleasure to interact with their business experts, who guided me thoroughly regarding the curation of engaging content. I must say, my campaigns got an excellent return on investment.",
    "replies": ""
  },
  {
    "date": 1583385267000,
    "account_name": "Melvin Odom",
    "url": "https://www.facebook.com/melvin.odom.144/posts/110454730563703",
    "article": "Our used car dealership needed a boost in sales. Traditionally, we ran ads in the local newspaper and TV. Unfortunately, nobody reads the papers anymore, and we can only afford TV slots passed midnight. To modernize our marketing effort, we got the help of Support Service Pro. They created a very professional looking video sales letter which ran on YouTube and with social media accounts. It didn’t take long for sales to pick-up. Support Service Pro is really top-notched.",
    "replies": ""
  },
  {
    "date": 1580105376000,
    "account_name": "Kendra Bell",
    "url": "https://www.facebook.com/kendra.bell.5496/posts/102201231343678",
    "article": "At first, I had some issues with the coach assigned to me. He kept on canceling and changing the sessions' schedule, and I felt like it was too disappointing. So, I contacted their customer support, and I'm glad that they accommodated me well. Even though my experience is not perfect, I think it is fair to say that it is not too bad as well.",
    "replies": ""
  },
  {
    "date": 1579677611000,
    "account_name": "Sandra Cerrone",
    "url": "https://www.facebook.com/sandra.cerrone.908/posts/105385797680117",
    "article": "I’m pleased enough to say that your email marketing strategies are top-notch. Right from the content drafting approach to follow-up techniques, all were highly valuable and worked superbly for my email campaigns. Thanks a bunch.",
    "replies": ""
  },
  {
    "date": 1572417114000,
    "account_name": "Anna W. Lozada",
    "url": "https://www.facebook.com/anna.w.lozada/posts/2339713909613780",
    "article": "If you are looking for good content marketing services then, Support Service Pro is the ideal choice for you. They have constantly provided me with great advice which has helped me get more leads on my website. Great Services!",
    "replies": ""
  },
  {
    "date": 1571645966000,
    "account_name": "Flynn Kelley",
    "url": "https://www.facebook.com/flynn.kelley/posts/2363327563917461",
    "article": "I recently hired Support Service Pro to create a video sales script for my company. They are very fast, created the script within some days, and it has helped my company a lot. These people are great. I will recommend their service to everyone!",
    "replies": ""
  },
  {
    "date": 1571141467000,
    "account_name": "Max McDonald",
    "url": "https://www.facebook.com/max.mcdonald.547/posts/694685584374995",
    "article": "We have consulted with Support Service Pro to improve our search engine advertising strategy and their coaching was really helpful. Their experts have guided us with SEO tools and strategies to enhance the viewership on our business site. Would like to thank them for their great service.",
    "replies": ""
  },
  {
    "date": 1572510215000,
    "account_name": "Marilyn J. Barry",
    "url": "https://www.facebook.com/marilyn.j.barry.7/posts/2512270512334413",
    "article": "The video sales scripts have worked the best for our business site! Support Service Pro has produced really creative, and high-quality videos, and also promoted it very well on YouTube. Our business reach has increased exponentially now, and we are gaining more potential leads than ever before. Excellent work!",
    "replies": ""
  },
  {
    "date": 1572862082000,
    "account_name": "Jay Luther",
    "url": "https://www.facebook.com/jaylutherr/posts/1528112790674618",
    "article": "Trust me, this website is the best at providing email marketing services! I hired them for the same about a few months back, and since then I am gaining more leads than ever. Glad that I started working with these people. 5 stars!",
    "replies": ""
  },
  {
    "date": 1579002768000,
    "account_name": "John Robles",
    "url": "https://www.facebook.com/permalink.php?story_fbid=109733203896272&id=100045787789450",
    "article": "Their content marketing strategy approach is unlike the service I used before. None of the techniques is tricky or hard to implement. Plus, there is a huge essence of concern in their teammates regarding customer issues. Keep going!!",
    "replies": ""
  },
  {
    "date": 1578727044000,
    "account_name": "Theresia Sumlin",
    "url": "https://www.facebook.com/theresia.sumlin/posts/2590910297831963",
    "article": "Support Service Pro’s search engine advertising consultancy helped our Adword campaigns greatly. Moreover, I just loved the way you guys explain the keyword research approach. Keep going!!",
    "replies": ""
  },
  {
    "date": 1571306186000,
    "account_name": "Lorikeet Taylor",
    "url": "https://www.facebook.com/lorikeet.taylor.7/posts/2514822388764240",
    "article": "Support Service Pro has been very helpful for us. Thanks to their email marketing strategy we have been getting considerable amount of traffic as compared to before. We are really impressed with their work and would use them again!",
    "replies": ""
  },
  {
    "date": 1568447337000,
    "account_name": "Juanetta Verdejo",
    "url": "https://www.facebook.com/JuanettaVerdejo/posts/2414070545342587",
    "article": "These people helped me create a suitable content marketing strategy for my business, and I am really impressed by the outcome. Their strategy has helped me gain more leads and improved engagement. Great job!",
    "replies": ""
  },
  {
    "date": 1568272039000,
    "account_name": "Bradly Rinner",
    "url": "https://www.facebook.com/bradly.rinners/posts/2532235616888014",
    "article": "These people are the best! They helped me with boosting up my business reach, and I am gaining more audience than before. There is also an elevation in my sales too. I am extremely satisfied with the results. Thank you so much!",
    "replies": ""
  },
  {
    "date": 1576663420000,
    "account_name": "Robert Klein",
    "url": "https://www.facebook.com/permalink.php?story_fbid=104857814353457&id=100044877158099",
    "article": "Support Service Pro had been a great assistance in growing my e-commerce business. With their guidance and support, I’m now able to secure a good position among the competitors. Keep going, team!!",
    "replies": ""
  },
  {
    "date": 1573284684000,
    "account_name": "Laticia Provenza",
    "url": "https://www.facebook.com/Laticia.Provenza13/posts/1429425000539832",
    "article": "The team of Support Service Pro understands our industrial needs. With their relevant and engaging email marketing campaign, our business is generating more leads. Would surely recommend!",
    "replies": ""
  },
  {
    "date": 1568793538000,
    "account_name": "Frederik Brunse",
    "url": "https://www.facebook.com/frederik.brunse.7/posts/3368782183132704",
    "article": "Just came here to drop a note and say thank you for assisting me in optimizing my page. I am able to understand SEO better and implement it further for my website. Great service!",
    "replies": ""
  },
  {
    "date": 1573025168000,
    "account_name": "Phoebe Hester",
    "url": "https://www.facebook.com/permalink.php?story_fbid=2581592195405506&id=100006642525816",
    "article": "Thank you, Support Service Pro, for helping me in growing my business with your content marketing strategies and email marketing campaigns. Traffic on my business site has grown exponentially, and gaining new customers has become a lot easier now. Thanks again!",
    "replies": ""
  },
  {
    "date": 1571898009000,
    "account_name": "Altagracia Nunes",
    "url": "https://www.facebook.com/Altagracia.Nunes4/posts/1393486284133105",
    "article": "Loving their services. We have purchased their email marketing package, and it helped us to generate more sales prospects for our business.",
    "replies": ""
  },
  {
    "date": 1571051616000,
    "account_name": "Eleutherios Lamproukos",
    "url": "https://www.facebook.com/Eleutherios.Lamproukos/posts/1428031550678470",
    "article": "These people have indeed provided us the features that we wanted for an effective email marketing campaign. I’m happy that they always help us to keep up with the marketing trends. Now I am able to analyze my marketing strategies better. Thank you so much!",
    "replies": ""
  }
]