[
  {
    "date": "2020-02-07T11:48:34.004Z",
    "account_name": "Hosea Olson",
    "url": "https://goo.gl/maps/pbUV7uPgehhDKYPT6",
    "article": "I would highly recommend this website to anyone looking for a company that can provide them with one of the best email marketing services. Their email marketing campaigns, along with lead collection strategy, has helped me a great deal in increasing the engagement and gaining more traffic on my business page. Great job guys."
  },
  {
    "date": "2020-02-21T11:48:35.328Z",
    "account_name": "Louise Parrot",
    "url": "https://goo.gl/maps/ChiQtpRhaxMJzZNd6",
    "article": "Lovely staff—friendly customer support team and expert coaches! Nothing bad to say about them. They are an excellent company that deserves all the praise! Great work!"
  },
  {
    "date": "2020-02-28T11:48:35.886Z",
    "account_name": "Paul Wilson",
    "url": "https://goo.gl/maps/muuKxAMoCsCRUixs9",
    "article": "Great coaching and excellent marketing services! Tried their search engine advertising consultancy, and I was astonished by the immediate results. Higher search engine ranking, larger volume of site traffic, and high-conversion sales rate. I cannot thank Support Service Pro enough!"
  },
  {
    "date": "2020-01-06T11:48:36.492Z",
    "account_name": "Orlando Hudson",
    "url": "https://goo.gl/maps/NJMBZbf6tbc2bAQT8",
    "article": "Very happy with their excellent search engine advertising consultancy services! The coaching calls have been very informative, and keyword research has really helped us to make our content more search engine oriented. It hasn't been two months, and we are already getting some great results for our business. We would love to continue working with them in the future. Highly recommended!"
  },
  {
    "date": "2020-01-06T11:48:36.923Z",
    "account_name": "Ava Morrison",
    "url": "https://goo.gl/maps/vZ8Hqask7Fyc87nf8",
    "article": "I had an amazing experience working with Support Service Pro! I purchased their search engine advertising consultancy package and it has worked wonders for my business. Their expert coaches provided me with the best advice, and coaching guidance about search engine advertisements. These people are equipped with the tools and strategies that helped me to learn great things. Highly recommended!"
  },
  {
    "date": "2020-01-06T11:48:37.540Z",
    "account_name": "Charles Blount",
    "url": "https://goo.gl/maps/D9VHNxCVhc5WEqFP7",
    "article": "Purchased their ultimate email marketing package to boost my sales. It has helped me a lot in building a strong email marketing strategy and to gather promising leads. Thanks to their services, my website now has more engagement than ever before. Great Services! Highly recommended!"
  },
  {
    "date": "2020-03-03T11:48:38.310Z",
    "account_name": "Jesper Grondin",
    "url": "https://goo.gl/maps/Pi4RQk9SXYgsonMb6",
    "article": "I think the best thing about SupportServicePro is the people behind it. They’re knowledgeable, accommodating, and you can really tell that quality of work is priority for them. Because of that, I will always recommend them."
  },
  {
    "date": "2020-03-04T11:48:38.921Z",
    "account_name": "Nicolette Morel",
    "url": "https://goo.gl/maps/nYMwv3wTtQeZEAvt6",
    "article": "Love their digital marketing services. It is excellent and high-quality! They really helped my business grow!"
  },
  {
    "date": "2020-02-05T11:48:40.006Z",
    "account_name": "Boris Clarkson",
    "url": "https://goo.gl/maps/anWUfJcXGeWkVgCS7",
    "article": "I availed of their Ultimate Video Sales Script package, and it helped me promote my business online. The results are pretty impressive. After two weeks of posting the promotional video online, my company gained thousands of followers on its social media sites. Those followers also quickly became loyal customers. Thanks to Support Service Pro!"
  },
  {
    "date": "2020-02-05T11:48:43.041Z",
    "account_name": "Michael Minor",
    "url": "https://goo.gl/maps/v9j1LxnXR5cw9w556",
    "article": "Well, using their email marketing package was one of the best decisions I have ever made. It is helping me a lot to convey my messages and I am able to be in touch with my customers more effectively! Will continue working with them further too. 5 stars!"
  },
  {
    "date": "2020-01-06T11:48:43.480Z",
    "account_name": "Brandon Hales",
    "url": "https://goo.gl/maps/ogWhobfLaaprsbzf6",
    "article": "I have gratifying experiences to share! I purchased their ‘Premium Email Marketing’ package last month. It has helped me in building a productive email marketing campaign along with tried and proven strategies to flourish it. Their valuable approaches and techniques are worth my money. Thumbs Up!"
  },
  {
    "date": "2020-02-05T11:48:44.525Z",
    "account_name": "Stephanie Reid",
    "url": "https://goo.gl/maps/vmd3bQbwdwyrB7iA9",
    "article": "We invested in their email marketing services and got some exceptional results. Thanks to it, our business is now gaining more prospects and leads weekly. We would love to hire their services again! 5 Stars!!"
  },
  {
    "date": "2020-01-06T11:48:45.015Z",
    "account_name": "Bernadette Smith",
    "url": "https://goo.gl/maps/BjDKaypcQe8S1MKRA",
    "article": "Very pleased with their service! After taking their Premium Email Marketing Package, it has been easier for us to target potential leads and turn them into clients. Thanks to that, we are gaining better revenue than ever before. Must say, very reliable service."
  },
  {
    "date": "2020-01-06T11:48:45.445Z",
    "account_name": "Jennifer van Hout",
    "url": "https://goo.gl/maps/Nk4gHvNqNq3sRLzH8",
    "article": "I am really very happy with the amazing results I have been getting after using the social media marketing services of supportservicepro.com! From the ultimate selection process to the billing process everything was done in a very systematic manner and has thus ended up with successful business promotion as well. Highly satisfied with their services!"
  },
  {
    "date": "2020-01-06T11:48:46.307Z",
    "account_name": "Lisa Miller",
    "url": "https://goo.gl/maps/Wz6gixCxq8Hufefz6",
    "article": "We took their guidance for enhancing our google search engine strategies and creating a custom video sales script for our business. Their experts have been a great help for us, and with their coaching calls, we have learned a lot about our marketing needs. Also, the sales video script they have created is working great for our company. Highly appreciated!"
  },
  {
    "date": "2020-02-05T11:48:46.876Z",
    "account_name": "Joshua Oldaker",
    "url": "https://goo.gl/maps/FK9cvSWStS6EPLo56",
    "article": "We have taken their consultancy to improve our marketing strategies. It hasn't been a few months since we have acquired their services and our website is getting better visibility across all search engines. We are very thankful to them!"
  },
  {
    "date": "2019-12-07T11:48:47.370Z",
    "account_name": "Kevin Dyer",
    "url": "https://goo.gl/maps/nkJvajW4PJBxsNx17",
    "article": "Support Service Pro is the best if you are looking for a great email marketing services. They offer everything which you will need to create a good email, monitor the results, target your audience, and boost your sales. I would love to recommend them to everyone!"
  },
  {
    "date": "2020-02-05T11:48:48.094Z",
    "account_name": "Christopher Harris",
    "url": "https://goo.gl/maps/yVjHkVYrLZFLRQt17",
    "article": "I just want to say thank you for fulfilling my dreams to have a successful business that I can call my own. I can’t do this without your help. Great job to the whole team!"
  }
]