[
  {
    "date": "2020-02-28T11:48:13.728Z",
    "account_name": "Alison Newman",
    "url": "https://goo.gl/maps/34SjT3HuZVqDKe2GA",
    "article": "Very responsive customer support team. Unlike other providers I encountered before, Top Coach Consulting’s services are client-friendly. They have excellent time management and communication skills. Outputs are high-quality! Worthy of time and money!"
  },
  {
    "date": "2020-01-06T11:48:14.430Z",
    "account_name": "Lily Ogden",
    "url": "https://goo.gl/maps/rhFVEx46GF6eBP9F9",
    "article": "I’m blessed with having found Top Coaching Consulting just before commencing my online business. Their sales letter creation package is outstanding. Most of the recurring deals are closed because of your effort guys. 5 Stars!!"
  },
  {
    "date": "2020-02-05T11:48:14.910Z",
    "account_name": "Ervin Holmes",
    "url": "https://goo.gl/maps/WKHy8bezF8dS8Lqc7",
    "article": "Very responsive customer support team. Unlike other providers I encountered before, Top Coach Consulting’s services are client-friendly. They have excellent time management and communication skills. Outputs are high-quality! Worthy of time and money!"
  },
  {
    "date": "2020-01-06T11:48:15.309Z",
    "account_name": "Lily Ogden",
    "url": "https://goo.gl/maps/rhFVEx46GF6eBP9F9",
    "article": "I’m blessed with having found Top Coaching Consulting just before commencing my online business. Their sales letter creation package is outstanding. Most of the recurring deals are closed because of your effort guys. 5 Stars!!"
  },
  {
    "date": "2020-02-05T11:48:15.399Z",
    "account_name": "Heather Jensen",
    "url": "https://goo.gl/maps/PuH7AT8JeUWXebZC7",
    "article": "Thank you, Top Coach Consulting, for your excellent marketing release package. The amount of professionalism you guys have shown is just commendable. You guys took care of everything, from the creation of strategy down to release, and the follow-up process. Highly satisfied with your service. Thank you."
  },
  {
    "date": "2020-02-05T11:48:15.857Z",
    "account_name": "Ervin Holmes",
    "url": "https://goo.gl/maps/WKHy8bezF8dS8Lqc7",
    "article": "Their customer support team is very responsive in answering my questions. They also recommended services that are fit for my business’s needs. So far, I am satisfied with their services! Highly recommendable."
  },
  {
    "date": "2020-02-21T11:48:15.954Z",
    "account_name": "Edward Edmunds",
    "url": "https://goo.gl/maps/3TF1n87CiJfa7JkZA",
    "article": "I must say, these people were highly efficient in creating the best content marketing strategy for my business. I have never faced any kind of issue working with them, and my ROI has even improved significantly. Highly recommended!"
  },
  {
    "date": "2020-01-06T11:48:16.382Z",
    "account_name": "Oliver Wallace",
    "url": "https://goo.gl/maps/2V3mEs5R1uXsTonY7",
    "article": "After successfully working with them for over one year, I can now implement their strategies blindly. Till now, I have experienced amazing results. Would love to continue with their services further. Thanks a lot!!"
  },
  {
    "date": "2020-02-05T11:48:16.809Z",
    "account_name": "Billy Perez",
    "url": "https://goo.gl/maps/QhYsVSho3BrozDAw9",
    "article": "I met professional coaches at Top Coach Consulting. They have skillfully guided my entire team regarding the creation of engaging content. Since we don't have enough time to research and develop content, their ‘ultimate content marketing package’ was thoroughly helpful. 5 stars to their professionalism!!"
  },
  {
    "date": "2020-01-06T11:48:17.255Z",
    "account_name": "Maik Barth",
    "url": "https://goo.gl/maps/oSbecbWAtctbJyxK7",
    "article": "We have been working with another marketing provider for years but noticed a sudden dramatic drop for our business, especially when the economy took a nosedive. We found out that our current provider hadn't kept pace with the economic changes and that we were paying the said company without any remarkable change in our approach to marketing. We quit working with them and did our thorough research on other marketing companies and stumbled upon Top Coach Consulting. The team took a leap and took the time to review our business and they have carefully planned our marketing strategy. Fast forward today, this company has saved us from the economic depression. We're really grateful to this company. Keep it up!"
  },
  {
    "date": "2020-02-05T11:48:17.676Z",
    "account_name": "Franklin Bowles",
    "url": "https://goo.gl/maps/1JtDy9tjkture63S7",
    "article": "After retiring from my office-based job, I was so anxious about what to do next. Fortunately, a friend who has an online business now shared about top coach consulting. I tried their online business coaching first since I was not confident about things related to technology. In just a few months, I decided to put up my own online store. So, I also availed of their Platinum Marketing Release package to have a good start. Now, I do not regret trusting them since it has been barely a year, and I am earning four times what I initially expected to have. Kudos to all the coaches and to their very hardworking customer support team!"
  },
  {
    "date": "2020-02-14T11:48:18.064Z",
    "account_name": "Oliver Black",
    "url": "https://goo.gl/maps/dKEssoRAgxcAtGy28",
    "article": "Top Coach Consulting’s services empowered me to become an independent and skilled entrepreneur. I availed of their influencer marketing strategy package. They helped me step by step and made me learn a lot about managing and marketing my business. Highly recommended!"
  },
  {
    "date": "2020-01-06T11:48:18.475Z",
    "account_name": "Deborah Thompson",
    "url": "https://goo.gl/maps/rP7EP8sU1BEVTuA6A",
    "article": "Love their website. Nice clean interface. Responsive customer support.And a good variety of services. Unfortunately, some services like blog writing and social media management are not available individually but are packaged with other services. That’s based on their service page. I haven’t tried asking if I could get those as stand-alone services though. Otherwise, Topcoachconsulting is a good marketingagency."
  },
  {
    "date": "2020-02-14T11:48:18.947Z",
    "account_name": "Paul Flanagan",
    "url": "https://goo.gl/maps/oqWDVSMwgoFmLPh1A",
    "article": "When our grandfather was still around to run our business, he knew that word-of-mouth is the best promotional channel for a business. He even had an ingenious way of taking full-advantage of it. He gave discounts for those who came as referrals of previous customers and customers who have successfully referred others get a portion of the sales on their next purchase. This was way before pyramiding network scheme was even a thing. Now that the business is with us, the third generation, we’re taken the word-of-mouth model to the age of social media. We’re employing an influencer marketing strategy, something we’re now just learning in detail from a course from TopCoachConsulting.com. The course is real eye-opener on the unlimited potential of this type of marketing and I highly recommend it to anyone who wants to get ahead of the online marketing game."
  },
  {
    "date": "2020-01-06T11:48:19.366Z",
    "account_name": "Audrey Watson",
    "url": "https://goo.gl/maps/xiYspNbVZC8Es3EC9",
    "article": "I want to thank Top Coaching Consulting for creating those amazing sales letters for my company. They really helped our business to gain more conversions. I am really impressed by their service and would recommend them to others too!"
  },
  {
    "date": "2019-11-07T11:48:19.765Z",
    "account_name": "William Douglass",
    "url": "https://goo.gl/maps/YQywAoFJnLuHywAB6",
    "article": "No. 1 coaching company online! I have tried others who only overpromise, but never deliver results. TopCoachConsulting is the best!"
  },
  {
    "date": "2020-01-06T11:48:20.160Z",
    "account_name": "Dylan Sanderson",
    "url": "https://goo.gl/maps/5TNPxML5hTcbmhuM9",
    "article": "I would like to thank the Top Coaching Consulting team for their great efforts in our content marketing campaign. With their support, we have been able to pull out more engagement on our business website. Excellent service."
  },
  {
    "date": "2020-02-21T11:48:20.639Z",
    "account_name": "John Langdon",
    "url": "https://goo.gl/maps/r2rBfJeLEuuF743G7",
    "article": "I was skeptical about influencer marketing before. Honestly, I did not believe that it can make any difference at all, but Top Coach Consulting proved me wrong! I availed of their influencer marketing strategy package since a reliable consultant recommended them to me when I was asking for ways to improve my business performance. I also spoke with many of their coaches, and I learned a lot from them! Five stars! Top-notch!"
  },
  {
    "date": "2019-11-07T11:48:21.047Z",
    "account_name": "Jeffrey D Thomas",
    "url": "https://goo.gl/maps/5ajSPczePnZwmYNk9",
    "article": "I recently acquired the services of Top Coach Consulting to promote my business websites on social media. The content marketing consultation and social media campaigns that they devised for my site are working great. In just 3 weeks it has got me the engagement that I couldn’t in 6 months. I am really impressed with their services and would recommend them to others too."
  },
  {
    "date": "2019-12-07T11:48:21.527Z",
    "account_name": "Eric Galiano",
    "url": "https://goo.gl/maps/7bNPqu16LSuCUWkq8",
    "article": "After learning and implementing various influencer marketing strategies from top coach consulting, I have successfully been able to gain more customers for my business. This was one of my greatest investments. Couldn't be more thankful!"
  },
  {
    "date": "2019-10-08T11:48:21.912Z",
    "account_name": "Mark Brad",
    "url": "https://goo.gl/maps/aN7xwMP9ecfZWxD78",
    "article": "I purchased the marketing release package from this site and the results are beyond my expectations. The press releases have worked effectively for my business and I am getting ample traffic on my business website. Good job! I’m impressed."
  },
  {
    "date": "2019-12-07T11:48:22.312Z",
    "account_name": "Steven Brown",
    "url": "https://goo.gl/maps/TKUNgQeS8JThB24e8",
    "article": "After failing in a number of business ventures, it has been difficult to muster the courage to go back into business again. Failure really takes its toll. It’s a good thing that I’m taking executive coaching from TopCoachConsulting.com. The coaching is not about the technicalities of business, although that’s frequently touched on. It’s more about pro to pro support. It’s easy to give-up when you only have yourself to answer to, but with a partner, you can’t. That’s what I really appreciate about TopCoachConsulting.com’s executive coaching sessions."
  },
  {
    "date": "2020-02-05T11:48:22.742Z",
    "account_name": "Sebastián Dávalos",
    "url": "https://goo.gl/maps/bBQaFcjLY7kC5zTa8",
    "article": "These people have been instrumental in helping us build an incredible content marketing strategy for our money site. With the guidance of Top Coach Consulting, I have seen a good increase in lead flow and ROI. 5 stars!!"
  },
  {
    "date": "2019-11-07T11:48:23.146Z",
    "account_name": "Jean Rubalcaba",
    "url": "https://goo.gl/maps/QsGqJfEuqrzHe75j9",
    "article": "Good job guys!! Your blog posts have helped me gain a lot of traffic on my website. Also, the consultation  that you guys gave me has helped me to understand and implement SEO better. Amazing content marketing service!"
  },
  {
    "date": "2020-02-05T11:48:23.581Z",
    "account_name": "Eldon Russell",
    "url": "https://goo.gl/maps/bMDfmoBAdw6tgcBE7",
    "article": "The sales letter created by them for our company is working well on increasing traffic to our website. Also, they were devised according to our needs and liking which helped us a lot. I would hire them again whenever needed!"
  },
  {
    "date": "2019-11-07T11:48:24.065Z",
    "account_name": "Guy Henry",
    "url": "https://goo.gl/maps/xP7tnz3jdKMhom5q9",
    "article": "I highly recommend these people to everyone for their digital marketing services. Extremely cooperative staff, high yielding marketing strategies, best execution and satisfactory results!"
  }
]