[
  {
    "date": "2020-02-28T15:51:08.309Z",
    "account_name": "Alison Newman",
    "url": "https://goo.gl/maps/QCWRWMdTNXgT62gB6",
    "article": "Very responsive customer support team. Unlike other providers I encountered before, Top Coach Consulting’s services are client-friendly. They have excellent time management and communication skills. Outputs are high-quality! Worthy of time and money!"
  },
  {
    "date": "2020-01-06T15:51:09.347Z",
    "account_name": "Lily Ogden",
    "url": "https://goo.gl/maps/shMvdwqt1o7eA3df7",
    "article": "I’m blessed with having found Top Coaching Consulting just before commencing my online business. Their sales letter creation package is outstanding. Most of the recurring deals are closed because of your effort guys. 5 Stars!!"
  },
  {
    "date": "2020-02-05T15:51:10.001Z",
    "account_name": "Heather Jensen",
    "url": "https://goo.gl/maps/G4AaXJQB7wzQjeGc6",
    "article": "Thank you, Top Coach Consulting, for your excellent marketing release package. The amount of professionalism you guys have shown is just commendable. You guys took care of everything, from the creation of strategy down to release, and the follow-up process. Highly satisfied with your service. Thank you."
  },
  {
    "date": "2020-02-05T15:51:10.616Z",
    "account_name": "Ervin Holmes",
    "url": "https://goo.gl/maps/TtZCQBM5ouvFeQ9r6",
    "article": "Their customer support team is very responsive in answering my questions. They also recommended services that are fit for my business’s needs. So far, I am satisfied with their services! Highly recommendable."
  },
  {
    "date": "2020-02-21T15:51:11.305Z",
    "account_name": "Edward Edmunds",
    "url": "https://goo.gl/maps/jfhE81D72ymNkEJGA",
    "article": "The quality of services by Top Coach Consulting has exceeded our high expectations and continues to do so. We have strengthened our position in the market with the help of this company. Great work!"
  },
  {
    "date": "2020-01-06T15:51:11.903Z",
    "account_name": "Brian Bennett",
    "url": "https://goo.gl/maps/LPJE5eqgoQr2eWUF8",
    "article": "I must say, these people were highly efficient in creating the best content marketing strategy for my business. I have never faced any kind of issue working with them, and my ROI has even improved significantly. Highly recommended!"
  },
  {
    "date": "2020-01-06T15:51:12.501Z",
    "account_name": "Oliver Wallace",
    "url": "https://goo.gl/maps/ELH4Tj1DjKSsag5m6",
    "article": "After successfully working with them for over one year, I can now implement their strategies blindly. Till now, I have experienced amazing results. Would love to continue with their services further. Thanks a lot!!"
  },
  {
    "date": "2020-02-05T15:51:13.067Z",
    "account_name": "Jim Almond",
    "url": "https://goo.gl/maps/WKVN2jh7tYvJRLRZ9",
    "article": "I couldn’t be more pleased with the valuable online sessions from Top Coach Consulting. In just six months, our team has created new business campaigns that have boosted our ROI substantially. Great job!!"
  },
  {
    "date": "2020-02-05T15:51:13.620Z",
    "account_name": "Billy Perez",
    "url": "https://goo.gl/maps/br5XUBURktYEd11v5",
    "article": "I met professional coaches at Top Coach Consulting. They have skillfully guided my entire team regarding the creation of engaging content. Since we don't have enough time to research and develop content, their ‘ultimate content marketing package’ was thoroughly helpful. 5 stars to their professionalism!!"
  },
  {
    "date": "2020-01-06T15:51:14.139Z",
    "account_name": "Maik Barth",
    "url": "https://goo.gl/maps/6Tuh2jBsJmfbw6vp7",
    "article": "Top Coach Consulting has been really very effective in increasing our online visibility and generating more leads with their sales letters. They’re our best marketing partners yet! Recommended!!"
  },
  {
    "date": "2020-02-21T15:51:14.602Z",
    "account_name": "Justin Thomson",
    "url": "https://goo.gl/maps/pzZcAXUYA651G7Tu7",
    "article": "We have been working with another marketing provider for years but noticed a sudden dramatic drop for our business, especially when the economy took a nosedive. We found out that our current provider hadn't kept pace with the economic changes and that we were paying the said company without any remarkable change in our approach to marketing. We quit working with them and did our thorough research on other marketing companies and stumbled upon Top Coach Consulting. The team took a leap and took the time to review our business and they have carefully planned our marketing strategy. Fast forward today, this company has saved us from the economic depression. We're really grateful to this company. Keep it up!"
  },
  {
    "date": "2020-02-05T15:51:15.180Z",
    "account_name": "Franklin Bowles",
    "url": "https://goo.gl/maps/ddBbqrgd8UcBQ7Au6",
    "article": "After retiring from my office-based job, I was so anxious about what to do next. Fortunately, a friend who has an online business now shared about top coach consulting. I tried their online business coaching first since I was not confident about things related to technology. In just a few months, I decided to put up my own online store. So, I also availed of their Platinum Marketing Release package to have a good start. Now, I do not regret trusting them since it has been barely a year, and I am earning four times what I initially expected to have. Kudos to all the coaches and to their very hardworking customer support team!"
  },
  {
    "date": "2020-02-14T15:51:15.839Z",
    "account_name": "Oliver Black",
    "url": "https://goo.gl/maps/om8zCNbMoXF3ZbaMA",
    "article": "I know how ironic this will sound but in the age of fake news and the not-so subtle manipulation of opinion by the general mass media, even obscure reviews like this can appear disingenuous. But what are you gonna do, right? I want to write my piece and I’m gonna tell it how it is, take it or leave it. TopCoachConsulting is a fine company, run by tremendous people, and they provide THE BEST marketing services since sliced bread was first advertised. Or maybe not. You’ll be the judge. All I can give you is this recommendation based on my personal experience with working with them. They’re good. (No really, they’re good.)"
  },
  {
    "date": "2020-02-29T15:51:16.499Z",
    "account_name": "Gilles Perrault",
    "url": "https://goo.gl/maps/iF5g2K5KEsUyJGVE6",
    "article": "Top Coach Consulting’s services empowered me to become an independent and skilled entrepreneur. I availed of their influencer marketing strategy package. They helped me step by step and made me learn a lot about managing and marketing my business. Highly recommended!"
  },
  {
    "date": "2019-12-07T15:51:17.018Z",
    "account_name": "Deborah Thompson",
    "url": "https://goo.gl/maps/tCHgJiYumancnzwv6",
    "article": "These people are the most professional of all social media consulting companies I hired in the past. They have single-handedly improved engagement on our website. I received quick yet top-notch customer services from them. I’m confident to avail their ‘Sales Letter Creation’ product this time. Great job team!!"
  },
  {
    "date": "2020-02-05T15:51:17.552Z",
    "account_name": "Eddie Alexander",
    "url": "https://goo.gl/maps/6R4DFSmP8T5nb6oT7",
    "article": "Love their website. Nice clean interface. Responsive customer support.And a good variety of services. Unfortunately, some services like blog writing and social media management are not available individually but are packaged with other services. That’s based on their service page. I haven’t tried asking if I could get those as stand-alone services though. Otherwise, Topcoachconsulting is a good marketingagency."
  },
  {
    "date": "2020-02-14T15:51:17.970Z",
    "account_name": "Paul Flanagan",
    "url": "https://goo.gl/maps/9ZYFKoBaYk8hsAjy7",
    "article": "Top Coach Consulting has helped turn our SEO around and we have seen excellent results since then. I have really been satisfied with the quality of their work so I am recommending this to everyone who requires excellent marketing strategies."
  },
  {
    "date": "2020-02-07T15:51:18.534Z",
    "account_name": "Alan Lewis",
    "url": "https://goo.gl/maps/yYaPLQ4y92gLjay5A",
    "article": "When our grandfather was still around to run our business, he knew that word-of-mouth is the best promotional channel for a business. He even had an ingenious way of taking full-advantage of it. He gave discounts for those who came as referrals of previous customers and customers who have successfully referred others get a portion of the sales on their next purchase. This was way before pyramiding network scheme was even a thing. Now that the business is with us, the third generation, we’re taken the word-of-mouth model to the age of social media. We’re employing an influencer marketing strategy, something we’re now just learning in detail from a course from TopCoachConsulting.com. The course is real eye-opener on the unlimited potential of this type of marketing and I highly recommend it to anyone who wants to get ahead of the online marketing game."
  },
  {
    "date": "2020-01-06T15:51:19.089Z",
    "account_name": "Audrey Watson",
    "url": "https://goo.gl/maps/b6zeY6L2pg5qJttc7",
    "article": "Thanks to them, we got a great boost to our site reach. Their influencer marketing strategy really did the magic, thanks to that we are gaining more conversions on our business. Would highly recommend their excellent service."
  },
  {
    "date": "2019-12-07T15:51:19.765Z",
    "account_name": "Sandy Vest",
    "url": "https://goo.gl/maps/SYLpHzC4gBx91rSw9",
    "article": "I want to thank Top Coaching Consulting for creating those amazing sales letters for my company. They really helped our business to gain more conversions. I am really impressed by their service and would recommend them to others too!"
  },
  {
    "date": "2019-11-07T15:51:20.288Z",
    "account_name": "William Douglass",
    "url": "https://goo.gl/maps/RCdWaPs95EGfv7zv6",
    "article": "The best quality of Top Coach Consulting is that they follow through the things that they say they are going to. I can always count on these people for various marketing purposes, and they never fail to deliver their best. Excellent work!!"
  },
  {
    "date": "2020-02-28T15:51:20.800Z",
    "account_name": "Holley Anderson",
    "url": "https://goo.gl/maps/Mp27cXJx8vGw6qB37",
    "article": "No. 1 coaching company online! I have tried others who only overpromise, but never deliver results. TopCoachConsulting is the best!"
  },
  {
    "date": "2020-01-06T15:51:21.363Z",
    "account_name": "Dylan Sanderson",
    "url": "https://goo.gl/maps/TKtq2Sw2YDm9RR7x9",
    "article": "I bet you can’t get the fabulous social media promotion bene that these people provide, that too at such an affordable price. Their products were effective enough to raise my business’s ROI significantly. Keep going, guys!!"
  },
  {
    "date": "2019-12-07T15:51:21.835Z",
    "account_name": "Michael Siegrist",
    "url": "https://goo.gl/maps/oKqPyfUqHN38mDem9",
    "article": "I would like to thank the Top Coaching Consulting team for their great efforts in our content marketing campaign. With their support, we have been able to pull out more engagement on our business website. Excellent service."
  },
  {
    "date": "2020-02-21T15:51:22.336Z",
    "account_name": "John Langdon",
    "url": "https://goo.gl/maps/7m6CLazKWgF2eYnr8",
    "article": "I was skeptical about influencer marketing before. Honestly, I did not believe that it can make any difference at all, but Top Coach Consulting proved me wrong! I availed of their influencer marketing strategy package since a reliable consultant recommended them to me when I was asking for ways to improve my business performance. I also spoke with many of their coaches, and I learned a lot from them! Five stars! Top-notch!"
  },
  {
    "date": "2019-11-07T15:51:22.817Z",
    "account_name": "Jeffrey D Thomas",
    "url": "https://goo.gl/maps/GKpYrAocJmoo7fLt7",
    "article": "This website is just exceptional! They have helped me improve my marketing strategies a lot, and I can see a remarkable increase in the sales rate of my business site with the help of their content marketing packages. Great service!"
  },
  {
    "date": "2019-12-07T15:51:23.338Z",
    "account_name": "Natalie Oliver",
    "url": "https://goo.gl/maps/KMMukgPXqJvGmnXQ8",
    "article": "I recently acquired the services of Top Coach Consulting to promote my business websites on social media. The content marketing consultation and social media campaigns that they devised for my site are working great. In just 3 weeks it has got me the engagement that I couldn’t in 6 months. I am really impressed with their services and would recommend them to others too."
  },
  {
    "date": "2019-12-07T15:51:24.037Z",
    "account_name": "Eric Galiano",
    "url": "https://goo.gl/maps/VyhGGQkxioSAy1Nn8",
    "article": "After learning and implementing various influencer marketing strategies from top coach consulting, I have successfully been able to gain more customers for my business. This was one of my greatest investments. Couldn't be more thankful!"
  },
  {
    "date": "2019-10-08T15:51:24.602Z",
    "account_name": "Mark Brad",
    "url": "https://goo.gl/maps/sGWajV2ELGX4KF9R8",
    "article": "I purchased the marketing release package from this site and the results are beyond my expectations. The press releases have worked effectively for my business and I am getting ample traffic on my business website. Good job! I’m impressed."
  },
  {
    "date": "2019-12-07T15:51:25.055Z",
    "account_name": "Steven Brown",
    "url": "https://goo.gl/maps/9NzjhcfUxo5tc3oJA",
    "article": "They have exceeded our expectations! With their content marketing, our website visibility on the search engine has improved, and we are getting more engagement as well. I would never hesitate to hire them for our marketing needs in the future."
  },
  {
    "date": "2020-02-05T15:51:25.916Z",
    "account_name": "Arthur Mercado",
    "url": "https://goo.gl/maps/VRB17ev2pX89y5Py7",
    "article": "After failing in a number of business ventures, it has been difficult to muster the courage to go back into business again. Failure really takes its toll. It’s a good thing that I’m taking executive coaching from TopCoachConsulting.com. The coaching is not about the technicalities of business, although that’s frequently touched on. It’s more about pro to pro support. It’s easy to give-up when you only have yourself to answer to, but with a partner, you can’t. That’s what I really appreciate about TopCoachConsulting.com’s executive coaching sessions."
  },
  {
    "date": "2020-02-05T15:51:26.553Z",
    "account_name": "Sebastián Dávalos",
    "url": "https://goo.gl/maps/A9Bq27tVcXJ62VuW7",
    "article": "Topcoachconsulting did wonders promoting our antique restoration business on social media. Our page now has 42,000 followers and our restoration videos (initially produced by Topcoachconsulting) also get that many views."
  },
  {
    "date": "2019-11-07T15:51:27.280Z",
    "account_name": "Scott Brown",
    "url": "https://goo.gl/maps/N1NchARW866QAHCY6",
    "article": "These people have been instrumental in helping us build an incredible content marketing strategy for our money site. With the guidance of Top Coach Consulting, I have seen a good increase in lead flow and ROI. 5 stars!!"
  },
  {
    "date": "2019-11-07T15:51:28.298Z",
    "account_name": "Jean Rubalcaba",
    "url": "https://goo.gl/maps/Aevcar3P2FUM12Hj7",
    "article": "Top Coach Consulting is a company!! Their digital marketing expertise and knowledge are second to none. Thanks to them my website traffic has grown significantly in just a month."
  },
  {
    "date": "2019-11-07T15:51:29.000Z",
    "account_name": "John Myers",
    "url": "https://goo.gl/maps/bmKzhAcLSjEzzbtK9",
    "article": "Good job guys!! Your blog posts have helped me gain a lot of traffic on my website. Also, the consultation  that you guys gave me has helped me to understand and implement SEO better. Amazing content marketing service!"
  },
  {
    "date": "2020-02-05T15:51:29.802Z",
    "account_name": "Eldon Russell",
    "url": "https://goo.gl/maps/Lw61kS5z8APtgv8A8",
    "article": "Very reasonable prices for such superb services!"
  },
  {
    "date": "2019-11-07T15:51:30.701Z",
    "account_name": "Russell J. Morales",
    "url": "https://goo.gl/maps/chDxkp74AwLafJYt9",
    "article": "The sales letter created by them for our company is working well on increasing traffic to our website. Also, they were devised according to our needs and liking which helped us a lot. I would hire them again whenever needed!"
  },
  {
    "date": "2019-11-07T15:51:33.683Z",
    "account_name": "Guy Henry",
    "url": "https://goo.gl/maps/WQq7VVHSrAmXLHVi9",
    "article": "I highly recommend these people to everyone for their digital marketing services. Extremely cooperative staff, high yielding marketing strategies, best execution and satisfactory results!"
  }
]