[
  {
    "date": 1583479430000,
    "account_name": "William Lujan",
    "url": "https://www.facebook.com/william.lujan.58367/posts/111434707132275",
    "article": "Great services. Five stars. Their staff is easy to work with. One thing I really appreciate about them is their sensitivity to deadlines. I have worked with other providers before, and it did not work out so well, but top coach consulting is different. They stand out among other providers. Keep doing great!",
    "replies": ""
  },
  {
    "date": 1582361177000,
    "account_name": "Benjamin Crenshaw",
    "url": "https://www.facebook.com/benjamin.crenshaw.58/posts/111348223789697",
    "article": "I appreciate that they always comply with the deadlines. I could not believe it at first, but they created a sales letter for my business. They were able to complete it in just a few days. It helped me widen my customer base! Highly recommended!",
    "replies": ""
  },
  {
    "date": 1582618273000,
    "account_name": "Jerry Armor",
    "url": "https://www.facebook.com/jerry.armor.52/posts/111675360427819",
    "article": "Content marketing package is superb! It evidently helped me improve my online customer base. As compared to other providers too, Top Coach Consulting’s packages are relatively much affordable. Trustworthy company!",
    "replies": ""
  },
  {
    "date": 1582798056000,
    "account_name": "Robert Sanders",
    "url": "https://www.facebook.com/robert.sanders.71697092/posts/102411758034901",
    "article": "Five stars. Excellent services, responsive customer support team, reasonable prices, and quality press releases!",
    "replies": ""
  },
  {
    "date": 1581753474000,
    "account_name": "Dan Mills",
    "url": "https://www.facebook.com/dan.mills.39948/posts/109504593965199",
    "article": "Thank you for going the extra mile for our business to gain an extra competitive advantage. I am highly recommending Top Coach Consulting for its excellent services!",
    "replies": ""
  },
  {
    "date": 1578298505000,
    "account_name": "Veronica Cline",
    "url": "https://www.facebook.com/veronica.cline.5458/posts/110799110443642",
    "article": "Their influencer marketing strategy has really worked great for me! The professionals helped me devise and understand marketing strategy that will work for my business. It has been 3 months and my ROI has been increased substantially.",
    "replies": ""
  },
  {
    "date": 1580725092000,
    "account_name": "Jessica Chapman",
    "url": "https://www.facebook.com/jessica.chapman.9277583/posts/106589574239336",
    "article": "I was quite troubled because of the falling SERP of my website, so I decided to invest in Top Coach Consulting's content marketing package. Their experts helped me to understand the real problem and now with their consultation and marketing support, my website has regained a top spot on Google. Thank you.",
    "replies": ""
  },
  {
    "date": 1581138993000,
    "account_name": "Frank Herrera",
    "url": "https://www.facebook.com/permalink.php?story_fbid=106421804266033&id=100046946413865",
    "article": "We run a small scale fuel refining production that uses corn-derived ethanol mixed into bulk base fuels from national refineries. Our target market is local. Very local and very specific. We’re talking diesel farm generators and old tractors. You’d think that we’re so niche that Google will have us as top result for a search string like “where to buy cheap low grade ethanol fuel for old diesel gen set near Beaconsville, Iowa. You've got to wrestle a bit with the algorithm to make it work in your favor. It’s a good thing that we got content marketing and SEO services from Top Coach Consulting. Since then, our website has been a first page recommendation for people searching our kind of product.",
    "replies": ""
  },
  {
    "date": 1579175399000,
    "account_name": "Christopher Neill",
    "url": "https://www.facebook.com/christopher.neill.5059/posts/106090714267195",
    "article": "Their coaches are dependable and accommodating. At first, I had too many questions since I did not know anything about digital marketing. Fortunately, they can explain and answer all the questions I had about it. Now, I get to apply these strategies in my business. It has been experiencing growth for the past few months now. I am planning to try their Influencer Marketing Strategy soon. All in all, indeed, five-star service from TopCoachConsulting!",
    "replies": ""
  },
  {
    "date": 1576910089000,
    "account_name": "Lonnie Fulford",
    "url": "https://www.facebook.com/lonnie.fulford.77/posts/106683470839049",
    "article": "Highly impressed with the amount of traffic I have been getting on my site after these people carried out the marketing release campaign for my business. I have seen an excellent increase in my sales rate and ROI. I would recommend their exceptional service to each and everyone out there! Thumbs up!",
    "replies": ""
  },
  {
    "date": 1578637467000,
    "account_name": "Jessie Mason",
    "url": "https://www.facebook.com/jessie.mason.9828/posts/110259373837102",
    "article": "Top Coaching Consulting team is exceptional!! They did wonders for my business campaigns and boosted its organic growth. As a result, I have experienced substantial growth with a huge gathering of new audiences. Would remain to enjoy your perks!!",
    "replies": ""
  },
  {
    "date": 1575540386000,
    "account_name": "Sosefina Tunufai",
    "url": "https://www.facebook.com/sosefina.tunufai.16752/posts/116299279842802",
    "article": "This website has been very helpful in making me understand about Influencer Marketing Strategy, and their campaign has really taught me a great many things on this subject thanks to which I was able to move forward in my business. Would definitely recommend Top Coach Consulting to each and everyone out there!",
    "replies": ""
  },
  {
    "date": 1575016082000,
    "account_name": "Mark Cassidy",
    "url": "https://www.facebook.com/mark.cassidy.399826/posts/106369254176601",
    "article": "We purchased their ultimate content marketing package to boost the SEO and visibility of our website. The marketing tactics and strategies that they implemented has worked and my site is now on the first page. Very impressed with their professional service. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1580366830000,
    "account_name": "Dustin Ontiveros",
    "url": "https://www.facebook.com/dustin.ontiveros.1/posts/105141794382993",
    "article": "What they promised to do, they do. What they plan to deliver, they deliver. I’m totally happy with TopCoachConsulting’s services. I will get them again in the future.",
    "replies": ""
  },
  {
    "date": 1575695671000,
    "account_name": "Alan Herring",
    "url": "https://www.facebook.com/alan.herring.161/posts/105206997636325",
    "article": "Top Coach Consulting has brought us a huge improvement in our marketing strategies. With their great efforts, we have been gaining more engagement on our business website, and it's ranking on the search engine has also increased. We are very thankful for your exceptional service.",
    "replies": ""
  },
  {
    "date": 1573283756000,
    "account_name": "Kaitlyn Macnaghten",
    "url": "https://www.facebook.com/kaitlyn.macnagten/posts/2514915078792522",
    "article": "Their services are truly fantastic! Recently we have purchased their content marketing package and in just a few weeks we have started seeing the results. Thanks to them our website is gaining better engagement. Excellent people to work with, for sure.",
    "replies": ""
  },
  {
    "date": 1581578345000,
    "account_name": "Wendell Howard",
    "url": "https://www.facebook.com/wendell.howard.908/posts/101644381425663",
    "article": "Very professional and knowledgeable business coaches.",
    "replies": ""
  },
  {
    "date": 1573024057000,
    "account_name": "Amber Schaw",
    "url": "https://www.facebook.com/permalink.php?story_fbid=2589782734588192&id=100006694726575",
    "article": "These people have been a great help for me for marketing my business site. Their content marketing strategies have been very efficient, and I have successfully gained more customers. There is a visible increase in sales too. 5 stars!!",
    "replies": ""
  },
  {
    "date": 1578393819000,
    "account_name": "Jack Rosa",
    "url": "https://www.facebook.com/jack.rosa.7737769/posts/104130257787223",
    "article": "Super satisfied and impressed with their work!!",
    "replies": ""
  },
  {
    "date": 1575291760000,
    "account_name": "Ardath Bruno",
    "url": "https://www.facebook.com/ardath.bruno.9/posts/111899420287615",
    "article": "I’m glad I started working with these people, not only has my website ranked significantly higher, but my site engagements have improved a lot as well. Their content marketing strategies have worked the best for my business, and I am getting more leads than ever. 5 stars, all the way!!",
    "replies": ""
  },
  {
    "date": 1583316399000,
    "account_name": "Gregory Evans",
    "url": "https://www.facebook.com/gregory.evans.52831/posts/101858918101154",
    "article": "The press releases they created for my company largely increased our customer base. We were able to forge partnerships and sponsorships because of these PRs. Many also reached out to collaborate and create new products. Nothing bad to say about TopCoachConsulting.com. They are literally one of the main reasons why my online business is now flourishing.",
    "replies": ""
  },
  {
    "date": 1571644683000,
    "account_name": "Keira Ham",
    "url": "https://www.facebook.com/Keira.1swt/posts/2380444748909640",
    "article": "The sales letter that they created for my company is working great. It has managed to drive huge numbers of leads and traffic into my business site. I am very impressed with their services!",
    "replies": ""
  },
  {
    "date": 1572433686000,
    "account_name": "Amparo J. Mason",
    "url": "https://www.facebook.com/amparo.j.mason/posts/2332077910374680",
    "article": "These people have made a huge difference in our sales rate with their amazing content marketing strategy. We are able to optimize our content better now, and our website ranking is better than ever! Thank you Top Coach Consulting for this exceptional service.",
    "replies": ""
  },
  {
    "date": 1573650614000,
    "account_name": "Sandra Boykin",
    "url": "https://www.facebook.com/sandra.boykin.376695/posts/151643619396523",
    "article": "Top Coach Consulting's keyword analysis, SEO review and blog posts have helped me a great deal in optimizing my website accordingly, and I have successfully created a good brand impression online. Couldn't be more thankful for the excellent results. 5 stars!!",
    "replies": ""
  },
  {
    "date": 1572861449000,
    "account_name": "Margaret M. Purvis",
    "url": "https://www.facebook.com/margaretpuvis07/posts/1414999688653020",
    "article": "Thank you Top Coach Consulting for the press release. You guys have successfully driven a lot of traffic into my money site, and I am gaining more leads than ever! Will recommend your amazing service to every business. Excellent work!",
    "replies": ""
  },
  {
    "date": 1571305944000,
    "account_name": "Antonis Leutrikas",
    "url": "https://www.facebook.com/Antonis.Leutrikas0/posts/1373580482790473",
    "article": "The content marketing package I purchased from them is working great for me. Their consultation was very helpful, and I learned great things from them. The email marketing and social media campaign that they devised for my website has given me some pretty good leads. Overall, I am happy with their services and would recommend to everyone!",
    "replies": ""
  },
  {
    "date": 1572416116000,
    "account_name": "Cornelius Cooper",
    "url": "https://www.facebook.com/cornelius.cooper.58/posts/2393309287576923",
    "article": "The influencer marketing coaching calls that I received from Top Coach Consulting has been extremely helpful. They have provided some great tips and insights regarding this topic which has helped me set up my company. I really appreciate their help!",
    "replies": ""
  },
  {
    "date": 1581399326000,
    "account_name": "Scott Fitzgerald",
    "url": "https://www.facebook.com/permalink.php?story_fbid=112785936959010&id=100046828133645",
    "article": "Hired Top Coach Consulting service for our influencer marketing campaign. They have got us contacts of a few influencers who are ready to work with our company. Initially, it wasn't working as we thought but after some time we started gaining more conversions on our website. Their experts have guided us to be more effective and persuasive with our influencer marketing campaign and that's why we have been able to claim more sales for our business. Would surely recommend them!",
    "replies": ""
  },
  {
    "date": 1577102268000,
    "account_name": "Denis Tang",
    "url": "https://www.facebook.com/denis.tang.351/posts/101143574737831",
    "article": "We are very happy with the services provided by Top Coach Consulting! Their Influencer Marketing Strategy is working great for our company and it has successfully driven more leads to our websites. Thumbs Up!!",
    "replies": ""
  },
  {
    "date": 1576657140000,
    "account_name": "Justin Bray",
    "url": "https://www.facebook.com/justin.bray.9638/posts/100665164779371",
    "article": "Their team is efficient in the problem-solving approach. The mentors always take time to hear my queries and suggest productive measures. Glad to receive such outstanding results!!",
    "replies": ""
  },
  {
    "date": 1580107057000,
    "account_name": "Dianna J. Gay",
    "url": "https://www.facebook.com/dianna.j.gay/posts/116641573214615",
    "article": "Last week, I purchased the content marketing package from Top Coach Consulting and I have to say, it has worked wonders for my business. It has helped me to boost my business sales and leads substantially by creating a high converting social media campaigns for our websites. I am really very satisfied with the excellent services provided by them. Highly Recommended!",
    "replies": ""
  },
  {
    "date": 1571051337000,
    "account_name": "Christos Faion",
    "url": "https://www.facebook.com/Christos.Faion0/posts/2063114753834957",
    "article": "Top Coach Consulting’s content and social media marketing team has been a huge part of our business site promotion. They’re an extremely talented group of people, who have helped me gain maximum leads. I’m happy I used their service!",
    "replies": ""
  },
  {
    "date": 1571897640000,
    "account_name": "Diana R. Sharp",
    "url": "https://www.facebook.com/dianasharp05/posts/1419727378181799",
    "article": "We invested in their content marketing package, and it really helped us to get a boost on our website. Their assistance with keyword analysis and logistics have improved the website's SEO. I am highly satisfied with their services.",
    "replies": ""
  },
  {
    "date": 1568446839000,
    "account_name": "Robena Breeland",
    "url": "https://www.facebook.com/robena.breeland/posts/2672953449415473",
    "article": "I have been using their content marketing package for quite some time and there is a great improvement in my website ranking. My sales and ROI are improving too. I cannot be more thankful!",
    "replies": ""
  },
  {
    "date": 1569051388000,
    "account_name": "Leanne Dosuza",
    "url": "https://www.facebook.com/leanne.dosuza/posts/2658936494158458",
    "article": "I hired their services to promote my business website recently. The results have been great, thanks to them I am getting more traffic and my sales have increased greatly.",
    "replies": ""
  },
  {
    "date": 1571141221000,
    "account_name": "Jan Jackson",
    "url": "https://www.facebook.com/jan.jackson.710636/posts/683179988857133",
    "article": "It has been a great experience working with Top coach consulting. We have opted for their influencer marketing package and found suitable influencers for our marketing campaign. Would like to continue doing business with this company.",
    "replies": ""
  },
  {
    "date": 1577711219000,
    "account_name": "Jeanette Smith",
    "url": "https://www.facebook.com/permalink.php?story_fbid=102087731317337&id=100045483304937",
    "article": "Their press and media package has really helped us to gain larger engagement on our website and has helped to create good prospects for our business. Looking forward to working with these people again shortly.",
    "replies": ""
  },
  {
    "date": 1568271523000,
    "account_name": "Carmen Sebers",
    "url": "https://www.facebook.com/carmen.sebers.5/posts/2399581583472227",
    "article": "I have been working with these people for producing sales letters and videos for my website. I can honestly say that these people are amazing, and I can already see traffic increasing on my page. Thank you for your services!",
    "replies": ""
  },
  {
    "date": 1568793212000,
    "account_name": "Anderson Jones",
    "url": "https://www.facebook.com/jon.pirner/posts/2355641727885812",
    "article": "Thank you for the press release. I have been getting my positive reviews for my website now and I am gaining more customers. My sales have improvised a lot. I’m highly impressed!",
    "replies": ""
  },
  {
    "date": 1569659915000,
    "account_name": "Mary Gomes",
    "url": "https://www.facebook.com/mary.gomes.12382923/posts/1184110408465764",
    "article": "Thank you Top Coach Consulting for helping me to understand the content marketing strategies. I’m now finally able to market my website and implement SEO in my posts effectively on every platform. Good job guys!",
    "replies": ""
  }
]