[
  {
    "date": 1582007542000,
    "account_name": "Richard Joseph",
    "url": "https://www.facebook.com/richardjoseph91/posts/107911977464680",
    "article": "Five stars!!! I appreciate their dedicated customer support team. They are all reliable and trustworthy people. Keep up the good work!",
    "replies": ""
  },
  {
    "date": 1583152029000,
    "account_name": "Felicia Collier",
    "url": "https://www.facebook.com/felicia.collier.520/posts/109439453997315",
    "article": "UpService.Site provides reliable and secure uptime monitoring. It is perfect for businesses like mine that heavily depend on their online platforms for generating leads and sales.",
    "replies": ""
  },
  {
    "date": 1583215544000,
    "account_name": "Derek Timbrell",
    "url": "https://www.facebook.com/derek.timbrell.50/posts/108666767408905",
    "article": "When I was just starting with my business, I availed of their basic package, which is very affordable. Now that my business has significantly grown, I switched to the platinum package. I am very happy to have stayed with them. They always improve when they need to, and they maintain all the excellent qualities of their services! Highly recommended!",
    "replies": ""
  },
  {
    "date": 1581140430000,
    "account_name": "Sherri Foreman",
    "url": "https://www.facebook.com/sherri.foreman.35/posts/108684720702734",
    "article": "Since I had a really disappointing experience in the past with a few hosting service providers. This time, I assigned the responsibility to the technical team for selecting the best. After three days of examination, they ended up at Up Service Site, and I admire their choice. Their hosting package is indeed beneficial, packed with easy-to-implement approaches. Definitely, a 5-star deserving site.",
    "replies": ""
  },
  {
    "date": 1583493459000,
    "account_name": "Ryan Redfern",
    "url": "https://www.facebook.com/ryan.redfern.14/posts/103514487935857",
    "article": "I did not know uptime monitoring services can be so important until I availed of their services. It helped me build my online business from the ground up and ensure a hassle-free online experience to my customers when they are transacting on my website.",
    "replies": ""
  },
  {
    "date": 1580108268000,
    "account_name": "Neva McDaniel",
    "url": "https://www.facebook.com/neva.mcdaniel.10/posts/113961690153115",
    "article": "My computer guy said the monitoring service was good. He’s also my husband so I just trust his opinion when it comes to all these “riveting technical stuff”.",
    "replies": ""
  },
  {
    "date": 1580293987000,
    "account_name": "Julio Shisler",
    "url": "https://www.facebook.com/julio.shisler/posts/109210930635766",
    "article": "Thank you so much, Up Service Site, for keeping me updated all the time, about my website’s performance by monitoring them in the right manner. Your monitoring services worked just great, and have helped me a lot. I would highly recommend you to each and everyone I know. Thank you!",
    "replies": ""
  },
  {
    "date": 1578308798000,
    "account_name": "Henry Hutto",
    "url": "https://www.facebook.com/henry.hutto.31/posts/108295204030789",
    "article": "I have hired a lot of website monitoring services, but have found these people to be the best! With the help of their excellent service, my websites are running smoothly, and without getting any downtime. Thumbs up!",
    "replies": ""
  },
  {
    "date": 1581407420000,
    "account_name": "Christian Morales",
    "url": "https://www.facebook.com/christian.morales.1401/posts/103443804573664",
    "article": "The Up Service Site team is the most talented and capable of pointing out even a minor error that might cause website issues at some point. I trust their services blindly whenever it comes to implementing the monitoring strategies since they have never failed to keep my site running. Thanks for this valuable support!!",
    "replies": ""
  },
  {
    "date": 1578568437000,
    "account_name": "Nick Kennedy",
    "url": "https://www.facebook.com/nick.kennedy.3517/posts/100574581484383",
    "article": "I’ve visited Up Service Site just to catch a glimpse of their website monitoring packages, and their services looked quite beneficial. So, I purchased their hosting package, and these guys did an absolutely remarkable job. All my websites are now 100% available to the customers with better functionality. Many thanks!!",
    "replies": ""
  },
  {
    "date": 1578984549000,
    "account_name": "Joseph Diaz",
    "url": "https://www.facebook.com/permalink.php?story_fbid=103109841233584&id=100046037045698",
    "article": "Up Service Site has been very helpful! Their website hosting services are by far the best in the market. Thanks to them, my sites are now more optimized and streamlined. Good Job.",
    "replies": ""
  },
  {
    "date": 1578393204000,
    "account_name": "Clark Cooley",
    "url": "https://www.facebook.com/clark.cooley.90/posts/100231368183204",
    "article": "I admire their support’s prompt actions while sending a notification for website issues. Moreover, all my business websites are running flawlessly. Thanks for the budget-friendly monitoring packages!!",
    "replies": ""
  },
  {
    "date": 1581147706000,
    "account_name": "Ethan Fisher",
    "url": "https://www.facebook.com/ethan.fisher.125323/posts/103862864525785",
    "article": "I love how timely their email and SMS alerts are. It is very useful for resolving issues efficiently and effectively—saves both time and money!",
    "replies": ""
  },
  {
    "date": 1578723602000,
    "account_name": "Robert Andrus",
    "url": "https://www.facebook.com/robert.andrus.988/posts/111036380426738",
    "article": "The team at Up Service Site is extremely talented and knows how to deliver top-notch website hosting services. I feel lucky to reach your site. Totally satisfying and I will keep working with you. A big thank you for all you did for my websites!",
    "replies": ""
  },
  {
    "date": 1582291302000,
    "account_name": "David Grady",
    "url": "https://www.facebook.com/david.grady.5099/posts/105720657691798",
    "article": "I did not know that uptime monitoring services can be so important. Up Service Site helped me establish and maintain my online business.",
    "replies": ""
  },
  {
    "date": 1575964507000,
    "account_name": "Tomas Rosario",
    "url": "https://www.facebook.com/tomas.rosario.165/posts/2548409598588144",
    "article": "Up Service Site helped me in monitoring my website’s performance greatly. My websites are now smooth and faster than ever before. The level of experience in their team makes them more excellent and efficient in delivering services to their clients. 5 stars without any doubt!",
    "replies": ""
  },
  {
    "date": 1575287444000,
    "account_name": "Xaris Xaroulis",
    "url": "https://www.facebook.com/xaris.xaroulis.902/posts/2526553834087521",
    "article": "Must say, I have hugely benefited from their excellent service. Their monitoring has allowed me to remotely manage my business websites whenever and wherever I wish to. Great! Looking forward to working with these people further.",
    "replies": ""
  },
  {
    "date": 1579330616000,
    "account_name": "Dennis Braden",
    "url": "https://www.facebook.com/dennis.braden.7355/posts/106900497521126",
    "article": "Had their service for a month now. I haven’t gotten any incidence report so I thought maybe it wasn’t picking up hosting issues. But when I checked the actual service logs from my hosting service, it was consistent and there were no major downtimes. So good job to the monitoring system but especial kudos to my web hosting service for a consistent service delivery.",
    "replies": ""
  },
  {
    "date": 1576153544000,
    "account_name": "Korbin Murphy",
    "url": "https://www.facebook.com/matttew.murphy/posts/2693972963979992",
    "article": "Great monitoring service! I really like its email and SMS alerts feature, which always keeps me updated with the current status of my business websites. With this, it has been easier for me to manage multiple websites from my system. Very happy with the results!",
    "replies": ""
  },
  {
    "date": 1578122882000,
    "account_name": "Michael Campbell",
    "url": "https://www.facebook.com/permalink.php?story_fbid=111555577031766&id=100045319731762",
    "article": "Top-notch service! Purchased their Platinum Uptime monitoring package and it has helped me a lot to manage my established business groups effectively. It has also helped us to maintain, and enhance the activity of my websites. 5 stars!",
    "replies": ""
  },
  {
    "date": 1575539482000,
    "account_name": "Deniz Ates",
    "url": "https://www.facebook.com/Deniz.Ates01/posts/2894380400581806",
    "article": "Monitoring your website’s progress is an important step towards getting detailed information about how well your website is working. Up Service Site has not only provided me with that but also helped me a lot to grow my business exponentially. Thank you so much! Highly recommended!",
    "replies": ""
  },
  {
    "date": 1577078721000,
    "account_name": "Michael Deloach",
    "url": "https://www.facebook.com/michael.deloach.14224/posts/110857717085866",
    "article": "I can unquestionably recommend Up Service Site as a reliable, persistent, and affordable website monitoring service provider. Thanks to them, my sales have increased by 30% within the first month. Thumbs Up!",
    "replies": ""
  },
  {
    "date": 1581753677000,
    "account_name": "Herbert Ogden",
    "url": "https://www.facebook.com/herbert.ogden.52/posts/104881201100841",
    "article": "Best uptime monitoring services provider online!",
    "replies": ""
  }
]