[
  {
    "date": 1582352164000,
    "account_name": "Edwin Reynolds",
    "url": "https://www.facebook.com/edwin.reynolds.526/posts/107178024212205",
    "article": "Great services! Very affordable prices too.",
    "replies": ""
  },
  {
    "date": 1583130545000,
    "account_name": "Katherine Thornsberry",
    "url": "https://www.facebook.com/katherine.thornsberry.58/posts/104956381116594",
    "article": "Affordable prices for such high-quality services. Great company!",
    "replies": ""
  },
  {
    "date": 1582522944000,
    "account_name": "Hayley Giles",
    "url": "https://www.facebook.com/hayley.giles.5473/posts/114247000165095",
    "article": "Excellent customer support team. Every time I have a concern about my blog site, they always make sure that I understand what is happening and what needs to be done to resolve the problem.",
    "replies": ""
  },
  {
    "date": 1582791215000,
    "account_name": "Steven Vesely",
    "url": "https://www.facebook.com/steven.vesely.58/posts/112574690339875",
    "article": "Their hosting services use cutting-edge technology. It is also amazing that the prices are affordable. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1583472738000,
    "account_name": "Ramon Michaud",
    "url": "https://www.facebook.com/ramon.michaud/posts/107022134247003",
    "article": "Amazing customer support team and five-star quality hosting services.",
    "replies": ""
  },
  {
    "date": 1582091352000,
    "account_name": "Donald Russell",
    "url": "https://www.facebook.com/donald.russell.5203/posts/112849850299748",
    "article": "Perfect for moms like me who are planning to start their own blog site. VisionarySite.org helped me build my own blog site in the best way possible. I will always be thankful to them!",
    "replies": ""
  },
  {
    "date": 1580985837000,
    "account_name": "Hailey Eichhorn",
    "url": "https://www.facebook.com/hailey.eichhorn.3/posts/108846707350076",
    "article": "Traveling and writing about my exploits is something I’m deeply passionate about. This is what got me into blog writing and creating my very own website. Visionarysite.org provided the hosting service and so far, I only have praises for the quality of hosting service that they provide. Thanks again Visionarysite.org.",
    "replies": ""
  },
  {
    "date": 1579844544000,
    "account_name": "Mary Trahan",
    "url": "https://www.facebook.com/mary.trahan.146/posts/104066194484278",
    "article": "Previously, I have used a lot of blog hosting services, but the results I have got by using the Blog Hosting Ultimate package of Visionary Site is just commendable. This excellent service enabled me to launch my website without any kind of limitation. And genuinely speaking, if you are looking for something sustainable in the long-term and of best value then these people would be best for you. Highly recommended!",
    "replies": ""
  },
  {
    "date": 1580211319000,
    "account_name": "Kenneth Lewis",
    "url": "https://www.facebook.com/permalink.php?story_fbid=113026863582362&id=100046251468759",
    "article": "I was still an aspiring blogger when I came across VisiorySite.org. I was surprised to see how affordable their hosting services are, so I did not even hesitate to try their starter package! No regrets since they really deliver what they promise!",
    "replies": ""
  },
  {
    "date": 1578479766000,
    "account_name": "Sonya McGuire",
    "url": "https://www.facebook.com/sonya.mcguire.739/posts/106535647545266",
    "article": "I highly appreciate the working approach of the Visionary Site! With their amazing hosting services, my websites are running smoothly and have yield potential leads that were almost impossible for a newly established site. Thanks a lot!!!",
    "replies": ""
  },
  {
    "date": 1579068752000,
    "account_name": "John Gearheart",
    "url": "https://www.facebook.com/john.gearheart.752/posts/107053344167997",
    "article": "Visionary Site has been hosting my websites for the past three months, and I haven't found anything to complain about. They never ignored any issues stated by me and worked hard to fix it. Truly great.",
    "replies": ""
  },
  {
    "date": 1577710437000,
    "account_name": "Helen Cancel",
    "url": "https://www.facebook.com/helen.cancel.3/posts/109685917214170",
    "article": "They are real professionals, put all their efforts into providing you with the best. Have used their starter pack, and everything is going pretty smooth!",
    "replies": ""
  },
  {
    "date": 1578121818000,
    "account_name": "Jerry Donaldson",
    "url": "https://www.facebook.com/jerry.donaldson.1654/posts/108683233989059",
    "article": "I am more than impressed with the excellent hosting services of Visionary Site. It is just amazing how well they have been managing my websites. I would highly recommend them to everyone out there. Thumbs up!",
    "replies": ""
  },
  {
    "date": 1578916756000,
    "account_name": "Anna Hammons",
    "url": "https://www.facebook.com/anna.hammons.73/posts/102954901247748",
    "article": "Visionary Site has always provided me with a reliable blog hosting service that we small business owners crave for. None of my websites have faced technical issues after switching to them. I cannot recommend your company highly enough!!",
    "replies": ""
  },
  {
    "date": 1578724428000,
    "account_name": "Eddie Puga",
    "url": "https://www.facebook.com/eddie.puga.77/posts/104763394394955",
    "article": "Thanks a lot, Visionary Site!! Your services are excellent. I don’t have any headaches anymore since my business websites are always available to the users. Keep supporting us!!",
    "replies": ""
  },
  {
    "date": 1581659387000,
    "account_name": "Johnny Stephens",
    "url": "https://www.facebook.com/johnny.stephens.965580/posts/102502361339956",
    "article": "The basic service I got from Visionarysite includes 3 websites hosting capabilities, 2 databases, unlimited email address, and 500MB of hard disc space. And all of that for just a few dollars a month. If you’re looking for affordable but dependable blog hosting services, Visionarysite is really the way to go.",
    "replies": ""
  },
  {
    "date": 1580378995000,
    "account_name": "Matthew Wickman",
    "url": "https://www.facebook.com/matthew.wickman.90/posts/109862213905767",
    "article": "Perfect for bloggers like me! Five out of five! I will definitely recommend it!",
    "replies": ""
  },
  {
    "date": 1573287037000,
    "account_name": "Chester M. Hamilton",
    "url": "https://www.facebook.com/chester.m.hamilton/posts/2366290000298596",
    "article": "I came here to drop my words and say thanks to Visionary Site for the services that I have received. These people have provided me with the best web hosting solutions and usually answer my questions immediately. I am happy I used their service. 5 stars!!",
    "replies": ""
  },
  {
    "date": 1580883051000,
    "account_name": "Tyrone Mason",
    "url": "https://www.facebook.com/tyrone.mason.1610/posts/107740300792789",
    "article": "As a way to deal with grief and depression, one of the things that my therapist recommended was to write. Write about my thoughts, find my voice and share it to others. So I started a blog site to document my journey. In a way, Visionarysite has been instrumental with my recovery because their blog hosting services provided me an avenue to share my thoughts to others.",
    "replies": ""
  },
  {
    "date": 1572509719000,
    "account_name": "Donna J. Huckabee",
    "url": "https://www.facebook.com/donna.j.huckabee/posts/3036330816592984",
    "article": "Glad to say that I have been using their cloud hosting service, and I have never faced any issues with it. Their support techs are always ready to help, and I have always got the best results. Excellent work!",
    "replies": ""
  },
  {
    "date": 1572415156000,
    "account_name": "David L. Hill",
    "url": "https://www.facebook.com/DavidLHill20/posts/2409655689322847",
    "article": "I just came here to thank Visionary Site for hosting my blogging site so well. It runs smooth, and I face no problems while operating it. The disc space is quite commendable as well. Best web hosting service at the most affordable price. 5 stars!",
    "replies": ""
  },
  {
    "date": 1572860517000,
    "account_name": "Evelyn E. Cook",
    "url": "https://www.facebook.com/Evelyn.E.Cook4/posts/1686704714816917",
    "article": "Visionary Site has been hosting my blogging sites very well for the past few months. Started using their service by a friend’s recommendation, and very happy with the outcome. Their customer support is very friendly as well, I usually face no issues with their service. 5 stars!",
    "replies": ""
  },
  {
    "date": 1571140967000,
    "account_name": "Gabrielle Nash",
    "url": "https://www.facebook.com/gabrielle.nash.791/posts/694645527709393",
    "article": "I am very happy with the excellent customer service. They always answer my phone quickly and clear all my queries instantly. Great Services!!",
    "replies": ""
  },
  {
    "date": 1571980537000,
    "account_name": "Michael Kunzon",
    "url": "https://www.facebook.com/michael.kunzon/posts/1396872387132566",
    "article": "Working with Visionary Site has been very rewarding! They've solved every technical challenge that we've thrown at them. Their work is very reliable and error-free. I would highly recommend them.",
    "replies": ""
  },
  {
    "date": 1580727393000,
    "account_name": "Michael Duke",
    "url": "https://www.facebook.com/permalink.php?story_fbid=100838201493249&id=100047012072202",
    "article": "5 stars! I have been using Visionary site's blog hosting platinum services for a couple of months, and so far it has been amazing. Thanks to them, I can now manage all of my websites more efficiently. I would love to continue using their services.",
    "replies": ""
  },
  {
    "date": 1575459484000,
    "account_name": "Dara Entrekin",
    "url": "https://www.facebook.com/dara.entrekin/posts/102986621191643",
    "article": "My business depends entirely on constant online presence, and the website is a reflection of its vision and credibility. Would like to pass high gratitude towards Visionary site for providing such great hosting services. My sites are now bug-free and with an ability to attract more visitors. These guys are truly proficients, that’s all I want to say!!",
    "replies": ""
  },
  {
    "date": 1571203968000,
    "account_name": "Robert Barnett",
    "url": "https://www.facebook.com/Robert.012Barnett/posts/2720151698016469",
    "article": "Visionary Site is really the best hosting service in today's marketplace. They have kept our servers running 24/7 without any bugs and connectivity lag. I would continue to do business with them!",
    "replies": ""
  },
  {
    "date": 1575697398000,
    "account_name": "Adrian Albert",
    "url": "https://www.facebook.com/adrian.albert.98031/posts/103504997809680",
    "article": "As a startup owner, I was concerned about using a hosting service. For a trial, I invested in the Visionary Site's starter hosting package, and it turns out to be working great for my business. The sites have become much smoother and are working great. I have already upgraded my package to their premium one. 5 Stars!",
    "replies": ""
  },
  {
    "date": 1577950027000,
    "account_name": "Marilee Rivera",
    "url": "https://www.facebook.com/marilee.rivera.92/posts/112012166982555",
    "article": "Top-notch services. 5 stars!",
    "replies": ""
  },
  {
    "date": 1569659434000,
    "account_name": "Brenda Shuler",
    "url": "https://www.facebook.com/brenda.shuler.14/posts/1196258957241747",
    "article": "Highly skilled team! These people helped me to build a website that was way better than I expected, and the customer support people were also very communicative all along. Looking forward to work with these people on many more projects.",
    "replies": ""
  },
  {
    "date": 1581333249000,
    "account_name": "Brian Solis",
    "url": "https://www.facebook.com/brian.solis.3990/posts/112023933701010",
    "article": "I think that being able to host several websites for just a few dollars a month deserve a shout-out. Visionarysite.org provides everything necessary in a web hosting service that a budding entrepreneur like me would need.",
    "replies": ""
  },
  {
    "date": 1571393366000,
    "account_name": "Soumaia Sahrawia",
    "url": "https://www.facebook.com/soumaia.sahrawia/posts/2507109999355853",
    "article": "We've found Visionary Site to be extremely professional, resourceful, and helpful. Our company has been using its colocation hosting services for a year now, and the outcomes have always been great. Will use them even further. 5 stars!",
    "replies": ""
  },
  {
    "date": 1568792977000,
    "account_name": "Peter Foxx",
    "url": "https://www.facebook.com/peter.foxx.54/posts/2978233795525899",
    "article": "These people are always there to resolve my queries. Fast and efficient. They have been hosting my domain very well and I face no issues while operating it. Good job!",
    "replies": ""
  },
  {
    "date": 1578309627000,
    "account_name": "Margarita Steele",
    "url": "https://www.facebook.com/margarita.steele.3/posts/111609783695406",
    "article": "With one of my friend's recommendations, I started using the services of Visionary Site, and I must say, my websites are running even more smoothly and without any issue. Thank you!",
    "replies": ""
  },
  {
    "date": 1569051173000,
    "account_name": "Marion Sanchez",
    "url": "https://www.facebook.com/marion.sanchez.16906/posts/2460191050744374",
    "article": "Switching to Visionary Site has been great for our company. Their customer service has been excellent and they always respond quickly to our problems. Having all our web hosting done under one roof has been very convenient.",
    "replies": ""
  },
  {
    "date": 1568271307000,
    "account_name": "Korbin Murphy",
    "url": "https://www.facebook.com/matttew.murphy/posts/2496606917049932",
    "article": "These people helped me to develop my website and I am very happy with how it turned out. It looks great even on smartphones and tablets, doesn’t crash, and operates really smooth. Very happy with your service. Good job!",
    "replies": ""
  },
  {
    "date": 1581484649000,
    "account_name": "Howard Shedd",
    "url": "https://www.facebook.com/howard.shedd.3/posts/100355351555681",
    "article": "Slow loading web-pages was the only issue my previous host provider couldn’t solve. I’m glad that I contacted Visionary Site on the recommendation of a friend. My website is now loading faster, and more visitors are arriving on it nowadays. Thanks for the amazing work!!",
    "replies": ""
  },
  {
    "date": 1573022303000,
    "account_name": "Skye Dawes",
    "url": "https://www.facebook.com/permalink.php?story_fbid=1404699533027226&id=100004615785199",
    "article": "Great blog hosting services at an affordable price. I am glad that I switched to this company. Well done guys!!",
    "replies": ""
  },
  {
    "date": 1568447116000,
    "account_name": "Alexander Reyes",
    "url": "https://www.facebook.com/alexander.reyes.52493/posts/10159070746249152",
    "article": "I purchased their blog hosting premium pack and it hosts 3 of my websites together. Their hosting is good. My websites look systematic and run smoothly. Good job!",
    "replies": ""
  },
  {
    "date": 1579334235000,
    "account_name": "Cynthia Garza",
    "url": "https://www.facebook.com/cynthia.garza.7568/posts/100776804810095",
    "article": "For the longest time I worked as a freelance writer, doing content like blogs and articles for other people. I finally got the courage to start my own blog hosting service and I did it with VisionarySite.org. Since I’m still testing the waters, I didn’t want to make a big investment on an ultra-premium hosting service but I didn’t want to compromise on basic features either. VisionarySite.org had the right service package for that. A week into it and I already have my first client! Thank you VisionarySite.org.",
    "replies": ""
  },
  {
    "date": 1579698623000,
    "account_name": "Darlene Mabon",
    "url": "https://www.facebook.com/permalink.php?story_fbid=106608114223155&id=100046219000704",
    "article": "I’m a middle child in a brood of 12 (yes, 12) and although I never married myself, I became the de facto nerve center of our huge family. If it was Christmas or Thanksgiving, everybody celebrated it at my house. I’m the one who made sure that my brothers and sisters and their respective families had very close relations with each other or at least ran at an even keel. I was Super-Aunt to my beloved niece and nephews, a title I truly cherished. Now to help things along I decided to create a dedicated family website, like an online family album and event organizer where everybody can stay in touch or get updated with the latest happening. That’s when I got a blog hosting service form VisionarySite.org. I made our fancy family dot com site and everybody has their own email with our family name as the domain. It was a hit with our family and I appreciate how VisionarySite.org made the task easier than expected.",
    "replies": ""
  }
]